{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=1","asin":"B0CTD6PRBY","page":1,"pages":615,"reviews":[{"id":"R200D2R17EYS30","title":"5.0 out of 5 stars Worth the hype! Sounds so good!!","author":"Justin Ellis","rating":5,"content":"Okay, so I should start by saying I have seen a ton of Youtubers who push these... I get it now.A few years ago I bought some Beats, Powerbeats Pro to be specific. Now granted, I didn't read into them but I will say I paid $200+ tax for them. They are the most expensive yet flat sounding headphones I've ever owned.These Raycons, at nearly 1/4 of the price, thump so nice. I LOVE the clarity and warmth on these and FINALLY the bass is actually bass. It feels like I'm outside in my Jeep with the windows up, nearly full blast... they're so good. I enjoy the portability and design, at least of the black ones I got.They connect and setup very easily and painlessly. They do come with other ear accessories but I haven't messed with them, they fit perfect right out of the gate. I like that there's not a single button on the device.I watched episode 8 of the Acolyte just now with them, my ears don't hurt and they were spectacular. I can't recommend these enough!","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFK5E5QE6Y4IORTKUAYINEUO6ZCQ","is_verified":true,"helpful_count":34,"product_attributes":"Color: Carbon Black"},{"id":"R1XQWJRF9AMSUS","title":"5.0 out of 5 stars Love these earbuds","author":"Garrett","rating":5,"content":"(This is my honest opinion) These earbuds are very stylish, comfortable and have great audio quality. Battery life is also very good. They're not very expensive, especially for the quality that you get for the price. Arguably, one of the best earbuds I have ever purchased. Personally, I very much recommend these.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AHINPYDXFX2VXZ653S5E7A6SUJYQ","is_verified":true,"product_attributes":""},{"id":"R2Z91LOHEF7JYR","title":"5.0 out of 5 stars Amazing especially for the price.","author":"Cristina Lowenfeld","rating":5,"content":"If you want a great set of earbuds for the price these are the ones to get. I’ve had beats and I’ve had JBL‘s but these by far are my favorite. The charge lasts a long time, the bass is better than the ones I’ve had before, the base is even better than the JBL’s, and sometimes they have these on sale for $60 as well so keep an eye out on that. I wear earbuds every day and these have been by far my favorite. I’m sure theres some other very good ones but that’s if you’re willing to pay 250-$300. Yet why pay that when these are pretty on par to those ones. I would say give these a try. Everything is great, the Sound quality and the noise cancellation. I only have one thing bad to say. You can’t go very far from your phone with these, that’s the only thing because they will cut out. Yet most of the time you’re gonna be close to whatever you’re watching or listening to anyways. I’ll always buy this brand. Seriously the bass on these is better than any earbuds I’ve used. Great for gaming, watching Tv/youtube, music, and everything. Also there’s an awareness mode that lets you hear what’s around you in life if you need to pay attention to stuff outside while you listen to whatever. Very easy to use when it comes to switching modes.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AHVXJD7XEAP533ZBBWESWLYBDGVQ","is_verified":true,"helpful_count":24,"product_attributes":"Color: Royal Blue"},{"id":"R31TVKOFFE0S4V","title":"4.0 out of 5 stars Great Little Buds","author":"Matt","rating":4,"content":"I was an iPod user for years when I started noticing the battery life dwindling. I’ve seen some advertisements for these so I decided to try them out and what can I say these are great little ear buds:Pros:Comfortable- these fit in your ears with no little tail that sticks out of your ears. This is an added plus for me cause I can actually sleep with them in with no issue.Battery life - so far battery life seems above and beyond other brands was stuck in a delayed flight for 2 hrs plus the 4 hr flight time and still had 40% battery life according to my phone.Sound - great sound and 3 different options to choose from depending on your preference or music choice.Price: Cheaper than most comparable brands.Cons:The charging case - the charging case is small and compact, but the lid is very thin and I feel like it could easily be broken off if you aren’t careful with it.Awareness mode, I feel like there is still some noise isolation in awareness mode and I sometimes don’t feel as though I’m as present in the environment as I should be with that mode enabled.Fit: while I don’t have an issue I can see people with smaller ears may have an issue with the retention of the buds in their ears.No tracking: I get these aren’t integrated into the various tracking apps that phones these days have, but it would be nice if it were integrated cause these things are small in their case.","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AEZWOV2DA5KHY7LUJE2LQN7E6HNQ","is_verified":true,"helpful_count":22,"product_attributes":""},{"id":"R1LFS8RDVSK7IZ","title":"5.0 out of 5 stars My favorite ear buds!!!","author":"SuzyLane","rating":5,"content":"Got the blue ones. These were a hand-me-down from my stepson. He said they would hurt his ears \"after a while.\" A while is approximately 1hr-10hrs, 'cause he used them while gaming. Other than that, he loved them. Did a lot of research prior to buying and these seemed the best for him.I use them for listening to Pandora, while walking the dog, as well as using just one, so I can hear myself playing acoustic bass, and singing along with whatever's playing on them. I used to design loudspeakers for Polk Audio in the mid 80's till mid-90's. Done my fair share of critical listening, and won't buy or use anything else, regardless of price. Polks are simply the best.I love my lil buds!!! I've used others in the past: JBL - nice, and quality-made. Motorola (w. headband) - pure junk - stay away. Sony (both wired and wireless) actually my 2nd favorite - but for the price, excellent. Monster over head big phones - liked them way better than Beats' shrill, and boomy sound, but, couldn't get a good fit, w their buds. KOSS wired el cheapos - great value, and audiophile-quality sound, but, very flimsy, and not as good as these, soundwise, for my personal taste. Koss buds - ok sound and mic, terrible build quality. Polk Audio buds - best I've ever heard of ANY headset - and worth the price if you can find them, slightly used. Mackie - meh - loud. Bose buds - excellent, but, terrible warranty and cust. service. Bose over-ears - nothing spectacular. Sennheiser - love mine, and they're 40 years old. Modded to fit inside Howard Leight V3, over-ear noise cancelling phones - and they're my in-house go-to for accurate sound reproduction, amateur recording, and over-all listening. Sennheiser wireless w. transmitter - outstanding for late-night watching or gaming. Almost completely silent to others', nearby, when in use. Very accurate surround sound reproduction. Slightly expensive, but, worth it. Nothing else compares in this price range. - Need a lot of AA batteries to use. Also tried other brands, but, none were as nice as these.The bass in these is incredible. You can \"feel\" the subsonic frequencies. No other buds were able to replicate lower bass frequencies as well as these. Not even close.Clarity of sound. You can hear every nuance of the recording. Every song sounds better, and I've discovered sounds and parts of songs, which I've never heard through ANY listening device. Not overhead earphones, and I'm talking expensive studio-quality gear, costing 100x more than these lil buds. You can hear every instrument, in its \"location\" on the stage, or studio, if different. Even the player's fingertips when playing, or using other plucking techniques. You can hear the singer's breath while singing in the song. Amazing big-room, studio, hall, or live concert sound reproduction. The Who's Quadrophenia is like nothing I've heard before, regardless of system, period. I've tried all the different sound options, but, being a bassist, I stick w/ the Bass setting. It's louder, and actually clearer. They've never distorted on me, except through a generic free smartphone. Sound varies somewhat through PCs, laptops, and other cell phones, but it always sounds good.The color is nice. They match my car's color, lol. Quality build. I've dropped them, sat on them, stepped on them, and went a whole summer of high temps, sweat, and rain. A few charging issues, due to dust in the charging port, and my failure to use them as instructed. You can also charge them wirelessly!!! Bluetooth works every time, quickly and flawlessly. I, usually, get about a month, before it's time to recharge the base. This depends on charger, charging method, and amount of daily use.All that at a fair price... some would even say, inexpensive, compared w. other 'phones which cost WAY more. Obviously I recommend these ear buds.Bottom line - get these!","timestamp":"Reviewed in the United States December 3, 2022","profile_id":"AHKXF5CQBBXVZ5XCHBOKFZNWXNNA","is_verified":true,"helpful_count":393,"product_attributes":""},{"id":"R11WL0PQCOXFC0","title":"5.0 out of 5 stars Clarity and Ease of use.","author":"JamesR","rating":5,"content":"I was skeptical of buying these over many other brands because I was not familiar with Raycon. To my pleasant surprise, they are incredible. When I got them in the mail, I at first thought they sent me an empty box, they are so light. Mine were already charged and ready to go when I received them. It came in a white colored box cover but when you removed this there was a very sharp black box which you could actually use as a present, it was this nice. Opening the box, you had three smaller boxes, one for the strap and usb. One for the earpieces, and the last for the minimal instructions. The Ear buds themselves were contained in the main box itself. This was a very classy presentation, and I was excited to try this out.Connection was quite easy and the clarity... Amazing, the music felt like it was inside my head, and I could hear every word within the songs. [As a side note, I realized I misunderstood some song lyrics for years.] As a veteran, and in my 60's I have some hearing loss, but I tell you truly, listening to music through this device is incredible. For the price, this is a steal. I cannot comment on battery life at this time because I only have had these for 24hrs. Lastly, I thought they would fall out because of how light they were but incredibly I could go on a brisk walk, and they didn't budge at all, very nice.Postives: Very inexpensive for what you are getting. A great presentation box, beautiful color [Mine is Candy Apple Red], Ease of use, Very Light, Comfortable and the Clarity is amazing for what I paid for it.Negatives: The only downsides to me where the instructions that came in the box. I had to go to the internet and type Raycon instructions to find out how to actually use them. The only other possible negative was choosing the correct earpiece for your ears. They are small and are really easy to drop and lose. They are also a little difficult to actually put on the earbuds themselves, but this is true of all earbuds I have used in the past. My recommendation is to try the pair that is already on the buds, if they fall out, they are too big for your inner ear. I had to use the smallest set to get them to fit correctly.","timestamp":"Reviewed in the United States March 16, 2024","profile_id":"AE65XNQETGZ2LEDHFJZZFOSLOXUQ","is_verified":true,"helpful_count":129,"product_attributes":""},{"id":"RYAMZZ5FH81G8","title":"3.0 out of 5 stars Solid \"B\" grade. 3.5 stars, Music sounds great, phone works great, awareness mode needs help.","author":"MDM","rating":3,"content":"I got the E25's, black. Packaging is nice, comes with a brief, clearly written user manual which I used right away to see how to change the sound options. I use a Samsung Galaxy S20 FE 5G, and I took these buds out of the package, directly out of the case and put them right in. The default female voice told me they were powered on right away, sounding in both ears, in the order i put them in. Opened bluetooth options on my phone and they were already listed as \"Raycon Everyday Buds.\" I touched the name and they connected right off without any issue whatsoever. Hit play on my music, and I love the sound. I just opened them today, so I'm waiting to see how these endure before giving full stars.The button in each bud is a physical push button, a bubble that clicks. I like it because the sweaty strap from my bike helmet won't press it inadvertently like my old buds that just had \"touch control.\" You can't see the bud when you reach up to touch it, so it's always a game of fumbling with where to touch it and how many \"touches\" would register. Especially when on the mountain bike, that frustrated me, but maybe you like it (wierdo)...Sound quality:I love all three modes. \"Balanced, Bass and Pure\" they all sound good while bringing in their individual strengths. For piano pieces, like Paul Cardall or Ludivico Eiunadi, Pure Sound is precise. For Van Halen, Nightwish, and Godsmack, Balanced sound and Bass modes are excellent. It's all subjective anyway, but I can hear the details and fairly crisp sounds.Awareness Mode:This is my first time trying buds that have a mode where they claim to allow you to hear ambient noise around you while still enjoying the music. Raycon calls it \"Awareness Mode\". It works, but not as i had hoped. In my mind, I had anticipated being able to speak while listening to my music and hear my voice and others' clearly through the electronic mic instead of through jawbone vibrations like when you plug your ears with your fingers and speak. These buds can do that, but you can only hear it faintly, and I find myself wishing I could turn up that volume. But if I turn it up, only the music gets louder and the ambient sounds are left behind as the music grows in volume. The ambient sound volume is constant, and only works well if I turn the music off. Which is a disapponting feature because then what's the point? Without the music, I might as well remove the buds right? All buds claim to have powerful noise canceling, but what I'm hoping for is exactly the opposite, I want to hear my music and all the ambient sounds while biking, running, and working at my computer. It should be like hearing the world around me but with cool music that nobody else can hear. Why isn't this an option? Maybe I'm the wierdo.The fit is okay... It comes with multiple gel sizes. The default sizes were a bit tight, so I downsized them by one, and they are comfortable for about 15 minutes then I have to push them in again. Not quite settled on which size of gel I should be using. This shouldn't be that difficult but...UPDATE: 8/24/22I've had them for over a month now. Still working as they did they day I opened them.*The container charges in just a couple hours*The longest I have had these in is about 5 hours, my ears became fatigued from the fit before the battery ran out while I was backpacking. The buds charged up and container still had more than 50%*PHONE CALLS: I haven't had problems hearing clear audio from the phone calls. When I ask the other caller how I sound they have told me I'm difficult to hear well. If i turn off Bluetooth and speak directly into the phone they report my sound as being much better. Not impressed with the microphone quality. But I have had no problems at all hearing the other caller clearly.*I have not yet had any connection problems with my phone*I still am disappointed with the Awareness Mode. It's very underwhelming compared to my daughter's Jabra Elite Active 75 earbuds with the same feature. Those are significantly better in this regard.*I wear these while mountain biking, they stay in fine, but I don't bomb down the mountain either.*I really wish I had the ability to adjust the equalizer settings but it's fixed in stone. The app is a complete joke, no functionality at all. No my friend, if you want to adjust the equalizer, these are not for you. I do wish I could adjust the bass to be more pronounced, and the highs to be a bit sharper.12/2/2022 UPDATE: over 1 year ownership..I still have these and they still work as described above, they hold charge forever. But at this point I'm ready for a different pair just because of the phone call quality and the weak awareness mode. I've also found that I can't remember how to use all the features because the push button functions aren't very intuitive, and no app to use for adjustments. I can answer a phone call, one push in either ear, but the quality is still reported as \"difficult to hear.\" I'm going to be buying a different brand.You should buy these if:-You don't care about the awareness Mode-You just want something that holds charge very well and will last a long time.-Plays music with clear quality and have no desire to mess with sound settings.-You want something with rock solid, reliable, connectivity.You should not buy these if:-You want to talk on the phone a lot-You want to hear the details of what's going on around you clearly while still listening to loud music-You like to adjust the equalizer","timestamp":"Reviewed in the United States July 23, 2022","profile_id":"AEALUFESZ2ILQK6QHBIASNCGQFMQ","is_verified":true,"helpful_count":843,"product_attributes":""},{"id":"R1VYTUMHBGLI4G","title":"2.0 out of 5 stars “Feature upgrades” seem to be rendered completely useless by design changes (review in progress…)","author":"SunnyLK","rating":2,"content":"I had 4 pairs of the previous autocorrection.cancel (because 1- I wasn’t the best about remembering to charge, & 2- I am the WORST about losing the case, 1 or both buds, etc; I listen to audio books in bed & frequently have to search the bed/sheets in the morning if I fall asleep while listening, as frequently happens). I LOVED the previous model, and recommended them to everyone.Unfortunately (but unsurprisingly), I lost a pair in the capsule a couple weeks ago & I replaced with the 2024 model. I have used them twice now, and here is my honest opinion. (Reference: I use Apple devices, if it matters to anyone)Appearance: 3-4 stars - They look like earbuds. Not a huge range of colors available. I’m not a big fan of the muted colors, preferring the strong jewel tones, but that’s personal preference. I wouldn’t be surprised if more colors become available later.Sound Quality: 4-5 stars - I don’t often listen to music, using buds mostly for podcasts, videos, tv shows on devices, & audiobooks. Even when occasionally listening to music, I don’t change the sound settings. As with the older model, you must ensure they are seated correctly to get the best sound (put in correct ear & rotate forward).Network/Bluetooth Setup: 5 stars - Easy to use with Apple devices. Turn on, open your Bluetooth menu and select the device. It was good for ME that the new model shows up as a slightly different name as the previous model, so it was easy to tell which device to connect to.Features: 5 stars - Sound canceling is great; I frequently put earbuds in to listen to news, tv, podcasts to allow hubby use of the tv. Additionally, hubby fired a shotgun outside the window to kill a snake & I barely HEARD the shot, only FELT it, & I don’t turn anything up loud, usually listening at less than half volume. Noise canceling turns on & off, & I was surprised at the difference.Device Range: 5 stars - I can leave device in one end of the house and go to the other side without losing connectivity, only having minor skipping if I bend down (changing bed sheets, eg).Battery Life: 2-3 stars - This is Raycon’s big distinguishing feature & there seems to be a change from previous models. Seems earbud battery life has been shortened by 1-2 hr, but that the case can now provide 3 charges of 2 earbuds rather than 2, & earbuds are fully charged in ~10 min. The quick charge is great, additional charges are nice (now 4 charges if everything fully charged as opposed to 3).Comfort: 2-3 stars - I am small woman, earbuds themselves are a little large for my ears. As long as they are properly seated, they are comfortable, but if I fall asleep with them in, I have frequently woken up to remove them because they hurt. This is more my fault than that of the product, these are LOADS more comfortable than the Skullcandy earbuds I used previously.**Ease of Use: 0-1 Stars** - This is where the new product falls short to me. Like everything electronic these days, the device thinks it knows what you want rather than giving you the ability to control these things yourself, and frequently assumes you are stupid. I do not know if Raycon has an app because I never needed one before, but I suppose I’ll be checking after writing this review.When listening at night, I only want to use 1 earbud, but will remove both from case & turn 1 off, because I frequently fall asleep, & lose earbuds. However, these earbuds do not have a physical button, but rather a touch surface. Thankfully, you do have to press the “button” (surface) with your finger. In an attempt to ensure earbuds maintain max bat life, I want to charge them together after full bat discharge. However, after the first night of usage, I awoke to TWO dead earbuds rather than 1. The next night (last night), I had to take PARTICULAR CARE to set the unused bud on the little ceramic tray I use just for this purpose, and had a charged Bud this morning. However, after my office cleared and I turned off the earbud to listen (again, TAKING PARTICULAR CARE to watch finger placement as I removed the earbud), I noticed the earbud SWITCHED ITSELF ON AGAIN. I have no memory touching it (but I probably did), but for practical purposes, the d*mn thing turned itself on. I had to turn off my Bluetooth so I could be sure that, if it couldn’t find a connection, it would switch back off.**THIS IS A PROBLEM.** It completely erases the Raycon’s distinguishing featur & primary selling point- the charging case- if you’re spending these charges recharging the device after it mysteriously switches itself on (whether by accidental bump, failure to take PARTICULAR CARE when handling, etc). With a shortened battery life in the device itself, this makes this problem even more egregious. Like EVERYONE, I have a busy life & my time is valuable. If I need to make a call while driving & only have a limited bit of time to make that call during that drive, or if I need to be on a conference call at a certain time, I need confidence that my device will be in the state I EXPECT it to be in; this is why I happily paid for 4 other pairs of Raycon, to ensure I had what I needed when I needed it & to match my habits/lifestyle. I like/appreciate the new rapid charge, but the device’s unfortunate habit of turning itself on kind of negates this feature.My devices need to make my life easier and behave reliably. If I must fight with them, or they are unavailable when I expect them to be, then they are not adding value, saving time, or allowing me to multi-task, they are creating additional problems that I need to deal with, and I don’t have the patience for that.I’m an engineer, so naturally, I DID NOT read the instruction manual (I never NEEDED to, before; they’re freaking earbuds, not nuclear missiles), but in order to give the product a fair chance, I will read the d*mn thing & see if any available apps might help with the issues I’m having, but thus far, have been extremely disappointed. Would rate the new 2024 model somewhere between 1.5-2 stars overall, after being a loyal customer previously (this is my 5th pair, after all).Because I’ve only used for 2 days, I have not discovered whether these will connect to my phone while still in the charging case as the old model would, but as this was only when the case was on its final charge; it was an irritating problem, but one I could live with. If that turns out to be an issue with this model as well, then these WILL be replaced, IMMEDIATELY. This new design already has too many problems, and adding another- a problem already known but not fixed- will be a dealbreaker for me. Releasing a “new model” is much less important than having a reliable product without any “unadvertised design features” that are actually “design flaws/bugs”. Devices should not automatically turn on & burn battery just to auto connect to a device. If it is supposed to (though I can’t think of a reason WHY earbuds SHOULD auto connect if they aren’t in use, they can’t be charged while in your ears, and why burn battery life if they aren’t in use?), that feature should be able to be toggled.Of course, I’m also the idiot that thinks one should be able to tune their own algorithms in search engines & SM recommendations rather than allowing companies to attempt to predict what IT thinks I’m asking (a conclusion I reached while shopping new washers after spending an hour searching HOW a “dirt sensor” works on a washing machine and getting 5 pages of AI-generated garbage results that tell me, in nearly identical language WHAT it is and how wonderful it was, and how it was probably going to single-handedly save the world before finally finding the answer I was looking for: it was a turbidity meter that probably wouldn’t work so great when your house has its own water well, like mine does), so perhaps it’s just me.To those about to reach the end, I salute you. You deserve a medal of some kind, but honestly, I’m just a salty old engineer who wants her d*mn earbuds to work the way she expects, so I have zero… medals to give. Will try to remember to update if I have anything relevant to add to review. Thanks for your time, tho :)","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AHL2OHJPRVCLVVM7OTHKVTMXIQBA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Forrest Green"},{"id":"R38D7EW6185J0Z","title":"4.0 out of 5 stars Works well and okay quality. Stays in your ears while working!","author":"Matt Gallagher","rating":4,"content":"Well. For the price point I really can’t complain. BUT I still have my gripes. I use these everyday for work it’s a physical job directly over water all day long and they have yet to come loose or even feel loose at all. The quality of the sound is not very good considering the type of earbud this is but it’s not terrible. Phone calls are not hands free. I use these at work so I get tons of incoming calls the quality of the calls is awsome and i asked a co-worker yesterday if they could tell when I switched from my phone to the air buds and they could not. But answering and ending calls is difficult and doesn’t always work, leading me too pull out my phone (over water) to do that.There is no charge notification, I have a headphones at home that will notify me if it’s high medium or low when I start them and these do not. I find myself halfway through a job and they will tell me the battery is low and about to die over and over and take a while to charge. This stinks when you leave them and charge them in a work truck!Otherwise happy with these, especially the fact they are comfortable and don’t fall out of my ears even if I shake my head.","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AFDVVVRPWMMOYBFS2VJHOISEQBXQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Forrest Green"},{"id":"R2R6H1QDZZRMI3","title":"5.0 out of 5 stars Insanely Impressed","author":"John Magda","rating":5,"content":"So first off-wow. When I bought these, I bought them because I was ridiculously tired of replacing my AirPods when they would suddenly stop working, just hoping for a cheaper alternative and these surprised and impressed me in comfort and quality. But then, I had them in the upstairs of our garage and they fell 10+ feet into the middle of the disaster that is typical of garage’s. I counted them as goners almost immediately- no earbuds I’ve ever owned would have survived a 10+ foot fall onto concrete, much less would the earbuds be in the case.Well. Almost a week later I can’t afford to replace them so I’m going without; when we decide why not. Let’s go look for them. And to our utter surprise we FOUND them, with the earbuds still in the case, and totally unharmed. all this to say I highly highly recommend these, especially if you intend on dropping them many feet onto concrete. Also the color is a huge plus, made them easy to find, and I love green :)","timestamp":"Reviewed in the United States August 26, 2024","profile_id":"AGBRZ4QQ6MEWRI5NFNJZB5EGLZOQ","is_verified":true,"product_attributes":"Color: Forrest Green"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:20","page":1,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=1","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=2","asin":"B0CTD6PRBY","page":2,"pages":615,"reviews":[{"id":"R248GHNYK8C2PS","title":"5.0 out of 5 stars These are a must have","author":"Tesla","rating":5,"content":"I have been wanting these for a long time but was torn about spending that much money on myself for a pair of earbuds being a single mom. I finally broke and got them. As of so far I do not regret. I got the purple one and they are beautiful in color. They have 6 different sizes in ear pieces in case you have small ears like me. They connected to my iPhone 15 pro max instantly and reconnect like a champ when using them. The sound is amazing. They have a wonder noise canceling effect and the sound is wonderful. I haven’t talked on the phone yet and today is day one of using. So I will update in about a week with battery info and more. But as of no GO GET YOURS!!!!","timestamp":"Reviewed in the United States September 5, 2024","profile_id":"AH54JS26JFJ4C6POKQM3UOEKC36Q","is_verified":true,"product_attributes":"Color: Plush Violet"},{"id":"R27TV504DW6UCH","title":"4.0 out of 5 stars Great Earbuds, With Some Slight Issues","author":"Ryan Baldwin","rating":4,"content":"Let me first say that these earbuds are comfortable and have great sound. The quality seems premium (despite being made of plastic) and I like the design mashup of gloss and matte surfaces. Still, I have a couple small gripes.For reference, I'm comparing these to a pair of Samsung Galaxy Buds that are a few years old. I think the sound and overall clarity on these may be better than the Samsungs, though it's also likely time to replace those. My main issue comes down to two things: The case and the touch controls.The case is a good size and weight and has good battery life. My issue is with the USB-C port placement: It's on the BOTTOM of the case. This means that it can't sit flat to open it and take out the earbuds. The Samsung Buds have the port on the back it sits flat facing you and you can easily open the top to remove or replace the earbuds. I feel like the port should've been relocated or the case redesigned on the Raycons.Second, the touch controls aren't great. Maybe I'm just too used to the Galaxy Buds and the companion app for use with my Samsung phone, but the Raycons seem slow to respond to single taps for volume, often causing me to either wait to see if the touch registered or tap multiple times not realizing that it did register earlier taps and I end up turning the volume up higher than I intended. On the Samsungs it's tap for play/pause, long tap/hold for volume increase/decrease, and double tap for skip forward. The small window they give you to double tap to play/pause on the Raycons is so small as to make the control pointless. 9 times out of 10 I just end up accidentally turning up the volume.That being said, I do think they're high quality earbuds, just with some questionable design choices. If I learn I'm using it wrong later I'll gladly update this review. For now I'm giving them 4 stars. Sound quality, isolation, and Awareness Mode are great. Could use some reworking when it comes to controls.","timestamp":"Reviewed in the United States June 17, 2024","profile_id":"AF7CQWTKJSA4FULYES5MYLNSU7VA","is_verified":true,"helpful_count":9,"product_attributes":"Color: Carbon Black"},{"id":"R2XUDVGDQKLJDU","title":"4.0 out of 5 stars My review","author":"Chris","rating":4,"content":"Raycon everyday earbudsPROS-they are the first earbuds that feel like they won’t fall outthey also have good battery life and seem to charge fastThe natural noise cancellation is very good, I’m on a little but under medium volume but I can’t hear anything even in a room with a lot of people(restaurants,family events etc)The awareness mode is also a very good feature, and works well, of course it won’t fully work if you are blasting your ears but from slightly above medium and lower it seems to be very good, just don’t rely on it to muchThe price was very good, I got these for 60 dollars while usually they are 80 I believe, discounts are easy to find and they do a first order discount which is 20%, for the price these are better then my AirPods and originally I was going to use these as a backup but I think I’ll be using my AirPods as a backup instead.Final pro would be it’s easy to change volume with these, easy to switch songs and etc, manual is very easy to follow aswell.Cons-my first con would have to be the charger, it charges very quickly stated earlier but it very small in length. So expect to buy a longer one aswellReally the only other con I can think of if you can even call it that is the 3 different sound modes, they all sound pretty similar and they’re isn’t a huge noticeable difference, so if your expecting this feature to be a good feature then you would be disappointed but I mean the sound in general is great soConclusion-these earbuds are one of the best I’ve worn and I would definitely recommend, I’ll be seeing and updating this review if anything changes but I doubt it, all in all solid earbuds for a price that’s significantly cheaper then other high quality earbuds(Apple, beats etc)UPDATE-So I bought these in February, they still are pretty good besides the volume somewhat going down in the left one but I mean it has noise cancellation and I can hear nothing at the gym with both in and music playing, another somewhat issue is the left falls out a lot, that may be my ears but it is what it is, overall my opinion hasn’t changed to much she’s were and still are amazing earbuds for how cheap they are.","timestamp":"Reviewed in the United States May 20, 2024","profile_id":"AE5AH4IPWHDU72VO55X4YCM3IOCQ","is_verified":true,"helpful_count":18,"product_attributes":""},{"id":"R3H2UZITYXRA2S","title":"4.0 out of 5 stars So far so good...","author":"B. Jones","rating":4,"content":"Update Edit 7-16-2024So far the default ear cups still fit well in my ears. Took a tumble down a few stairs, ear buds didn't come out. Granted it was the last thing I was thinking about, but once I figured out I was OK and picked up the stuff I was carrying, I noticed the podcast I was listening to was still playing.Tried the noise canceling feature, really can't comment on it, since I normally tune out junk noise after about 5 to 10 minutes naturally (TV, music playing, traffic, kids playing/screaming, pets making noise), trust me, if you can tune out 3 macaws acting out, you can tune out anything. 😴Did get a cheap silicone case for the storage/charger, mostly so I can find it in my backpack or in my room easily. Picking a bright color has saved me, the person that pretty much everything handheld or smaller that he owns, is either black or navy blue.I found the default sound settings were OK. But once manually set to my personal tastes, even better. And setting them was rather easy for this boomer.Old reviewI'll start off on the fit. Slipped into both ears with the base buds.Pairing with my phone and laptop was easy and fast. They came with a 90% charge.Basic settings out of the box, nice base and treble balance. Have not tested the other sound features yet, so will update in a week or two.The only thing I wish that it came with a case, to put the charge/storage case in.","timestamp":"Reviewed in the United States June 27, 2024","profile_id":"AHNRNKGUWLH2EOXPHD7FOB33UOAA","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R2DJ4R1BZV1OW2","title":"5.0 out of 5 stars Raycon Everyday Earbuds (2024 edition)","author":"Jolene","rating":5,"content":"These have been great. The battery lasts for a long time. I think I charge mine 1-2 times a week and I use them everyday at work.The only thing I found was they can be a little sore after using them for long periods. But I have quite small ears. I found it hard to get them in and comfortable. So definitely takes a bit of getting used to initially but once you’ve found the correct way to put them in they are very comfortable. They have a few sizes for yhe in ear foams so that helps with getting them to fit your ear correctly. The sounds quality is great and I love the different functions like awareness mode for when at work.Very happy with my purchase and would highly recommend.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AFGKV2R3QCGZHDMIJR37ZUTLHIJA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Plush Violet"},{"id":"RB5E4YX07IRUK","title":"4.0 out of 5 stars Great","author":"danielle leeper","rating":4,"content":"I lost my old pair and bought this new version. The sound quality and ease of use is all the same. But I personally hate the new charging case. It's airpods styled and it makes it just a little bit harder to get the buds in and out. I feel like when I take them out specifically I'm usually fumbling with them a bit. Otherwise these are still a great product.","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AFPQ4LJVJHOP7SAXFA6KSPCG3EQA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Carbon Black"},{"id":"R3Z3AUBIFBFC5","title":"5.0 out of 5 stars I love them","author":"iyen","rating":5,"content":"I love these Raycon.Orginally I brought one pair for my son birthday. Then I decided to get myself a pair because I was tired of spending money on apple airpods which don’t last long. They were easy to setup and the sound is great. The noise cancellation is also really good as well I just got them and the charge that they come with is great. Don’t plan on purchasing anymore apple airpods this was worth the money.","timestamp":"Reviewed in the United States September 2, 2024","profile_id":"AFOAGRJHHCY5T4342ANZ6ECGSMFA","is_verified":true,"product_attributes":"Color: Plush Violet"},{"id":"RMZKWM0KK824O","title":"5.0 out of 5 stars Have been really happy with them","author":"Amazon Customer","rating":5,"content":"They are made well. Pretty easy to use, but I never remember all the complex functions with clicks on the buttons. It would be nice to have a little laminated cheat card for them that came with them. They have good sound & mic quality, but every once in a while glitch & try to teather to something else Bluetooth which can be confusing. They are one of the best pairs you can buy right now & the auto on & off when you take them in and out of the recharging case is nice. Wish companies would stop skimping on the length of charging cords and provide wall plugs, not just usb. Some of us use these devices differently because we live rurally and don't work desk jobs. Like I am out gardening. I need to be able to set things up on a table with a longer cord. I also hace really tiny ears because I am a small person and these are built for guys so they are a little uncomfortable & sore if worn a long time, but my husband loves them.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGIRDENISFBEBVE3JSA6RMEULC3Q","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R1CCZKJJ59FCQE","title":"5.0 out of 5 stars My 14 year old loves them!","author":"Optionalsource","rating":5,"content":"I got these for our teenage son (14) and he LOVES them!! He had a pair of the latest Apple earbuds but lost one of the earbuds on a trip this past spring. Since then he’s been listening with just one earbud. The warranty had expired and no we didn’t buy him replacement. He did his research, and using his money he earned, these are what he wanted and they have been great! He said the noise canceling feature is just as good as his old Apple earbuds and the only missing feature is the tracking ability that comes with Apple products. Other than that, he doesn’t miss them anymore and is very satisfied with this new pair. The sound quality is fantastic. He said for the money, he doesn’t want another pair of Apple earbuds, just a new pair of these when they wear out. He’s past the ”look” that teenagers were all about.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AH4JKBNTFUS6TYZYUABZ7HDSLIIA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R1WAYF5GQXHUVB","title":"4.0 out of 5 stars Pretty good but…","author":"arachattack","rating":4,"content":"The sound is about 90% as good as my galaxy buds plus but the range in them is roughly 15-20 feet less and the right one randomly disconnects about once a day in the middle of a call. I’m using an iPhone 15 pro. Not sure if the issue is present on android.They fit well. I think they are super comfortable and feel like they are built well. But with range, disconnect, and a muffled sounding microphone I can’t really say they are an amazing deal. They are essentially have the price of Samsung and half as good.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AHHPKXCXH2ARAE7RNRORKEDTEN6Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Carbon Black"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:21","page":2,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=2","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=3","asin":"B0CTD6PRBY","page":3,"pages":615,"reviews":[{"id":"R3210UG49O46Y1","title":"4.0 out of 5 stars Great price and great quality","author":"Suzanne Metz","rating":4,"content":"I am very pleased with the quality of these earbuds, especially for the price! I had Samsung earbuds for years and when I needed a new pair, I did not want to pay a lot. I decided to give these a try and I am so glad I did. My only complaint is that you cannot tap to stop playing. Otherwise, they are very comfortable and the sound is great. Also great noise canceling.","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AFD5LYRFEPJ3V4ZHJQQJHMMP5PYQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Royal Blue"},{"id":"R164JKPQ2NW9DF","title":"4.0 out of 5 stars Stopped working after a few weeks","author":"suzy","rating":4,"content":"I owned a pair of these in the past and they worked great. The pair that I just bought aren’t as good. The product description said that the battery life is 32 hours. The current pair that I have has a battery life of approximately 12 hours. . I have to recharge them constantly Also, I bought these about a month ago, and the left ear bud has stopped working. The sound is good and they are comfortable, but I am just disappointed in the quality this time. I am going to exchange them for a new pair, and hopefully this solves the problem.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AECYGBOMGRT2YXFSM3L6NOM4MAJQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Plush Violet"},{"id":"R2ZANW94D39EN0","title":"5.0 out of 5 stars thank you Raycon","author":"Mavs Guns","rating":5,"content":"great design and really comfortable for my whole family and if you dont know your left and your right they still fit in the opposite ear with slight adjustments and if you want to jam out just put both in and feel like your in an ampitheater with no distractions whatsoever just make make sure you dont jump when someone touches your shoulder to get your attention","timestamp":"Reviewed in the United States August 28, 2024","profile_id":"AHAOBZNUC4UTIBYF7QT45IF5QXMA","is_verified":true,"product_attributes":""},{"id":"R2GM5IH9SNLX4D","title":"4.0 out of 5 stars Battery is not as good as 2023 model","author":"Kem","rating":4,"content":"Don't get me wrong, this is a very good earphones but I also have the 2023 model which has much better battery life that the 2024. But other than that, it is still a very good earphones","timestamp":"Reviewed in the United States August 26, 2024","profile_id":"AFS6VIY6UG5SM5LKBSJ7O6M5K7ZA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R30JKW39PGMJSV","title":"4.0 out of 5 stars Raycon everyday earbuds","author":"Great product!!","rating":4,"content":"I'm on my second pair of earbuds and the first set was awesome but the second set had a problem with the left earbud not changing but I contacted Amazon and they took care of the problem with no questions asked. I would highly recommend raycon earbuds!! I have the carbon black!!","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AEWSCHNGMM2NHEBUWXFPUDPRMZRA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"ROBBKM0MFQ0HT","title":"5.0 out of 5 stars Awesome product!!","author":"Cazie","rating":5,"content":"I read the reviews about these earbuds and decided to purchase them. THEY DID NOT DISAPPOINT!! These are amazing!!! The sound quality is top tier, clear and crisp; the noise canceling feature is really good. These things can cancel out all noise. I also like the fact that they have an option to still be aware of what is happening around you., and the do not fall out of your ears! These are a must buy!!! Don’t walk, run and purchase yours!! The price can’t be beat!","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AFALGBU5ZZGLZPHNHEA373MCAFPA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R3JRNZU88J2FH9","title":"4.0 out of 5 stars Good but...","author":"Gunner latimer","rating":4,"content":"These have been a lifesaver since my life revolves around music, but the right earbud has a really hard time charging even when I charge the case with it. Not worth 80 bucks but it's still pretty good.","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AFUDOZLGYONYBA7UD4HCWKQ67M5A","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R1AK54ZW5BN8IW","title":"5.0 out of 5 stars Worth the buy...","author":"Shawn","rating":5,"content":"Right bud Survived being dropped into an electric pallet jack, near ran over with only a couple small scuffs and still plays flawlessly, next the charge time is spot on,not just lasting near all shift...Best $80 well spent.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AFMWVPHHBWGIW7QDFFSQ5J3JKP2A","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R34EPLVP1IC19P","title":"3.0 out of 5 stars mixed feelings 3.5/5","author":"Corbin Saastamoinen","rating":3,"content":"I bought the 2023 edition last year and they are fantastic, apart from the fact I lost 1 earbud. I bought new ones earlier in July hoping that the 2024 edition would meet the same expectations. I am not satisfied.The case's design doesn't allow you to easily know how much battery is left in the case before it needs to be charged, the earbuds are all touch-sensitive which I find annoying. I prefer the 2023's use of the buttons so you don't accidentally change the volume for example.Sometimes (it's very rare) but in my experience at least 1 earbud just does not want to charge. It could be an issue with the case not easily telling you how much battery is left in it.Yes, I am aware that the light changes color when the earbuds are charging, but, again as I mentioned earlier, it does not tell you how much charge is left in the case.To summarize, this is a downgrade of the 2023 edition in my opinion. I'm not saying they are bad, no I do believe that for the most part, you are getting your money's worth out of them. I think the previous version was better. Overall, I rate the 2023 version 4/5, but the 2024 version is a 3.5/5.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AHRZMULFDFOUDULZ7WRL7ADVVQIA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Royal Blue"},{"id":"R8GZ511VVL7RK","title":"4.0 out of 5 stars Great! But...","author":"Gabrielle","rating":4,"content":"The raycons are great, although sometimes it'll connect to my phone when it's in it's case for some reason. The controls are easy to remember, and the sound quality is good. But not when it comes to video games. For some reason, the sound quality is bad while using some games (Example: Roblox).","timestamp":"Reviewed in the United States August 12, 2024","profile_id":"AH6MSVMV3V55VFUPOHPHLG7XWC7A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Plush Violet"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:22","page":3,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=3","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=4","asin":"B0CTD6PRBY","page":4,"pages":615,"reviews":[{"id":"R3VO5Y66333H5H","title":"5.0 out of 5 stars Better then AirPods!","author":"Heather Sarnocinski","rating":5,"content":"I just recently broke my AirPod Pro 2 headphones. I was looking for something better and hopefully less expensive than $180 for AirPods. Right when I put them in and played music I was shocked by how good it sounds. The bass is actually intense. It sounds great. Noise cancellation is excellent. The quality is better than Apple. Not only is this a fraction of the cost, but it’s better!","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AF7CUUDJ566TLBIJLRHQEBF4CXHQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Plush Violet"},{"id":"RW2QRCJUHR2Z3","title":"4.0 out of 5 stars Great sound, but the range could be better.","author":"David Bannister","rating":4,"content":"First of all, I love how the earbuds fit comfortably in my ears. I can have them in for hours and not feel any discomfort. The sound quality is pretty good. I used to have a pair of AirPods and the Raycon Everyday Earbuds are on par for the most part. Figuring out how to switch between modes can be a bit tricky because sometimes it will either change modes or raise/lower the volume depending on which one you touch. There was some stuttering when I connected it to my pc Bluetooth but it could also be an issue with my connector on the pc so I’ll have to test that out more. I did have the same issues with AirPods, though so take that with a grain of salt. I had them in when I worked out tonight and had no issues so overall I would say that these earbuds are pretty solid for the most part.","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AHGWLBN6262GHWMRYSJG7DY4WPZQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Royal Blue"},{"id":"RUAQCV4V3ENYY","title":"5.0 out of 5 stars Very Good Earbuds","author":"Benjamin Conley","rating":5,"content":"I was highly skeptical about these but managed to snag a pair while they were one sale. I've been burned by JBL's earbuds twice and didn't want to go through that all over again with Raycon, but so far I'm pretty happy.I'd say the sound quality and bass are comparable to JBL, and I like that the sound option can be changed by pressing the left earbud. That definitely helps when I'm listening to podcasts.I'll come back and update this after some time passes and see how I feel about them in the future.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AEQVU5X6L2HHZB3GCU6F7TLDPLYA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Carbon Black"},{"id":"R1R58NZ4U1AHCY","title":"5.0 out of 5 stars Great Ear Buds","author":"Dan Diener","rating":5,"content":"Love mine. Great sound. Great for listening to music or audio books while mowing my yard or doing other work around the house. Love how the ANC blocks out the mower.","timestamp":"Reviewed in the United States September 7, 2024","profile_id":"AFKA67TSNYO2DVZCDPKQXVMQWQGQ","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R3863SYB9P5LT3","title":"4.0 out of 5 stars Works great","author":"Emil R. Pantaleon","rating":4,"content":"They work perfectly fine. I think the instructions could have been a bit more specific on how to toggle the volume and the different modes it has to offer.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AEBTSECUK7ZEECNSRHQLMKO3E5VA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R1ARUNIBO33EQ8","title":"5.0 out of 5 stars Clear, loud and sweet!","author":"fred perry","rating":5,"content":"I just got mine in 2 days opened the tightly wrapped box and I plugged it in to charge for a few hours. I am BLOWN AWAY! Happy for now and my update my review in a few weeks. I think you should buy these ( i do have over 8 various brands of ear buds and the Raycons are on par with Galaxy pro buds, Beats, my Jlabs- these babys ROCK!","timestamp":"Reviewed in the United States August 17, 2024","profile_id":"AHIL3ZHENRZJ2OITZX5F5NVMPS7A","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R3QD778YPPCCF9","title":"5.0 out of 5 stars Love them","author":"Beans","rating":5,"content":"Work very well, I’ve been using them for a while since I got them and now I can definitely say that they are worth the price the sound is very good and they fit really well. It’s very easy to use the side buttons.","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AFLGYCHPKTGJNYJDDDL2UNF7TOCQ","is_verified":true,"product_attributes":""},{"id":"R1BUZY59D35LT6","title":"4.0 out of 5 stars Great 😃","author":"Erica Martin","rating":4,"content":"Great range. Great sound. Noise cancelling is awesome.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AGERHKGS5RKF2CMNFHEBIALCKGSA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"RHA2UQTJJ366","title":"4.0 out of 5 stars Nice Earbuds - Great sound!","author":"Marc","rating":4,"content":"Only reason not 5 stars is I'm having trouble with the left earpiece staying in my ear. They come with several different earpieces to get a correct fit so I probably just haven't found the right size for my left ear.","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AHW3UDBRDPFQFM3RZPH6DSGS2TWA","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"R1XG8LFBY77YY4","title":"4.0 out of 5 stars I’m impressed","author":"Anglzish","rating":4,"content":"After searching for a better earbud after using skull candy ones I bought last minute a few years ago, I decided to try these. I e heard good reviews about raycons, and decided to give them a try. I’m still learning to use the controls but it seems easy enough. The sound is clearer than skull candy and it impressed me enough to say I already like them. When I was using them on a phone call one person said I sounded a little muffled but it might have been the where I was using them. I will give an update after a few more days but I think at the price these are worth the money already. The case is wireless chargeable so that’s a plus and much smaller than the skullcandy ones I have. I am not sure of the charge just yet as I’ve only used these for 2 days. Oh and they actually came with a charge and it easily paired with my iPhone so no issues there.","timestamp":"Reviewed in the United States May 29, 2024","profile_id":"AEQQK5GCSJZZ3D2NQUG4NXF5J5XQ","is_verified":true,"product_attributes":"Color: Carbon Black"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:23","page":4,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=4","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=5","asin":"B0CTD6PRBY","page":5,"pages":615,"reviews":[{"id":"R1SUUC2HBFCPXY","title":"5.0 out of 5 stars Best Earbuds Ever","author":"Abigail F.","rating":5,"content":"So these are legit the best earbuds ever. I bought them in I think December. And today I accidentally put them in the washer AND dryer and both earbuds work and the case still works as well. 10/10 these are awesome earbuds","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AHVDJ74CML5FDGDTPTJNSHJJM4TA","is_verified":true,"product_attributes":""},{"id":"R1FWZDA7ZBFWIX","title":"4.0 out of 5 stars They're great","author":"SG","rating":4,"content":"Sounds great, volumes great, and it fits well. But I still think that if you don't want to spend that much money off brand ones are fine, for me the difference wasn't that significant as long as you find some decent off brands. It also comes with a manual on how all the functions/buttons work so that was helpful. Size is adjustable too.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AFAU6Z4H3ZY7CGG7UZJYPACP3MHQ","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R28BAU30VNTTLG","title":"5.0 out of 5 stars Best bang for your buck by far!!!","author":"Ryan Clayton","rating":5,"content":"These earbuds are fantastic. The sound quality is awesome! I lost them recently and bought a pair of beats to replace them that were more expensive, fortunately I found my Raycons because the sound quality and bass are night and day difference with the Raycons ahead by miles!! Don't hesitate to buy these.","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AGSEAAXLY5GWY2DUCHYR4LHN6HEQ","is_verified":true,"product_attributes":""},{"id":"R3FLFWRD8WIOAS","title":"4.0 out of 5 stars Seem pretty well made.","author":"MPK","rating":4,"content":"I would buy these again at 35% off as was the case on prime day.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AEXB6ZITBA44IBJAGTMIOOMW25BQ","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R37MS1VY24Y1IL","title":"4.0 out of 5 stars Music on a Motorcycle","author":"Nathan","rating":4,"content":"I was on the lookout for earbuds that work underneath my helmet and without one. I found many a product such as the JLab and Samsung wireless earbuds or the Shure and MEE wired earbuds. I choose these earbuds because it was on sale, and had a red color that matched my helmet. My main concern before it arrived was if it’ll fall out my helmet in it or when I take it off. I had previously had AirPod Pros, but they would fall out easily while driving my motorcycle, maybe because the cushions weren’t the right size. Either way, I really hoped these would just stay in place and not fall out when I removed my helmet.When these arrived, I was decently surprised to find that these actually sealed and worked in comparison to my AirPod Pros. I even did a huge shake test running and jumping, and they didn’t fall out. Now, it was time to put it to the test by trying to put a helmet on and off, and hope it stays inside my ear. With putting it on, it actually stayed in and work perfectly fine, but on removal? It fell out my ears. I tried to keep it and pry the edges away from my ears any way I could, but to no avail. But then I tried on of my old helmets that fit me with a looser fit, and they actually stayed in on removal. I learned my helmet currently is a bit tight and that any earbud with that helmet would probably have trouble not coming out due my ear being pried every single time.Otherwise, it was time for the ultimate test: using it without a helmet. I was afraid the weight of it might drag it out, but actually, driving with them on felt pretty stable and I could still hear through them. The sound coming out was great and I didn’t need to have the music blaring. I ran it at about 70-80mph, and it stayed in. Any higher than that, and I don’t know to be quite honest.The awareness mode being off blocked out all the wind noise and sounded decent for noise cancellation. Great wind noise reduction, but not as great as the Pros, but not too loud such as… I don’t know… not wearing any ear protection? Only problem is keeping the awareness mode on actually amplifies wind noise which is a blaring issue and causes excessive noise. It becomes unbearable when outside and is deafening, even just trying to talk to others.Overall, great earbuds for everyday use like it claims while also fitting in my helmet (except on removal) and without a helmet. Only con is awareness mode on isn’t great outside.","timestamp":"Reviewed in the United States October 14, 2023","profile_id":"AEW6SU5XVHBZ2GP45QLUJIQ6WE4A","is_verified":true,"helpful_count":30,"product_attributes":""},{"id":"RB5LD9MSWB6A1","title":"5.0 out of 5 stars These are some good earbuds. A little too good.","author":"Kez Flowers","rating":5,"content":"These headphones are dangerous and I'll tell you why. I was walking and this guy sped right past me in his truck and I didn't even hear him coming because these earbuds are just that good at isolating sound. I'm sitting right underneath a speaker at a bar and I can hardly hear the speakers. Purchase these at your own risk especially if you walk outside a lot.","timestamp":"Reviewed in the United States August 9, 2024","profile_id":"AGOWRQ4OFQM74ATFPDTWKFPXK7BA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R3UQC24HKTC470","title":"5.0 out of 5 stars battery life","author":"Alexius royster","rating":5,"content":"I love these. i was tired of my airpods steady dying or acting up so i tried raycons... The nose cancellation is plus. The battery life is amazing i had them for almost a month and havent had to charge them yet. does not hurt my ears and theybhave different size rubber piece for ear bud so u can custom to your size ear.","timestamp":"Reviewed in the United States August 13, 2024","profile_id":"AEJ7JAOPS3PZID3RRJAGQC7HEO3A","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"R2O0249KFYDFQD","title":"4.0 out of 5 stars Not fully charged","author":"Kim Williams","rating":4,"content":"We’re not fully charged when received and one bud failed after an hour. Took overnight charge to remedy.","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AEJR2I2D72XQMIPL4WURHZDT2PMA","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R39EMIWWM3T1HZ","title":"4.0 out of 5 stars Always buy Raycons","author":"C. L. Ward","rating":4,"content":"My daughter loves raycons. Hard to get in Australia so got these new style ones for her","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AE25VKUTI4WAQJX2FKWE7PQ4FY7A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Royal Blue"},{"id":"R3MHWGKBIS0SBK","title":"5.0 out of 5 stars Durable","author":"Ben Shrewsbury","rating":5,"content":"I don't leave reviews. But figured I should for this. My child has dropped them, put them in their mouth. And I also have washed and dryed them atleast 20 times and I have not had any issues. They may be small and get lost often or I forget I left them in my pants. But they have endured alot, so they are very durable. I also haven't had issues with connection. It keeps a charge super good too.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AGKH7DDFLLVXN7COBTZYT6VC743Q","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:24","page":5,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=5","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=6","asin":"B0CTD6PRBY","page":6,"pages":615,"reviews":[{"id":"RIYK72XDI5JFY","title":"4.0 out of 5 stars Great quality for the price!","author":"Morgan K.","rating":4,"content":"Raycon is usually my go to earbuds as no one can really compete with their price to performance. Easily syncs with my phone, long battery life, good sound quality, only minor complaint is the occasional random disconnect. Not super frequent but it does happen regularly, could just be an issue with crowded Bluetooth frequencies and not actually an issue with the earbuds","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AGFPSZOUXMDOVAQSDOKDOIQSNKYA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"RBE8BVDJVAXRF","title":"4.0 out of 5 stars Ok","author":"Melody","rating":4,"content":"The headphones are ok. Sound is good. The only thing they fall out of my ear often. Also I can’t answer calls with them.","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AGFJXV2RIF2PZLROP5TQYSVSKYMA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R1EDUIQQFQ65MJ","title":"5.0 out of 5 stars Great earbuds!!!","author":"Rembrandt","rating":5,"content":"Have had many brands over the years and wanted to try a true wireless set with ANC. Love my sons Apple pro set but was not gonna pay that kind of money knowing I may lose one or both. These kept popping up in ads and luckily my co worker bought a set so I tried them. Ordered a pair immediately. Luckily it was Prime Day so I saved some money. Absolutely best ear buds for the money and I feel as good as the Apple ones. Super comfortable and amazing sound with ANC and settings to enhance your type of music if needed, Will be buying another set.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AFESZ6T6736A7JTREGESICYWO2NA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Royal Blue"},{"id":"R1RGNUE67B969P","title":"4.0 out of 5 stars Not as good as the 2022 model.","author":"Gabe","rating":4,"content":"It's good, but it remains worse than the 2022 model. The signal does not reach as far, the charging case does not provide as much information as to its current charge and that of the individual earbuds, and the touch sensor used in place of a button is sensitive enough that almost anything will trigger a change in volume. It works fine, but it is a downgrade.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AE6ZZT5WQFBCK3Z4OPB3PQFFJ75Q","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R1WP0WDFD07MCD","title":"4.0 out of 5 stars 1st gen is better","author":"Kenneth","rating":4,"content":"Raycon are the best ear buds by far, but I prefer the first gen style better, the mode switching is better for ergonomics. ie the positive clicks as opposed to virtual button.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AGTGQIPKEWO3TYQ4SYNQVHDZOASA","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R27E17ZVOL89YR","title":"3.0 out of 5 stars Bang for the buck","author":"maitt123","rating":3,"content":"At the price point it’s at, these earbuds are pretty good quality and are extremely comfortable! I’ve had all the AirPods / Pro and Beats earbuds but these are by far, the most comfortable. Another feature I appreciate is that it connects with two devices, making it easy to jump from meetings on my laptop to answering a call on my cell. However, after a couple of uses the left earbud started to static, and when on cell, the earbuds disconnects and connects with a little voiceover. As you can imagine, having a call interrupted many times can be very frustrating. I contacted Raycon through Amazon to report the static and had them replaced- not sure if I should be concern that both packaging are very different, as pictured. Overall, customer service seems to be good, didn’t have high expectations due to the cost - but it exceeded my expectations on performance and the color is cute!","timestamp":"Reviewed in the United States September 7, 2024","profile_id":"AG4YYGMLFV4LHBZ56VIM4YK3JC2A","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"R22M9LUMGIBQ59","title":"4.0 out of 5 stars Good Sound","author":"Gary","rating":4,"content":"They sound really good but I'm having problems with the controls. The push button control is difficult but not impossible.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AFJQKUKOJFHSSLEXWD67T5DW377A","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R1735JMGJNYMZA","title":"4.0 out of 5 stars Good for the price.","author":"Michael J. Tonyan","rating":4,"content":"Got them on prime day. Little tingy but change them to bass mode and it takes most of that away. Don't buy for bass though definitely not the pair you need.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AFOJCZOPSKBIHT4MLHIS47LOLXUA","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"R2R6J21E6BQX46","title":"4.0 out of 5 stars Sound quality and battery life.","author":"Amazon Customer","rating":4,"content":"I like the size of these buds. Sound is fairly good but, was better on old style. Battery life is defined not 32 hours as advertised. Was better on old style.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AFNUA5GHRNGB6NLR5UUEURT25YWQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Royal Blue"},{"id":"R14F4T9VNME0WZ","title":"4.0 out of 5 stars Work ok. Light exercise only or they will fall out.","author":"chris denhart","rating":4,"content":"They work fine. Me personally, during a hard work out they will fall out on the floor. Sound is decent.","timestamp":"Reviewed in the United States August 11, 2024","profile_id":"AHDRPJGYF45FLVVHXHD53QITCAYA","is_verified":true,"product_attributes":"Color: Royal Blue"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:25","page":6,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=6","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=7","asin":"B0CTD6PRBY","page":7,"pages":615,"reviews":[{"id":"R15U68DHBQ3VFI","title":"5.0 out of 5 stars Decent battery life, decent call quality, decent sound","author":"Jelly","rating":5,"content":"I do love my music, but I'm not to the point of an audiophile (mostly 'cause that's expensive, yo). Best earbuds I've owned, but they're also the first earbuds I've owned that weren't bought for cheap (sub-$30) at Best Buy or Walgreens.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AE7A45COHIERODGV4W2ZVQGUVWYA","is_verified":true,"product_attributes":""},{"id":"R32AEWP8K9WNDH","title":"4.0 out of 5 stars Great earbuds for a good price","author":"Melissaperalta","rating":4,"content":"A lot of bluetooth earbuds are over $100 easy so these being around $60 but still great quality is a steal. The sound quality is a great and the noise cancelling is pretty good. All the controls work for the touch commands, which are also easy and not much of a pain. The only thing so far, and i saw another review about this, my earbuds were able to connect easily and ill be listening to music or whatever for 30 min then theyll just playing sound. They dont disconnect or pause the music just no sound. It is an easy fix, just turn off blutooth on the device and turn back on then it works fine the rest of the time. But that is inconvenient given the fact they should stay connected with no issue.","timestamp":"Reviewed in the United States May 28, 2024","profile_id":"AGKKNPHSFPBDOTW7U643BVKCOMBA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Carbon Black"},{"id":"RCFBAGZDB56JH","title":"4.0 out of 5 stars How to pair to other devices besides phone","author":"Amazon Customer","rating":4,"content":"I don't like that you can only pair with one device at a time and that it won't pair to my laptop. Good sound quality easy to use","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AFTFXAGSLAMDB6ZKTVJYL7AQOGFQ","is_verified":true,"product_attributes":"Color: Plush Violet"},{"id":"R2U2BJTUC61UTY","title":"4.0 out of 5 stars An upgrade for sure","author":"Alex S","rating":4,"content":"Bought these to replace the raycon fitness earbuds because they kept falling out. So far I have not had that issue with these new earbuds.Easy to pair with devices, as of right now the batter works as advertised (will update if anything changes), very sleek look","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AHBAMEGOQOS74CHBYPPP7IKENRRQ","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"RV91BNP4LJ5CC","title":"5.0 out of 5 stars Survived a trip through the washing machine","author":"Hannah","rating":5,"content":"Just as good as AirPods but for a fraction of the price. I hate the shape of most earbuds, but there are lots of options for the little rubber bits to get a decent fit.Also I accidentally left them in my jeans pocket and they went into the wash, and SURVIVED unscathed.Sturdy, quality sound, pretty, and overall gets the job done, but for a fraction of the price of the overhyped brands. 10/10Only downside - the controls by tapping either earbud are a little complicated and a little slow. Once you learn them they can be useful but I don’t find myself using them often.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AEI44QXAXDCRAFU2KHMRA2KPHJBA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Forrest Green"},{"id":"R1UMXTY9H7DNJS","title":"5.0 out of 5 stars Crystal Clear Sound - Head Boppin Fun","author":"Julianna Foote","rating":5,"content":"Raycons have always been a go-to for wireless, bluetooth ear buds. A must buy!","timestamp":"Reviewed in the United States September 4, 2024","profile_id":"AH7HWBR3W2BSXWOJMBI4Z27WPW7A","is_verified":true,"product_attributes":"Color: Plush Violet"},{"id":"RX1WUUI4XIPX3","title":"4.0 out of 5 stars Raymond everyday earbuds.","author":"larry jr","rating":4,"content":"Absolutely from unboxing a great item. And the price was a deal wait for prime day.","timestamp":"Reviewed in the United States August 12, 2024","profile_id":"AHMZEJTMSAEWH25QLYIH32LOFXPQ","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"R120P7F6W0F4J3","title":"5.0 out of 5 stars Great for activity","author":"Drew","rating":5,"content":"I stopped using my AirPods for these raycons. It’s way more comfortable with the interchangeable earpieces and not just hard plastic. The sound is great too, it changes depending on if you’re using one head phone or two. The charge last longer, the case is cooler looking and magnetic, I mean literally everything about it I like more. Easy set up was my favorite thing about it. It’s small enough it fits in my sling bag I take everywhere with me.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGMHRQ44PLNOMOUDMSQPRENQ4GXA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Carbon Black"},{"id":"R1HOQ5WE0DNYEY","title":"5.0 out of 5 stars So far so good","author":"Suman","rating":5,"content":"The most important thing about this device is on the other side they will here only you, not every single noise around you.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AHWTZXCJEQJIBFMDRTDB5PGFIOUA","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R3BXTO208TR2Y","title":"5.0 out of 5 stars Extremely comfortable","author":"Amazon Customer","rating":5,"content":"Been wanting to try these earbuds, I’ve had several apple AirPods and Samsung. Both of those were horribly uncomfortable. I’ve had the Raycons for a few weeks. They do not hurt my ears, and have a decent range on them. I highly recommend these.","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AHUPR5UNCII6PKBOFCLUVSFWHWYA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Carbon Black"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:26","page":7,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=7","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=8","asin":"B0CTD6PRBY","page":8,"pages":615,"reviews":[{"id":"RLGFP7IJSH7F8","title":"5.0 out of 5 stars Works amazing","author":"Kindle Customer","rating":5,"content":"Works incredible. the audio is suberb, and the battery life lasts forever. they charge lightning quick, and the awareness mode feature helps a ton while at work!","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AHZQMM344SGGYI6K4TOEIFGM2U4A","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"R24TCA4JFR55OL","title":"5.0 out of 5 stars Decent sound quality for the price","author":"ChristianRoney","rating":5,"content":"Fairly comfortable and small. Sound quality is good. Active noise canceling makes a difference but can still hear ambient noises in loud environments. Battery life is what is advertised. Good all around for the price.","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AEOBGUPDQVG7JNRYGPQWJGZXCRWA","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R2MFZS5ZD1NABQ","title":"5.0 out of 5 stars FANTASTIC","author":"Shiyeng Vang","rating":5,"content":"These work so well! Connects so easily! Forget buying expensive name brand buds! These work & are worth the money!","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AFS7RDCAXQ55BOUVIGWF3NBML7WA","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"R2QU4S32L4P1QT","title":"4.0 out of 5 stars Great First Earbuds","author":"Alfred Crixell Jr","rating":4,"content":"These are my first pair of earbuds so I don't have much to compare them to. That being said, I can tell you that they are excellent. I use them mostly for video calls, but their audio capabilities are nice. They have a crisp clear sound with some decent equalization options. The bass is good, too. They are great for the price and I'm happy to have them.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AFGEKOIUMD6RNAT24BWL36DP4N6A","is_verified":true,"product_attributes":""},{"id":"R3K5XK0Y4RG7I0","title":"3.0 out of 5 stars Their not bad","author":"Nick","rating":3,"content":"For the price, these are good headphones. Sound quality is good. But there are some quirks. Recently only one of them will actually connect to my phone when I take them out of the case, even though both are charged. Sometimes it's only the left one and other times it's the right one. There was also a period of time where even though the case was fully charged, when I would take them out. They would only have 10% battery left. Lastly, pretty much every time I put them back in the case. They stay connected to my phone. So I have to manually disconnect them. If you are using these on occasion just to workout or listen to music these are fine. But if your planning to use these like every day then I wouldn't recommend these.","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AG7VTNCWIYX7KBNM5JMABDPI6OIQ","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R27LPOZIZUVMSD","title":"3.0 out of 5 stars Nice Sound, Constantly Fall out and Way to Easy to Accidentally Change settings","author":"Cait","rating":3,"content":"These things have good sound. I also like the color, case and battery life.Here are the consCon One.Like many manufacturers, they lie about fitting any ear. To do that you need different shapes and different depths, as well as different sizes and likely little hooks. I have earplugs that manage it and somehow basic earbuds can succeed, probably because they're light weight. A tapered oval shape works well.My ear canal is very small and I don't have a big enough space for the earbuds to actually rest within my outer ear. The only thing keeping them in is the silicon ear pieces, and they barely manage that. I can feel the working their way out and have to catch them, bringing me to my next con.Con 2. If your ear buds are constantly falling out, you're gonna touch them, and, if you do, you'll change the settings, the volume, etc, way too easily. One of mine fell in my bra and apparently skin contact was enough to have them cycle through settings as I frantically tried to fish them out. I don't like the volume going to max in my other earbud that I've managed to keep in.They have good sound but for me they're only usable at home, without me moving at all. The claim they fit any ear size is so false and pretty much any manufacturer has multiple ear piece sizes, so they really haven't even tried to match that claim.","timestamp":"Reviewed in the United States June 18, 2024","profile_id":"AFTCEQST6F6TJ5S4WJXL56UZ4GFA","is_verified":true,"product_attributes":"Color: Forrest Green"},{"id":"RA56J5XVZRA48","title":"3.0 out of 5 stars Somehow sound worse than the 2023 edition. Awful connectivity issues","author":"Dusty4341","rating":3,"content":"*This review is for the 2024 version of Raycon Everyday Earbuds. I find it annoying that the reviews for the 2023 version are included here. Most people in their reviews do not differentiate between which set they own, which makes it frustrating to find reviews for the 2024 version. I find this somewhat deceptive on Raycon's part, as it obviously impacts the overall rating. Having said all that:POSITIVES- Earbuds remain firmly in place while sitting- Solid battery life. Really only needed to charge them every two days- Good sound quality for the priceNEGATIVES- An annoying amount of connectivity issues. Earbuds would regularly cut out both during calls and listening to music. In addition, despite my iPhone knowing I own them, oftentimes when taking them out of the case I'll hearing \"pairing mode.\" Almost every time this happens, my iPhone does not recognize them, so I have to repeatedly put them back in the case until my phone recognizes the earbuds- Earbuds come with three different sound settings. However, the difference between them is negligible- More often than not, even when I'd put the earbuds back in their case they would still be paired to my iPhone. So, I'd have to go under Bluetooth settings and manually disconnect them- The bass sounds artificial (not true bass), slightly muddy. Personally, I feel the overall sound quality of these is slightly worse than the 2023 version- Regardless of which size earbud tips used, it's like these things are on a personal mission to fall out of my ears. If I go jogging, I'm constantly having to readjust them so they don't fall out. And if I'm doing some light chores around the house, it's the same. While washing some dishes, the left earbud fell out and nearly landed in a bowl of water. Fortunately, I was able to lightly swat it onto the counterAdmittedly, I have high standards when it comes to earbuds due to how often I use them, as well as being a self-professed audiophile. Decided to try these out since my 2023 earbuds are getting older, and quickly realized the 'upgrade' wasn't worth it and will be returning them. To be clear, I've owned WAYY worse earbuds before, and if you can grab these while on sale I wouldn't fault you for it. However, when factoring in all the aforementioned issues, which far outweigh the positives, they simply are not a good option (for me; your results may vary).A week after purchasing these, I decided to splurge on a $180 pair of earbuds from a highly reputable company. I can honestly say I was floored by how much better the sound was; incredible bass that doesn't drown the singing out, excellent treble, and some of the crispest sound I've ever heard.Again, if you're looking for a cheaper option, even with their flaws these aren't terrible earbuds. But for athletic types like me, you can do way better. 3/5, but closer to a 2.5.","timestamp":"Reviewed in the United States February 1, 2024","profile_id":"AGX2MHQWCCATODOEH4DTJ5VPNGUQ","is_verified":true,"helpful_count":12,"product_attributes":""},{"id":"RBPUDS90GKWOW","title":"4.0 out of 5 stars Solid","author":"Chuck Rohleder","rating":4,"content":"They are not perfect, but I kinda feel the connection issues may just be inherent to Bluetooth. When this happens I switch over to my other pair for a bit and come back and they work fine. Other than that, I don't really have to many complaints. I do have one minor issue though, it's probably more of a me thing though. When trying to hit two presses to pause or play, it is sometimes (if you hesitate at all on second press) interpreted as 3 presses. When listening to a podcast on YouTube this can be very annoying as it sometimes won't save where you were.","timestamp":"Reviewed in the United States May 2, 2024","profile_id":"AETSOMTGPOXMXXEGJABAUQJYF2FA","is_verified":true,"product_attributes":""},{"id":"R22WCO6HQ7VYVU","title":"5.0 out of 5 stars Great sound","author":"Amazon Customer","rating":5,"content":"Stays in ear. Charge Last long, great sound.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AHTLL7SJW6JLGV2U7BN7O3JGMGFQ","is_verified":true,"product_attributes":""},{"id":"R3DFOBLPAC37DH","title":"5.0 out of 5 stars Great sound","author":"Crystal","rating":5,"content":"My daughter uses daily and they work great.","timestamp":"Reviewed in the United States September 7, 2024","profile_id":"AEBE6F6FO3KYVEY4N726EBHAOPLQ","is_verified":true,"product_attributes":"Color: Carbon Black"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:27","page":8,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=8","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=9","asin":"B0CTD6PRBY","page":9,"pages":615,"reviews":[{"id":"R3Y5ZQAMYHVA8","title":"4.0 out of 5 stars Raycon Everyday Earbuds","author":"PR Guy","rating":4,"content":"Compared to others around the same or higher price point, these are a great value with excellent sound. The bass is punchy, and high frequency tones are separated from the rest of the sound spectrum.","timestamp":"Reviewed in the United States July 3, 2024","profile_id":"AFXKQYUNMJC44D2EGHUFOJKTA22Q","is_verified":true,"product_attributes":""},{"id":"R17C453MLGX1AO","title":"5.0 out of 5 stars Good sound quality","author":"Pete Doyle","rating":5,"content":"These work well, so far. Good quality sound. The touch controls are a little buggy. But overall they work well for what I use them for.","timestamp":"Reviewed in the United States August 12, 2024","profile_id":"AF3ZVCAJFYYPY4QDLHOCVJXBLS7A","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R3DQZMUKIK1GE8","title":"5.0 out of 5 stars i like them","author":"Teresa Green","rating":5,"content":"Easy to connect, just like the picture.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AG2F5WIQXGPQHVPYN4VNMQCUB76Q","is_verified":true,"product_attributes":""},{"id":"RCMLX0F05EJYN","title":"5.0 out of 5 stars Great quality.","author":"LOS.","rating":5,"content":"For the price you get great quality.","timestamp":"Reviewed in the United States September 8, 2024","profile_id":"AFIAP7K7DJNXCTL57YQF64F3GU3Q","is_verified":true,"product_attributes":""},{"id":"RQSTJ5ZXLNF0C","title":"4.0 out of 5 stars Great deal.","author":"David Gregory","rating":4,"content":"Updating my last review.My previous pair finally blew out which isn’t necessarily the products fault. Daily use at work in a loud environment and I’m a dingus who listens to music too loud.After killing my last pair, I decided to get another set because I did enjoy them, but it appears that Raycon has released a new version of these headphones that have a few things different.All in all they are still great budget headphones which sound good enough, but I think the awareness mode on the new model is worse than the previous, and the biggest issue Ive had with the new ones is the touch to interact. I much preferred the physical button to click in because I keep accidentally activating the controls on the sensitive touch receiver.The last thing they changed which is silly to complain about is that they removed the loop for something to attach to the case like the provided rope keychain. I really enjoyed clipping it into the small clasps in bags so you always know exactly where the case was in your bag when traveling. Not a big deal but I miss it.I am a machinist who is pretty isolated squaring up metal blocks all day. I had some old blu tooth ear buds that were fine but started to lose their charge after years of abuse. I am an Avid music lover, I host a podcast and listen to tons of other podcast and audiobooks, and have a degree in Broadcasting Media. I am constantly listening to things so I have an embarrassing collection of headphones that drives my wife insane. I try to use a cheaper pair of headphones working because I typically have metal chips flying everywhere and the small ear bud headphones always use magnets for keeping the case close and holding it close to the charger. It’s incredible how easily the razor sharp chips can find their way into a charging case.If I were to compare these raycons to the latest Airpod Pro 2, obviously the AirPods have a higher quality of sound, the transparency mode is significantly better, and there is the “find my” AirPods app that beeps at you in case you lose your AirPods. But this is comparing a $250 product to a $70 product. I think for the price, quality of sound and features, these headphones are pretty dang hard to beat. And if I’m completely honest, I think the raycons are more comfortable to me than the airpod pro 2s. The only real complaint I could come up with is stupid, but man the charging case is so small. I know I’m going to lose these eventually because it’s so small. But that’s user error.","timestamp":"Reviewed in the United States March 3, 2023","profile_id":"AE5IUGCPDQOBWMSOGQ5AI5S54JMQ","is_verified":true,"helpful_count":13,"product_attributes":""},{"id":"RULP054O6HKNG","title":"5.0 out of 5 stars Raycon","author":"yolanda petty","rating":5,"content":"Nice ear buds will purchase again.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AGKONIU23QE77PYIG5HQEBCU7NXA","is_verified":true,"product_attributes":"Color: Plush Violet"},{"id":"R1KEFKU2066AWQ","title":"5.0 out of 5 stars Sound quality better than expected!","author":"Kat","rating":5,"content":"I had a pair of the original raycons awhile back and they were great, but I used them till they died pretty much! I decided to get the everyday earbuds because i like raycon and I missed having earbuds! The sound quality impressed me because even compared to my old ones (also raycons) which sounded really good already, these were somehow clearer and better?? I also like the fact I can change the settings to either cancel out noises, or to make it so I can sort of hear my surroundings! If you’re looking for earbuds, these are the ones!","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFRCQLNNHKMWM2FXOADE7CVNGXVA","is_verified":true,"product_attributes":"Color: Plush Violet"},{"id":"RY3Y88RP6DOL6","title":"5.0 out of 5 stars Ray on ear buds","author":"Airgun Junky","rating":5,"content":"My wife likes them she uses earbuds alot so I stopped buying the cheaper brands they are okay for me occasional listener. She uses hers daily. Needed more than one pair.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AHDKKECD3LDH5YD5QE2EBEQEB7XQ","is_verified":true,"product_attributes":""},{"id":"R1BFPVM76RX4YI","title":"5.0 out of 5 stars Not sure but……","author":"Grego","rating":5,"content":"Bought these bad boys in may of 2023. This review day is July 16, 2024. They quit charging. Tried multiple ways to charge but no luck. Sound was great and they worked as advertised. Definitely thinking about getting another pair.Update on this review, 22 July 2024. Charging problem was a bad usb-c cord. Charging capsule is working just fine. I did buy a new pair of Raycons on Amazon deal days, they are badass! Sound quality is amazing and compared to the giants of the industry, worth the money. Solid purchase.","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFRXWAH35O62PGXO5LK4YRHFAW3Q","is_verified":true,"product_attributes":""},{"id":"RDSD0V60GP4MP","title":"5.0 out of 5 stars Great gift","author":"Krystaleena","rating":5,"content":"I got these for my daughter. She loves them. She likes how they feel in her ear. They last a long time and charge quickly. The sound quality is great and tge noise cancelation function works really well.","timestamp":"Reviewed in the United States August 11, 2024","profile_id":"AHIRGEVXXDXDPKZ43MO3IEG53OCQ","is_verified":true,"product_attributes":"Color: Forrest Green"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:28","page":9,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=9","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=10","asin":"B0CTD6PRBY","page":10,"pages":1,"reviews":[{"id":"R1Y3JNX3BK1S6W","title":"4.0 out of 5 stars I really wanted to like these Raycon headphones....","author":"John Bartley","rating":4,"content":"When it comes to convenience, the small size of the Raycon headphones is a definite plus – they fit into any pocket without a hitch. Unfortunately, that's where the positivity ends.The sound quality, to put it mildly, is a letdown. It's a bizarre mix of tinny and muddy, as if the headphones are desperately trying to cover all bases and failing miserably. As an artist with a broad taste in music, these headphones didn't just fall short; they faceplanted.Whether I was diving into the intricate melodies of classical compositions or getting lost in the soulful beats of jazz, the Raycon headphones managed to make each genre sound equally subpar. It's like they have a vendetta against good sound.Now, if your playlist consists solely of top 40 hits and rap music, you might escape the full brunt of the disappointment. However, for anyone who appreciates the nuances of various genres, these headphones are akin to putting a masterpiece through a blender.In conclusion, while the pocket-sized design is nifty, the Raycon headphones are a sonic letdown. They seem tailor-made for the top 40 enthusiasts, but for those seeking a more refined auditory experience across different music genres, the search for the perfect pocket-friendly headphones continues.","timestamp":"Reviewed in the United States February 6, 2024","profile_id":"AHJLJE5P4M56RP2MRHJIT6QD4G7Q","is_verified":true,"helpful_count":7,"product_attributes":""},{"id":"RUK1O1KQRBAJE","title":"3.0 out of 5 stars Awkward and Uncomfortable","author":"RDomine","rating":3,"content":"I guess I'm going to be in the minority on this one, but I received my earbuds today and two hours later I found myself returning them. I wanted to like them, I really did, but I found a couple of issues that for me were deal-breakers.I'll grant that the sound quality on these buds was pretty darn good. Much better than my previous earbuds. They gave a really nice ability to really hear the separate instruments or vocals in several of the songs I tried them out with. But, honestly, that's about the only thing I found impressive about them.The way these buds are designed to be worn was something I didn't like at all. When stuck into your ears, the bulk of the earbud sits upwards from your ear canal. What it felt like and looked like to me was that I was wearing two blue Miracle Ear hearing aids. They pretty much filled the entire indented area of my ear just like a hearing aid. God knows I don't need something to make me look like I'm a old man, and that fact they were also a nice looking, vivid blue meant I was wearing hearing aids that were shouting down the street \"Hey, look at my blue hearing aids\". Not a look I'm ready to be sporting 'round the hood. It's this same design that brought me to the remaining issues. With the way they're designed to be worn, no matter what silicone piece I tried using to insert them in my ears, it felt as if at any moment they were about to fall out. I'm sure if they would have or not but the feeling that they were right on the precipice was unsettling and distracting. Also, with my previous Apple earbuds, the controls were relatively simple and the buds responded to a simple light tap for various commands. In the case of these buds, they required more than a tap. The center of each earbud isn't so much a touch sensitive item as it's a physical button that has to be pressed in, or held, or pressed multiple times. I found that VERY clunky since it required me pressing it more or less precisely dead center, and the fact the button had to be physically depressed, it meant, for me anyhow, that it would push the earbud out of position a lot of the time and frankly, the list of controls in the manual seemed like learning a naval flag communication language. I would have gotten the hang of it sure, but when commands require three presses of the right ear then hopping on one foot at shouting \"Hit me\" (I'm kidding on that, of course) it just seemed like more hassle than convenience. Lastly, they may look like hearing aids but you'll never go deaf using these. The highest setting for the volume on these seemed disappointingly low to me. I like my music loud I admit, but the max volume I could get out of these left me still able to hear my TV, or a roommate talking. If these things aren't going to let me rock out like I enjoy then that's a deal-breaker right there.So, music quality good, but for me, everything else felt clunky, awkward and uncomfortable, and seriously, who wants to sport sexy electric blue hearing aids all day either? I need something with better comfort, and that I won't need the actual Rosetta Stone to remember the plethora of commands / gestures / modern interpretive dance required to change the volume. Disappointing.","timestamp":"Reviewed in the United States February 16, 2023","profile_id":"AFJLH44GZF6HZS5UKX7H26FOMH6Q","is_verified":true,"helpful_count":46,"product_attributes":""},{"id":"R21ZWZW1NACYO2","title":"4.0 out of 5 stars Decent","author":"Alan","rating":4,"content":"I don’t have much ear bud experience. I’ve never spent over 100 bucks on any headphones or earbuds. I’ve certainly heard better music quality than these. I’d say the quality feel of them and the decent sound quality make them on par with value. It’s mostly lacking in bass from what I can tell but like I said, I don’t have much experience to tell if they’re comparable to average. I’ll gladly hold onto them a use them until I lose them but I’ll probably experiment with a different brand after that. So if you’re looking for something functional, connects fast, has decent range, decent sound quality (great for voice), and feels like it’s quality then these are worth it. If you’re a bass obsessed EDM listening person, maybe spend more money. Overall I’m glad I got them, they’re an improvement over what I had.EDIT: noise canceling and sound quality is better with the correct size little rubber piece.","timestamp":"Reviewed in the United States April 20, 2024","profile_id":"AGXQZMX4JGXTNJ3Q3CGG5FTJJ5EA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RC0YLKVT58V3B","title":"4.0 out of 5 stars Very durable, sound is great.","author":"Janice","rating":4,"content":"They work great as soon as charged and fit well. Sound is good.The only thing I’m having trouble with is that if one of the earbuds is left out of the case anywhere near your phone, it wants to connect When your phone rings, so you can’t hear your color until you find that earbud or turn the Bluetooth off. Probably just something I need to Adjust to.","timestamp":"Reviewed in the United States July 3, 2024","profile_id":"AEUAVG4PCTLFX6KQHFCSA5BG6ZSQ","is_verified":true,"product_attributes":"Color: Royal Blue"},{"id":"R69FQSBDI5A17","title":"5.0 out of 5 stars Great sound, easy to use","author":"Colin Kraft","rating":5,"content":"Great sound, easy to use, long lasting charge. Best headphones I've ever bought","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AFLODVQKCNP74DE4ESM7A7K5BRGA","is_verified":true,"product_attributes":"Color: Carbon Black"},{"id":"R2BPQ8QO7MCXFD","title":"5.0 out of 5 stars Perfect Everyday Carry","author":"Ian","rating":5,"content":"The case is small, and has wireless charging. So I just carry it in my pocket, and toss it on to charge every couple days or so. The battery seemingly lasts forever, and I've only had it die once after forgetting to charge it for about a month or so with semi-regular use. The audio quality is also phenomenal for how compact everything is, and pass-through mode is awesome for multitasking. I've already recommended them to several friends and coworkers who have also grown to love them.","timestamp":"Reviewed in the United States July 6, 2024","profile_id":"AH7QIESW6T7YMQLVQZFBPM56W6BA","is_verified":true,"product_attributes":""},{"id":"R3QZGG6A2G4DQL","title":"5.0 out of 5 stars Great Sound!!","author":"Mike TeeVee","rating":5,"content":"Going through a ton of different pairs of in ear air buds, I finally found the perfect ones! So I have always had trouble finding a pair that doesn't fall out of my ears, of has great sound quality, and if they do stay in, I can never get the volume I like out of them. These immediately, right out of the box, crushed all 3 off my requirements!! They're plenty loud, great quality, and no matter what I do, they stay in my ears!!Price point is more than affordable for what you get!! These are hands down, the best in-ear headphones I've ever used!!","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AHFY7XEIOV22BV3ODQO6PZ7NBTHA","is_verified":true,"product_attributes":""},{"id":"R1U1RUEM3FIKVP","title":"4.0 out of 5 stars Pretty good for the price","author":"Forrest","rating":4,"content":"Got the 2023 model at 50% off. Work well for outside activities wearing ear muffs.","timestamp":"Reviewed in the United States July 7, 2024","profile_id":"AHUBFFNQBWFJYAS4H4MLMGVWVB7Q","is_verified":true,"product_attributes":""},{"id":"R1AXV1AUOALVLQ","title":"3.0 out of 5 stars New revision not an improvement.","author":"Laurance Bennett","rating":3,"content":"I recently purchased the new revision of the everyday earbuds and I have some notes. The pleasant bonk sound when tapping to advance tracks has been replaced with obnoxious high pitched dink sound. Touch controls are barely responsive. Trying to triple tap to move to the next track more often than not results in aforementioned obnoxious sound and pausing, often accompanied with them getting louder. The older style had a actual real button that presses, which doesn't care if you're wearing a glove or have flour on your hands or they're wet, or anything really. These new ones just don't work as well unless your hands are bare and dry but not too dry. The old case had four dots on the front that acted as a battery indicator. New one lacks any obvious indicator. Old case had a lanyard ring built in, new one needs a silicone case for the same function. Overall, the old ones felt like great value for the money, the new ones seem too expensive for what you're getting.","timestamp":"Reviewed in the United States July 15, 2024","profile_id":"AFYW5WZKR6WVBH52EZKO6Z7YEKMA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R2VFCL749YR1V0","title":"3.0 out of 5 stars Decent but not good enough.","author":"Morbidelf","rating":3,"content":"Bluetooth connection was OK, kinda a bit of a walk through. Not having wireless charge is kinda lame but not a deal breaker. Sound was decent but not as good as my Galaxy Pro2 pods. I mainly got for the noise cancelation and transparency mode. It works well but there is definitely more functionality with the Galaxy Pro2 pods. Volume control is decent and they are cute. The size is convenient. The buds are a little awkward for smaller ears but doable. They are uncomfortable to lay on imo, which is a deal breaker for me. The magnetics in the case and buds are good also. They are over all good for value but I needed something with better noise canceling and sound quality.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AFGNVWUZJ7GSAQ4RVB54KM6NGYVA","is_verified":true,"product_attributes":"Color: Forrest Green"}],"page_type":"Question","asin_in_url":"B0CTD6PRBY","product_name":"Raycon Everyday Earbuds (2024 Edition) - Bluetooth True Wireless in-Ear Buds with 32 Hours Playtime, Multpoint Technology, Extreme Comfort, and Active Noise Cancellation (Forrest Green)","parse_status_code":12000},"created_at":"2024-09-11 15:01:17","updated_at":"2024-09-11 15:01:29","page":10,"url":"https://www.amazon.com/product-reviews/B0CTD6PRBY?reviewerType=all_reviews&pageNumber=10","job_id":"7239649210109293569","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-11 15:01:17","domain":"com","geo_location":null,"id":"7239649210109293569","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B0CTD6PRBY","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-11 15:01:29","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7239649210109293569","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7239649210109293569/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7239649210109293569/results/1/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/2/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/3/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/4/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/5/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/6/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/7/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/8/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/9/content","http://data.oxylabs.io/v1/queries/7239649210109293569/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7239649210109293569/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7239649210109293569/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7239649210109293569/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7239649210109293569/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7239649210109293569/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7239649210109293569/results/10/content?type=parsed"],"method":"GET"}]}}