{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=1","asin":"B0CF7GYNW2","page":1,"pages":72,"reviews":[{"id":"R3BYU7QHH1H1HW","title":"5.0 out of 5 stars 9.5/10","author":"Dylan","rating":5,"content":"Very satisfied with the quality of these earbuds. The sound is fantastic, dynamic sound with satisfying bass. The active noise canceling works surprisingly well for in ear buds. Just the ANC alone with no audio will significantly reduce background noise. There is also an option for ambient noise to be played which i like to use when reading or sleeping.If you have the ANC on & are playing music you will not hear any background noise short of a jackhammer next to your ears.As to be expected from in ear buds, but still worth mentioning, there is virtually zero noise leak from these. People around you will not be able to hear what you're playing even if it's loud.I bought these mainly to use at the gym. One of my main concerns was that these would fall out easily while I'm workout out or running, as I've had that issue with other ear buds. I have not had that issue at all, these fit very securely in the ear and do not fall out easily at all, while still being very comfortable. There is a little ridge that will slide into the groove above your ear canal that makes them very secure.Battery life is great and they charge quickly. They come with a C-to-C charging cord that will charge the case very rapidly.My only minor complaint is that they don't go quite as loud as I would like them to, but I'm someone who always listens to my music very loudly. They are by no means quiet earbuds and this should only dissuade you if you're someone looking for earbuds capable of going extremely loud.Really for this price they are fantastic. Nothing I've purchased in this price range previously comes close.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AGOPQUSVPRVM3OQEBW4HNVDPHX2A","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R15S59MZAOQ0K7","title":"5.0 out of 5 stars No Way","author":"Dillon","rating":5,"content":"Mother of GOD these are good.1) Super comfortable and secure. I can't even get them to fall out with the most ridiculous of abrupt head movements.2) Easy as hell to set up with my Samsung Galaxy phone. As soon as I opened the case, my phone woke up and was like, \"Eeeey, these yours?\" And I was off to the races.3) Feature rich as all getout. Disclaimer. I am not somebody that likes very feature rich things. I like my audio devices to play audio. Nothing more. These changed my mind completely. It works so seamlessly with the phone it feels like an expansion pack or something. Answering calls is easy and has incredible mic quality. Not sure how. Playing, pausing, and playing next and previous songs all uses one touch surface and it's way easier than expected.4) My absolute favorite thing about these. Audio quality. I'm absolutely blown away by how good these sound. I didn't think it was possible to get such huge sound out of earbuds. These lil things are the size of a roided out bean and they absolutely dominate my entire skull. Most people are going to be like \"Yo the bass is fire. Riz and bruh and other sounds,\" but it's so much more than that. They deliver rich and clean audio across all frequencies. Yes, bass included. Very very f****** included. I listen to a lot of metal, which can be really demanding of speakers. The genre often includes a wide range of audio input simultaneously. These handle anything you throw at them no problem.In short, buy these. Go. Do it. Begone.","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AF3DX47GLHNT2GOPUZPJDAYFAMEQ","is_verified":true,"helpful_count":53,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R359HBPMZA7I4O","title":"5.0 out of 5 stars Absolutely Awesome","author":"Tyrone Johnson","rating":5,"content":"After only using over the ear headphones for years, I thought about it and thought about it because of concerns about sound quality and fit. After reading the reviews of these buds and more thought, I went ahead and order these. Received them a couple days ago and I'm blown away. Not only do they fit in my ears like a glove, but the sound quality is superb. Pairing them with my Samsung Ultra was quick, smooth and effortless. Rich sound with highs and lows that stand out. Very decent bass. Cannot hear anything going on around me. I had to mow my grass after I got them so I decided to use them to listen to music while mowing. I could not even hear the mower and had to take them out once or twice to make sure that the mower was running. The reasonable cost for such a great quality pair of ear buds (Samsung) at that is mind blowing. My wife tried them out and now she wants a pair for herself! Thank you Amazon, thank you Samsung!","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AHFFXXTHE63FPRAUC66M5SO55WWA","is_verified":true,"helpful_count":14,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2NGKUBNRM0FD6","title":"4.0 out of 5 stars Good buds!","author":"David D","rating":4,"content":"I recently purchased the SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds in the Graphite color and I have been extremely impressed with their performance. As someone who is always on the go and constantly listening to music or podcasts, having a reliable and comfortable pair of earbuds is essential for me. The Galaxy Buds FE have exceeded my expectations in both of these areas.First and foremost, the comfort and secure fit of these earbuds is top-notch. The wing-tip design ensures that they stay in place even during intense workouts or when I'm running errands. I have tried many other wireless earbuds in the past and have always struggled with finding a pair that stays in my ears comfortably. The Galaxy Buds FE have solved this problem for me and I can wear them for hours without any discomfort.The sound quality of these earbuds is also impressive. The audio is clear and crisp, with a good balance of bass and treble. I have used them for both music and phone calls and have been pleased with the sound in both scenarios. The touch controls on the earbuds are also very convenient and easy to use. I can easily pause or skip a song without having to take out my phone.One of the standout features of these earbuds is the auto switch audio. This allows me to seamlessly switch between my phone and laptop when I receive a call or want to listen to something on my computer. It's a small feature, but it has made a big difference in my daily routine.I also appreciate the built-in voice assistant feature. I can easily access my virtual assistant with just a touch of the earbud, making it convenient to make calls, send texts, or get directions without having to take out my phone.The battery life on these earbuds is also impressive. I can use them for several hours without needing to recharge, and the charging case provides additional battery life when I'm on the go. The case is also compact and easy to carry around.Overall, I highly recommend the SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds. They offer a comfortable and secure fit, great sound quality, and convenient features that make them a must-have for anyone looking for a reliable pair of wireless earbuds. Whether you're a music lover, fitness enthusiast, or just someone who wants a hassle-free listening experience, these earbuds are definitely worth considering.The only drawback is that the case is not wireless charging. Losing the one star.","timestamp":"Reviewed in the United States April 11, 2024","profile_id":"AFHMPI3AB3UNQPMTYIHKCD4WS5TQ","is_verified":true,"helpful_count":29,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3FSH2ISQZ07D8","title":"5.0 out of 5 stars The Perfect Storm!!! Flawless execution of what SHOULD BE","author":"TheChrisSimon","rating":5,"content":"2 years ago I was I acquired a pair of the Galaxy Buds+. I would have never I have purchased them myself, as spending top dollar for a pair of earbuds or headphones to me was not something that I would have spit my money on. I had no instructions, just a little black case in the bottom of a drawer, that someone had left behind. What I discovered, was a piece of technology, that made my life better, and it's quality, simplicity, and joy that it bestowed upon my soul.I only had that unit for a period of maybe 2 months. During that time I use them to live. The full sound l, flawless amplification of surrounding noises, everything about these was amazing. The fit in my ear, the simplicity of touch controls, everything made them something I didn't know that I couldn't live without. Through sheer negligence, I I dropped the right bud into a toilet, and flust it before I realized what had happened. There was a period of grief. And that left bud sat in its case and a drawer for 4 months, as I did not have the disposable funds to go buy a new pair, until it occurred to me to just buy a replacement for the lost bud. Purchase of the second hand market I could never get it to pair and it just sent me further into sadness.Set that time I have made an emission, define a worthy replacement. I have spent conservatively $1,800 and tried every brand from generic to Apple to the Samsung's themselves come and nothing matched the pure perfection of the plus. Well what are you going to do they don't make them anymore. And then on prime I saw that Samsung was selling them, for more then they're top of the line current model. How's this possible? They quit selling them years ago?My theory is that the human ear, Is only so big. There was a team at Samsung that put this bud into the Universe, and those in the upper echelon know it is the Alpha qnd Omaga. I planned up the lessons, and the perfect bargain earbud does not make for the quarterly Prophets jump where the marketing team happy. So they have hidden this, for those that are only in the know. Hey now you know, I bought and Amazon refurbished pair, as well as the buds FE. As a birthday present. The buds FE arrived 3 days before the plus, and I did not unseal the package, because I knew in my heart. I went to my Amazon locker 3 days later with speed and haste that not felts in years. Went home and let them sit for a good I don't know hour and a half as I twittered about my apartment. And when I put them in my ear? Yeah, that's the stuff. Look no further. I mean wait I don't want you to take them all, keep your secret between us. Don't tell anybody about me, we will be the ones the know.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AHDU55ERJSNNE2TRRY3IES4KN6VA","is_verified":true,"helpful_count":24,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2B6WXUUHOLYEK","title":"5.0 out of 5 stars They are absolutely perfect.","author":"James Heilman","rating":5,"content":"These earbuds are the perfect pair with my Samsung Galaxy note. A match made in heaven! The earbuds fit perfectly to my ears and are very comfortable. Sound quality is superior. Case is small, convenient and has excellent battery life.","timestamp":"Reviewed in the United States September 4, 2024","profile_id":"AHNP64HX3WYMUB3FHLZVTD5SULBA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3M7P0P2SH71F1","title":"5.0 out of 5 stars Hard to beat, but get aftermarket tips!","author":"Thunderlizard","rating":5,"content":"For the money, these buds are fantastic! Call qaulity inbound and out is good, with teh exception of an occasional improper insert in my ear making my voice sound like a walkie-talkie...simple repositioning fixes this.I noticed ambiant sound blockage was not that great with the stock eartip, but I purchased an aftermarket set of tips that has a multilayer construction (Diofit Premium) for next to nothing and they now block almost all but the harshest outside sound. Quite impressive. Now on to playback - in classic Samsung fashion, these buds sound fantastic! Highs are crisp (not hard with earbuds) but most impressive is the rich, deep bass. So enjoyable to listen to music, because the sound quality is great and now the background noise is almost non-existant. Hard to beat in this price range!","timestamp":"Reviewed in the United States July 15, 2024","profile_id":"AGRJVNZVN72GIUIXS7R2H7IZUH4Q","is_verified":true,"helpful_count":11,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R294Y8Q07GDR4C","title":"4.0 out of 5 stars Samsung can do better.","author":"JohnnyD","rating":4,"content":"Overall, these earbuds sound great, the noise cancelation works very well, they last a long time while listening to music and they fit perfectly.So why the 4 star rating? First you get a white charging case with black headphones inside. There is NO other option, its how all Galaxy Buds FE come. That's silly, and shows just how badly Samsung is trying to penny pinch. I purchased them in black because both my Samsung phones, watch and other accessories are in black. If I had wanted white, then I would have bought the white earbuds!Secondly, unlike the other Galaxy Bud models currently. there is no wireless charging available. While that's not a major issue for me, it would sometimes be convenient to just be able to set the whole case down on my Samsung trio wireless charging stand. Instead I have to set them off to the side and attach the USB-C cable to the back. Again NBD , but it's annoying that I don't even have the option to do it.","timestamp":"Reviewed in the United States September 2, 2024","profile_id":"AGKDYYEY2T5SGJNAFY425WVGULYA","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1WNQF7Z0X3LJK","title":"5.0 out of 5 stars Incredible Value, Samsung Delivers","author":"Matt","rating":5,"content":"Sound Quality: 8/10These don’t sound like earbuds I just dropped $75 on. They sound like premium quality, well-balanced, and capable wireless earbuds. Bass actually comes through with a satisfying low end and instrument separation is clear and natural. They’re also handle dialogue clarity very well.Comfort and Fit: 9/10These are the most comfortable wireless earbuds I’ve ever used. They feel nearly weightless, but at the same time very secure. The rubberized winged edge on each earbud hooks right into your ear without being uncomfortable over 4+ hours of use.Case Quality: 8/10The reason I needed to buy a pair of wireless earbuds is because the case for my last pair came apart at the hinge after a few drops. I’m not always easy on these things, they get tossed into backpacks and I’m bound to drop them here and there. The case for these feels pretty sturdy and secure. They’re a hard, glossy plastic and there’s a mechanism in place holding the lid up when fully open, which is satisfying. I don’t like how easily I can bend the lid backward as it seems to have quite a bit of give to it, but when closed it feels firmly clasped shut, so hopefully that’s never something I need to worry about.Battery Life: 7/10I get a solid 5+ hours of listening time out of these with noise cancelling on, and 3+ charges out of the case. They’re not going to blow your mind, but they hold their own just fine.Noise Cancelling: 8/10Really surprised at how well these block out noise for a pair of earbuds that cost less than $100. Cutting grass or walking near noisy roads won’t be an issue.I want acknowledge a big reason you may not want to buy these. If you’re an iPhone user, there is no app available to adjust EQ or add the functionality to skip or reverse - only pause, play, and noise cancelling controls as a default will be available to you. If you have a windows laptop or could use somebody else’s Android device for a few minutes, you can enable the ability to skip and reverse and play around with some other features. I myself use iPhone but don’t mind lack of app support because my fiancee has an Android, and once you set them up you’re not likely to need the app very often, if at all.","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AHH37BTDBFCWAKSMQFKWHKP2V6WQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R227PH0MQHZDU5","title":"5.0 out of 5 stars Simply amazing","author":"Manny","rating":5,"content":"I usually don't write reviews, but I felt like I had to after I dropped one of these earbuds 25 stories on hard wood and it still worked. I had a pair of Sony WF1000XM4s (which I paid $300 for) and one of them fell out of my ear while playing basketball. That was enough for them to start constantly glitching out and disconnecting to my phone. These earbuds are $200 cheaper, sound just as good (I actually think the bass is better on these), and are incredibly durable. If you're looking for a great pair of wireless earbuds, do yourself a favor and buy these.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AHWIZZDRUNLUKTFTSRGDJQRFHM3Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:02","page":1,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=1","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=2","asin":"B0CF7GYNW2","page":2,"pages":72,"reviews":[{"id":"RGPM5X2OZO2S0","title":"5.0 out of 5 stars They are great for watching TV","author":"MC","rating":5,"content":"I prefer streaming video over a ROKU streaming device and normally, small earbuds are not strong enough to pair with a TV. But I discovered that when these earbuds are paired with my phone, while using the ROKU app, I can use them to watch streaming video movies and shows on my full size TV via the ROKU app on my S22 phone. This was a surprise because I only thought I could get audio when connecting wired earbuds to the ROKU remote control. There is no lip sync issues and it sounds great. I use the full size ROKU ultra, so I don't know if you can get the same results on the thumb size ROKU device. These earbuds are great for phone calls and music as well. The case does a great job of charging them and I highly recommend them.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AEP5EQ2ACRIM23HXFRBFVND5H5XA","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"RZBP1EAN43L3","title":"5.0 out of 5 stars Great ear buds!","author":"Holly","rating":5,"content":"I love these ear buds. I have little ears and have a hard time getting ear buds to stay in my ears and these really do especially with these Wing tips. The sound is great and they last a long time. I thought that they did not have a recharging case but mine are back to 100 percent everytime i put them on. I don't use them everyday but I have only charged them one time since I bought them in July this year! Really glad I got them!","timestamp":"Reviewed in the United States September 7, 2024","profile_id":"AGYUWMOGSJME5GDUJ2R2IFMTSIIA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2N6DI62ZXN1RJ","title":"4.0 out of 5 stars ok not best","author":"Adam K.","rating":4,"content":"The outer case options are always white, even with the BLACK option it, only changes the interior and the buds themselves. I would have much preferred a black exterior. the buds themselves arent the worst to feel in the ear. they stay in well enough but with fatigue and don't get nearly as loud as my JBLs or some much cheaper ones I bought prior, sound quality seems fine, calls are clear, a bit of lag on the touch to pause. Overall they aren't bad but there are better ones for the price and more colorway options.","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AECB7YOK2O6BCAGXKTTHJO7CQBBQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1GJL2IOJEH4U8","title":"4.0 out of 5 stars Works great!","author":"Amazon Customer","rating":4,"content":"I have a samsung phone so I ordered these for that reason. The sound is great when listening to music or media. It has a surround sound to them. As for phone calls I can hear pretty clear on them except once there was static but I'm not sure if that was the earbuds or the phone. Sometimes the person on the other end can't hear me very well, I've been advised that I sound muffled which I'm assuming it's from having the earbud pushed so far into my ear, but I like to make sure that I don't lose them like I have in the past because they are so small and falls out of my ear. But overall I like them alot.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AFVZMGKEZORD5EWHLHT537N4J7QQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1ZGZEGDWGAT69","title":"5.0 out of 5 stars LOVE!","author":"A. Simpson","rating":5,"content":"Comfortable, noise canceling perfection. Super durable and easy to use. Comes in a case for easy storing and charging. Also comes with different ear sizes to adjust to any ear hole. Great price! Much cheaper than in the store.","timestamp":"Reviewed in the United States September 7, 2024","profile_id":"AH5KRCWWPU3Q6NQHLNQGJLZFRM6A","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"RCFRTDPM7UCWL","title":"5.0 out of 5 stars Buds with Comfortable fit and great sound!","author":"Amy L Meyer","rating":5,"content":"These Samsung ear buds are awesome! Once I got the fit right, I wore them comfortably for hours, exercising, doing laundry, going about my day with a favorite play list. The sound was awesome, picking up every instrument in the arrangement. Samsung seamlessly connects their products, so easy to use. I love these!","timestamp":"Reviewed in the United States September 1, 2024","profile_id":"AHY6EIX7C3YQ7IRHYQMEDYOAW5XA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R33JELJBEAJZS9","title":"4.0 out of 5 stars Works as expected","author":"Sandi","rating":4,"content":"Works as expected however does not fit ear well. Provided three different caps yet none are providing a good fit.","timestamp":"Reviewed in the United States September 8, 2024","profile_id":"AFJ2KMLYP4RMN4QTDTHGFCJ6AIPQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"RZBKIU3X6Q3I5","title":"5.0 out of 5 stars Simply great!","author":"SC","rating":5,"content":"I have always had issues with discomfort from earbuds and them falling out when I move too much. These solved that problem. Those little wings on top might not seem like much but those and the overall shape helps for verrrry comfortable fit. You don't even have to stick them far inside your ear.The sound is really lovely... smooth, velvety and rich. Personally, I go for a heavy bass and I love that I could choose different equalizer settings.The noise canceling is great also. You can turn on ambient sound if you so desire to zone out.I have a samsung phone so pairing was super easy.Overall I really have nothing negative to say.Get them.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AHNAWWN465AFW3YSZA6Y7QYV2UOQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2XY7TJRVID4YG","title":"5.0 out of 5 stars Survived Deep Frying","author":"Roger  Smith","rating":5,"content":"I'm not recommending you do this but I accidentally dropped one of the buds into my deep fryer while I was cooking. I got it out after maybe 20 seconds. I put it in rice over night and it works just fine with no loss of quality. The sound quality is good, it connects easily, I've never had issues with the mic, and I'm still impressed with it's battery life almost a whole year later.","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AG55YY3UAKWEVLEDBM4XZWUPR5RA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2ZWJJPE3QA7R8","title":"5.0 out of 5 stars Amazing product","author":"Caleb","rating":5,"content":"Fits well, the sound quality is really good, super easy set up, very durable (I've dropped them a couple dozen times), the color is what the picture shows. Over all it's a really good pair of earbuds and I would definitely buy another pair.","timestamp":"Reviewed in the United States September 1, 2024","profile_id":"AGJ2J6XMYT5S7R4PRQZJELILJAUA","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:09","page":2,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=2","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=3","asin":"B0CF7GYNW2","page":3,"pages":72,"reviews":[{"id":"RSKG76YIK9Q1M","title":"5.0 out of 5 stars WOW! WAY BETTER THAN ANY OTHERS!!!","author":"Angel","rating":5,"content":"I've had several ear buds and these are by far better than any others I have tried! The sound is great, but even better THEY DON'T FALL OUT OF MY EAR!! Like I can shake my head sideways and they stay in place. I LOVE them!!","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AF37NVOOFH4IEDHRW4Z3YJ6QLOUQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R3SC2P5G4XYJ8P","title":"4.0 out of 5 stars Stability and noise cancellation","author":"Emmanuel Chuma","rating":4,"content":"Stable in ear and noise cancellation is great. Would recommend for sure. I just don’t like the fact that they start disconnecting after you leave away from phone a few feet.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AGSJ6MM4VU5HK3VOAR7AUI754ALQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1V4JS0AWJEJ7","title":"5.0 out of 5 stars Worth It","author":"Ethan","rating":5,"content":"Didn't think they would be amazing, but I was wrong. The ear fit test works very good, I didn't have to change out anything from the box. Buds never fall out or loosen and they don't hurt my ears at all. The sound quality is amazing. Hard to hear other people while keeping one in my ear at work, but I'm lucky to not really need to communicate with people at my job.","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AEDKVHFM2GXOSKBEVBB4BXLOSFTA","is_verified":true,"helpful_count":2,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1M7CS8OGGKCOA","title":"4.0 out of 5 stars Great sound but poor fit","author":"Paul","rating":4,"content":"These sound fantastic but I just can't get comfortable with them in my ear so I've returned them. They use soft tips that go into your ear canal that I find very uncomfortable after a short time. I mostly listen to audio books so I'll return to outside the ear canal buds.","timestamp":"Reviewed in the United States August 14, 2024","profile_id":"AGBVCQAUEYRCSGCXTOQZSBX6WRAQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R1SAJX6UR47E5C","title":"4.0 out of 5 stars Good ear buds","author":"C. Brown","rating":4,"content":"My last pair of Samsung ear buds were amy favorite. These are ok but I'm petite and they a bit big. After I wear them a while my ear gets sore. But if you have normal sized ears you will like them. I miss being able to skip or play back my songs with a touch of the earbuds. My old Samsung buds (from 2020) would do that and were about the same price as these. Good battery life. Not as great as the older version. About the same for phone calls. Callers complain of background noises.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AF5MMCT57TG36IK34RLTIL5A5P7A","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R12ZXZXAEMLC4X","title":"5.0 out of 5 stars Very good earphones","author":"Gregory","rating":5,"content":"Great batter life and the case also has great battery life as well. Usually i just use one and change it out for the other when it gets low because i drive a lot and cant have 2 earphones in at the same time. I've used one earphone nearly the whole day before it died","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AHCCFLL3MVDWRCZTPZ6XESDGTOXA","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R2JAT9603LMQ1T","title":"5.0 out of 5 stars Never Knew I Needed","author":"CT Yankee","rating":5,"content":"I have never been more pleased with a purchase. Everything positive about these is true. I can take a nap, exercise, and block out noise without worrying about losing.","timestamp":"Reviewed in the United States September 1, 2024","profile_id":"AGZHMEDYTGEQOZLEMA4ITSDBEBUA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R4VAA90AAFF1W","title":"4.0 out of 5 stars Great quality for money","author":"Rick Corum","rating":4,"content":"I absolutely love these earbuds! Great sound and plenty of bass in them. I am able to use them at work all day with no discomfort and still able to hear ambient sounds when necessary. The only downfall that I see overall would be that the case doesn't charge wireless (I knew this coming into buying them) and the other would be the water resistance level. Other than that, completely loving these buds!","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AG34MWOE7YDBHXLUHLRGH3BL4VDQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2KHX16MQ7Y1AS","title":"5.0 out of 5 stars The best","author":"Robert S Schatzman","rating":5,"content":"This is my 3rd set and I like them the most.The sound is great and the battery last longer then my last set.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AHP62B2LMDSZ7H3USORK7MLITLQQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R34GICNO8EBM0O","title":"5.0 out of 5 stars Works out of the box, great sound, great comfort.","author":"David Smith","rating":5,"content":"Sounds amazing, ran for 45 minutes with nothing but perfect comfort and sound. never felt like it was going to fall out of my ear.","timestamp":"Reviewed in the United States September 2, 2024","profile_id":"AGRWGTUJNJ4CLEMSC7JZ5M6UOZSQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:10","page":3,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=3","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=4","asin":"B0CF7GYNW2","page":4,"pages":72,"reviews":[{"id":"R1SAVA6ZMWR1MI","title":"4.0 out of 5 stars Best for the price only issue is charging in case can be finicky.","author":"Amazon Customer","rating":4,"content":"I love these earphones and I'm quite satisficed with my purchase. The only issue I have with them is that charging the earphones in case disconnects with any small movements. The left side doesn't connect to the pins as well as it should. I have the patience to work with it but I am not so sure for other customers.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AG6VQAQNSMNZUHCO22HCVPL5MGDA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2DF8N0X73YNUW","title":"5.0 out of 5 stars Great earbuds","author":"Peg Sue","rating":5,"content":"The earbuds arrived quickly, delivered in a sealed, brand new package with accessories and instructions. They connected easily with my Samsung phone and work great!","timestamp":"Reviewed in the United States September 4, 2024","profile_id":"AFNOOWJQJBBD7RFV2JLVKLF42DFA","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R2JS4VZ81OI4DA","title":"4.0 out of 5 stars They'll fall right out of the case but have great sound","author":"sukajai","rating":4,"content":"The buds have very weak magnets and thus will fall right out of the case if dropped. Not amazing, but at least the sound quality is excellent, likely best in class, and the noise cancellation is also great. The battery lasts a long time in the buds themselves, but I've noticed that the case tends to lose battery after a few uses. Not a huge deal, but something to keep in mind considering how small the case is.","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFP3NS5K3PLOYMBBOQM2QCTHYHIA","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3557LRUU1299C","title":"5.0 out of 5 stars Awesome","author":"Lexi","rating":5,"content":"Bought these as a gift for my boyfriend and he loves them! Look great and he has no complaints","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AHNZIA4H3JZFOO7PQXP4Z5DTV3UQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3DQRRM16JWYX2","title":"4.0 out of 5 stars Good quality low price","author":"Josh","rating":4,"content":"It exceeded my expectations and the widget that samsung gives for the earbuds are quite helpful. I'd suggest getting an audio equalizer app to pair with the earbuds though.","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AFS37RDIDLJUGBDUWROMEWDVWGSQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2GDIC9V9XDTC1","title":"5.0 out of 5 stars Just what I needed","author":"Karl J","rating":5,"content":"Middle Quality Ear Buds, great price. The biggest pro is the form factor with the wings, these stay firmly in my ears unlike other ear buds that fall out.Originally I went with google Pixel series A buds, but those were garbage, wish I bought these sooner.Sound quality is good, definitely not high end, the buds pro 2 are superior for example and there are several earbuds with better sound quality than those.","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AGUDUGXSDTKYXNXMDQQV3OOPMKHA","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R5SUBS4RN391R","title":"5.0 out of 5 stars Best out of all the buds!","author":"s.g.","rating":5,"content":"I'm a FE (Fan Edition) person when it comes to Samsung. I've seen the buds pro 3 that just came out and it's giving Apple. I feel like each model got worse. My Buds 2 kept falling out of my ears and the sound wasn't great. These buds, however, stay in my ears comfortably, block out any outside sounds, connect easily, and unbelievable quality in sound! Great bass! They should have never changed the look of the buds. I love these. Get them.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AG7VE5MJIH7QGXLM6KGXMWCE44KA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2LZ15BZ7BFSNB","title":"4.0 out of 5 stars Well worth the cost, but could be a little louder 😉","author":"wpstoner74","rating":4,"content":"Well worth the cost, but could be a little louder 😉","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AHM5VKBYYBOB2KYNK3EAIKWT335Q","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R2JXV0WPUD87EL","title":"4.0 out of 5 stars Good price.","author":"Melissa Nattress","rating":4,"content":"I like these ear buds. I think they have been durable. The only thing I don't like is the fit. I have small ears. This bud makes my ears sore with extended use. The product itself is great. I just thought saying ear size could help another consumer make the best choice for them. I would recommend this product.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEKQCQYRIAF4YG2LFFQHK6CQ7HSQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1Q2N5BSTNO8Q2","title":"5.0 out of 5 stars Beat all of my expectations!","author":"antonio calderon","rating":5,"content":"After a failed trial run with the Amazon Echo Buds (which were a waste of money), me and my wife gave these a try. And let me tell you, we LOVE them! These are the first pair of buds with true ANC that ACTUALLY worked and worked very well. Ambient mode is great also, so I can wear 1 in my ear at work and still be able to hear everything around me perfectly, while still listening to my music. Was a little weary about the bad reviews for them not staying in the ear well, but they actually stay in great for the both of us. She was more worried because she has a LOT of piercings in and around each ear so finding good buds that fit comfortably AND stay in is very hard for her to find. The sound in them is also pretty great. I'm no expert but all i have to say is the sound is crisp. Really surprised we were able to get something with this type of quality and functionality for only $79. Super happy with our new ear buds!","timestamp":"Reviewed in the United States June 25, 2024","profile_id":"AGLGTELXUBN6XYG6QDBLQUOLJ3SA","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:11","page":4,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=4","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=5","asin":"B0CF7GYNW2","page":5,"pages":72,"reviews":[{"id":"R2GHJ7907Z7D74","title":"5.0 out of 5 stars Samsung Wins! No Question Ask...","author":"Pony She","rating":5,"content":"Two years ago, I spent about $200 on Amazon to buy a pair of B😨se ear buds, but unfortunately, the left one broke after I only used it five times! The reason is that failure will occur if the battery is completely exhausted without charging. After Google online, I found out that this problem has always been there but the manufactur never done anything about it. Sigh! Unable to return it, I can only scrap it and try to get a new pair. This time I stopped being superstitious about top brands and bought this pair of Samsung. I was very happy after receiving it because not only the sound quality is much better, but also no hidden flaws. This pair of Samsung buds is really great! I am very pleased and I am willing to recommend it to everyone!","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AGXLHTRWUEX6I2T54HGOTDNWL4MA","is_verified":true,"helpful_count":3,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R1U937M1ZCAJSX","title":"5.0 out of 5 stars Love it!","author":"ReyRey","rating":5,"content":"I am a samsung user for life.Quality 👍🏼- this is my 2nd pair or samsung buds. I finally decided to upgrade my old one. I'm glad I did!ease of use 👍🏼- very easy to link to my phone and setting features are easy to follow.battery life 👍🏼","timestamp":"Reviewed in the United States August 18, 2024","profile_id":"AFOIEKT5G2APMOTQSM7LFOCRVCPQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R297X810TOGSEL","title":"5.0 out of 5 stars These are Really Good for $$$","author":"Cliff's Music","rating":5,"content":"For 64.00 on Prime Day sale they are a steal. Work very well with Samsung phone. Comfortable, very good sound quality for the cost and good noise cancellation.Phone calls are clear and other end reports the same.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AH4NJ3HFE5TFTRZL552NE22JS2LA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3BML4ABI93MC5","title":"5.0 out of 5 stars Very impressive","author":"Douglas A Taylor","rating":5,"content":"I like them a lot. Use them while mowing and can barely hear the mower. Excellent sound quality. Great buy.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AHI3CCFQ34B36KSF5VPKMELXXOPA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2PG2EC31PKKMX","title":"5.0 out of 5 stars Comfortable","author":"Shannon R.","rating":5,"content":"Love these because they work well & shape & size work better for my ears.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AGY6PNQJV5JIB4W5SHOV67EDIDSA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2HV67GUICRFX","title":"5.0 out of 5 stars These are great.","author":"Trevis Love","rating":5,"content":"These have great sound and seem to last for quite a while. The only thing I would change is that I should have ordered them in white. I accidentally dropped one in the yard and it took a minute to find.","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AHZSD5ZUPXQPFZD5CPAXAGNCO77Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2U00ESCHO21C3","title":"4.0 out of 5 stars Clear sound","author":"Monica","rating":4,"content":"You can hear the music well and phone calls but many complaint when in conversation that they can’t hear me","timestamp":"Reviewed in the United States August 13, 2024","profile_id":"AEY4YLN5DMVHZIXQFASLCOKZMDCQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R1BWXTD8040NV4","title":"4.0 out of 5 stars The sound quality is amazing","author":"Viktor","rating":4,"content":"the earphones are great but the noise cancellation isnt the best","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AEQ5F5CVWXTXA6SBWUTUJSVYGN6Q","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R1B0A63USYT9BS","title":"5.0 out of 5 stars The ANC on these is amazing","author":"Jeremy","rating":5,"content":"I was disappointed that the galaxy buds live never got a revision so I bit the bullet and got these to replace them. I'm no audiophile but the sound was good, the fit was pretty good out of the box but the Active Noise Cancelling on these are amazing. It was like muting the world so now I can listen to my music at a lower volume and drown all of the New York hustle and bustle.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AF2BKDDY6XIYUWDMIWZ4U25I4EIA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R27D79F5MJXSYY","title":"5.0 out of 5 stars Excellent","author":"Mike M","rating":5,"content":"Only issue is don't drop them on a plane! Also the extra rubber thingy on the outside of the bud is too thick so the case doesn't close 100% and sometimes they don't charge","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AFILECYYLA7UGDCDBJLJE77UQAWA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:12","page":5,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=5","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=6","asin":"B0CF7GYNW2","page":6,"pages":72,"reviews":[{"id":"RJ5KDG4YXG4BG","title":"5.0 out of 5 stars Awesome buds","author":"Big E","rating":5,"content":"Love these buds! Especially for the price. you can't beat it! Awesome sound","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AGLNFGCCH4BCJIC46FDMDBXAYO5Q","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R12VQHXDPBV2JE","title":"3.0 out of 5 stars Better to buy new and Best with Samsung phone","author":"Julie","rating":3,"content":"This is a bit long but I feel it provides good info regarding your phone or electronic device to be paired with earbuds and purchasing new vs used earbuds. If you have questions about these topics please read!I purchased these for my boyfriend. He has a Samsung S22. I have bought him multiple types of brand new earbuds in the $70-$80 range in the past. He had to charge all those daily in order to used for 1.5 hrs while he walked. I wanted to buy him something nicer so I bought these. I chose to buy a used set in hopes that they were in great condition and maybe the box was just torn. I changed them overnight on accident (I prefer not to charge too long). Then paired then with my iPhone. I have owned several versions and pairs of iPods and Beats Pro (over the ear). So my first reaction was disappointment because the sound quality did not compare and little things didn’t work the same. For example when you take your Beats out if your ear whatever your watching stops. That is not the case with these. Also when a call comes in, I had to manually change the option to the ear bud on my phone screen vs just answering by touching my ear. However, I still gave them to my boyfriend for Easter and when he paired them with his galaxy he was prompted to add an extra app that gave him different features than I had with my Apple. Initially he was not too impressed with the sound, he expected them to be louder. The noise canceling was so good, he had to take them out to hear me talk to him. What he loved about them was the length of time he was able to go before charging the case. Remember I charged them one time, then he used them off of my original charge after sitting in the box for a few days. He wore them everyday for 5 days without charging the case. At that point he was really happy with them. Enough to overlook the sound quality since it was not what he expected. Unfortunately when he charged the case he was not able to get the Right earbud to charge. We tried different troubleshooting methods. Unfortunately none of them have worked. We will be sending them back. I don’t have experience using Apple headphones or buds with Samsung phones but I feel if I had bought these brand new, he would keep them vs buying headphones like mine. I’d rather pay an extra $50 to get new products going forward. Please air on the side of caution if you buy used or refurbished version of these ear buds. Hopefully this helps someone trying to decide between new or used and Apple/Beats products vs Other earbuds to pair with an android phone.","timestamp":"Reviewed in the United States April 11, 2024","profile_id":"AGJMX2SCRHKROIKHLJLZZB64452A","is_verified":true,"helpful_count":2,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"RYPO9KWEVSFU2","title":"4.0 out of 5 stars Clear sound","author":"Sophie","rating":4,"content":"Good product, clear sound.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AE7UUBEALI4326CLLPIWR3SERFFA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1DBVYH7MK21TN","title":"5.0 out of 5 stars Comfortable fitting","author":"Melissa","rating":5,"content":"I love these earbuds even though I only use one because it's more convenient for me to have one ear available to hear the surroundings. I even listen to the music when playing pickleball and can answer the call at any moment without grabbing the phone.","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AHNITFX4BLEGEFYX4KIQUXTLYHWQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R11E88XXPU9B0N","title":"4.0 out of 5 stars Worth the money","author":"Travis","rating":4,"content":"I got these earbuds to replace my Skullcandy earbuds and for the 10 dollars more they are worth that. I wish I would've bought these 1st.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AHMWCGGD7NXCC6G7VSKIOMRBFO6Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3CE0QYI4TC6RY","title":"5.0 out of 5 stars Nice fit","author":"Juan Barragan","rating":5,"content":"They fit in ear good call &music is good","timestamp":"Reviewed in the United States September 8, 2024","profile_id":"AHWN3HCJEZ5HRTIVDBMHB67SF2MQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R39HRO6I7ZJIDF","title":"5.0 out of 5 stars No jack hole on the new phone","author":"david","rating":5,"content":"These sound very good battery lasts a long time.","timestamp":"Reviewed in the United States September 5, 2024","profile_id":"AH3D3PX6IVKAIKP5LJRNVM6I6KLA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1QX8A5MEZUGEG","title":"4.0 out of 5 stars Great over all","author":"Jewel","rating":4,"content":"I love the sound quality. It was very easy to set up. They're lightweight and came with many earbud cusions and wing tips. I love the fact that the buds actually stay in my ears without falling out. The magnetism is strong. My only complaint is that it wasn't the color I ordered.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AFO24CWSH2LGGRHD3SGFK372HTMA","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2LJM0SEOWRH9D","title":"5.0 out of 5 stars Ear buds","author":"Julie L.","rating":5,"content":"Love the way they fit and sound. Small and easy to lose if not careful but overall great product.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AHBPCKKUYLHZVTNIC266OSOCU4MA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R21CMMNMVB4PAW","title":"5.0 out of 5 stars Work well","author":"Porsche Neale","rating":5,"content":"I like these but I think the lima bean buds work best for my ears. These work great and they don't short out.","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AHOSF5SSLSXISNAU4AOHORC4XJ3Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:13","page":6,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=6","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=7","asin":"B0CF7GYNW2","page":7,"pages":72,"reviews":[{"id":"R23RMNWZCNTKS6","title":"5.0 out of 5 stars Impressed","author":"J. Heil","rating":5,"content":"I am impressed at the fit, ease of use, and sound quality of these Buds. I got them on a Prime Day deal and couldn’t be happier. Note, I have not tried these while running, but I did wear these on a hot and humid walk where I got sweaty, and these buds stayed in my ears just fine.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AEQTDV733XQ5SQQU5QLI36PQTZLA","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3JTLBP3ZUVRC1","title":"4.0 out of 5 stars Good ear buds.","author":"BaddAzzYellaBro","rating":4,"content":"Pairs easily with my Samsung Galaxy phone. Nice fit and easy to use app.Edit: After using a few times. Very short battery life, even on standby. Keep the case handy to re-charger if you plan to use for an extended time. Knocked off 1 star.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AGP6A7V2HOOPODYJGCJDFWQ4HV3A","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R392Y9XSJXNHOD","title":"5.0 out of 5 stars Best sound quality per dollar. Period.","author":"Temur","rating":5,"content":"PROS:I've tried probably 30+ headphones and I've got to say these headphones are the best sounding. Lows and mids are perfect-- not muffled together. Highs are just crisp enough to not be annoying-- they shine through perfectly from the nice smooth lows/ mids.I think the sound signature of these earbuds are very natural in it's core while packing a punch.My favorite headphones all time is the audio technica mth m50x-- these earbuds remind a lot of m50s!.CONS:Fit and comfort over a long period of time. Initially-- the fit is great within the first hour. However, for long period of time-- the earbuds themselves start to sore the inside of the ears--- leaing to user to take breaks by taking them off.","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AG65YOPZYIJ5TWZEWCUZQTZFECZA","is_verified":true,"helpful_count":3,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R9T6UOSYTM24J","title":"5.0 out of 5 stars Great headphones at a great price!","author":"Anthony.cardona","rating":5,"content":"Comfortable wear, great sound at a great price. Highly recommend!","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AFUUF576REMLCDGWD3JNK5RBJE5A","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"RUWZ7ITKRZ07M","title":"5.0 out of 5 stars Excellent","author":"Robert L Croghan","rating":5,"content":"Excellent","timestamp":"Reviewed in the United States September 2, 2024","profile_id":"AEQWAGNAQ55C7FGHDLFNR56AFIKA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3QAMJKDDU4VAK","title":"4.0 out of 5 stars Jury is still out","author":"ShaunMar","rating":4,"content":"Jury is still out on these. I think if my phone didn't have Samsung Sound Assistant to eq the sound, it would fall short of expectations.Surprisingly, these sound louder & more bold on my iPhone. Back on the Galaxy, the bass is less pronounced than my old buds live. You could argue that's a more 'balanced' sound, but if you want more bass, you want more bass.They do seem to stay in ear better than the live & the BT signal connection is much improved over the live. The live was straight garbage when it came to holding on to the BT signal.One thing I dislike is no good way way of seeing battery levels.Other features are cool. May update this review later after I've had it for longer. One thing is I wouldn't pay a dime more than I did for it. It would be a better value at a lower price.","timestamp":"Reviewed in the United States May 6, 2024","profile_id":"AGU3XLILM3YJZCHEXXZ7DUJUQNEA","is_verified":true,"helpful_count":2,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"RJG8IBDWCR4C","title":"4.0 out of 5 stars Not great","author":"Ibuy","rating":4,"content":"These are fine at best. But I only bought because I list my pro models. When I found the pros again and compared, it was such a huge difference. These are less comfortable and the sound quality is so poor in comparison.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AESQELLMKIJ752NEMT434YLFNN5Q","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R1W264PASAJTW6","title":"4.0 out of 5 stars Compatibility issues","author":"Mr.E","rating":4,"content":"App doesn’t work with apple","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AHMIYT272XSPR2MZVFAJ2SXPS7TQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1BQJ9X35VH5PQ","title":"5.0 out of 5 stars These earbuds are pretty much perfect","author":"vacuums","rating":5,"content":"I had a pair of Galaxy Buds from years ago that I really like but were starting to act up. I looked at a lot of different options and even tried a set of Anker buds that I ended up returning. I came back to these, which I think are the newer version of what I had. Things I like:-The buttons are very easy to tap and double or triple tap. There are a lot of different options to customize what that does in the app.-Sound quality is great.-The fit is fantastic for me. I love the ear \"wings\". They make a nice secure fit that and it never feels like they are in danger of falling out.-Changing case is compact and these charge easily by dropping them in.-There is an option to set either the right or left earbud to toggle between noise canceling and ambient sound modes when you long press. Both these modes work great. Noise canceling is enough that I can mow the lawn without needing separate ear protection and I can quickly switch to ambient mode if I need to hear someone talking to me.-The biggest upside is that these are quite a bargain. Quite a bit less than some of Samsung's other models of earbuds.","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AHBS6XL3547LMXGA6C7OAOHBKJYQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R3IBHZG8O0BRYE","title":"4.0 out of 5 stars Best earbuds I have ever used","author":"Carolina De La Ossa","rating":4,"content":"I purchased this earbuds because I was tired of using some cheap SkullCandy ones that really hurt my ears. These are the most confortable buds I've ever used, specially for me since I have tiny ears. I also love the fact that they stay in place when using them for workouts and jogging sessions. The noise cancellation works wonders. I'm not particularly fan of the ambient noise feature, it amplifies the ambient noise to much, even when setting that to \"low\". If I take these to the office, I end up accidentally eavesdropping what my coworkers are talking about from a mile away, which ends up been distracting. The idea was to notice if someone was talking to me so I didn't have to continuously take the buds off. Also, Mac support isn't the best, but I'm sure that's Apple's fault haha.","timestamp":"Reviewed in the United States May 11, 2024","profile_id":"AFLT22IXIXZMRWEOQJT2VHKS4TJQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:14","page":7,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=7","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=8","asin":"B0CF7GYNW2","page":8,"pages":72,"reviews":[{"id":"R2YRQBJWJ1JXBY","title":"5.0 out of 5 stars Good Product","author":"Ms.  LC","rating":5,"content":"I like that they give you a two band option because I have small ears. I keep my phone on silent an they alerts me of incoming messages. I like that when you insert the Bluetooth you have to twist it to secure it in the ear.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AHNNKOWMIVHIIIOUF4NALFWI2WTQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R9KU1FFX7GNYA","title":"5.0 out of 5 stars THESE ARE AMAZING 😍","author":"Iriana McGowan","rating":5,"content":"First off their hefty they have a good weight nothing rattles or is loose everything looks expensive and good quality. As soon as I put them on it's like I was sucked into noise cancellation world everything around me when I put them in with no music playing sounds like you're underwater which I love cause I don't wanna hear anything outside of my earsbuds! The music sound is crisp no static no muffling no gurgling just clear sound and it's loud their amazing I love them will most definitely buy again!","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AE6GC6BGMWUDCPT2BCV6AHIIWR5Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R27H82J63U5YLE","title":"5.0 out of 5 stars Great noise cancelling.","author":"Blood dreamer","rating":5,"content":"These are great headphones, I've had them for a few months now and haven't had any issues with them. The noise cancelling feature is amazing and the most used, especially when my family is fighting and I need an escape. Just great to turn my music on and create a silent zone to not hear the screaming..They're also apparently drop resistant, I had one knocked out of my hand and it went flying a foot or two almost into a river, no damage and works perfectly. Was scared I was going to have to replace it too. Was shocked to see it was fine.","timestamp":"Reviewed in the United States July 6, 2024","profile_id":"AFZVHDXA4R72E56U5EI2SJZO6D3Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1YTI3VLOWYF09","title":"5.0 out of 5 stars Phenomenal.","author":"Dani","rating":5,"content":"Everything about these earbuds is amazing. I am a massive nerd for bass and things being loud. The bass is full and heavy.I was a bit skeptical because the newer models don't fit in my ear as well as the old Galaxy Buds Plus but these... these are amazing. Their so comfortable I could probably sleep with them in comfortably.As always, they were extremely easy to connect and the features are fun to play with.The battery life is amazing too. Please consider getting these earbuds.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AENX3CDQA3NTUWTP4QTL67SC7JJQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1QZ3Y3242HPQY","title":"5.0 out of 5 stars Work Fantastically!","author":"YaddaX3","rating":5,"content":"These were bought as a birthday gift for my son. He said they have great sound quality and I hardly see him without them on so I know they're comfortable for him.","timestamp":"Reviewed in the United States August 12, 2024","profile_id":"AFZWRLAOZPGFRBERYGRFGCSVOEHA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1QTC9ISQKQ7TP","title":"5.0 out of 5 stars Quality","author":"Allison","rating":5,"content":"Very great quality and sound. The quiet mode is perfect. Very comfortable","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AHGVXWKG4LY7DHKPUKHXRNB23VSQ","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"RXRMRAJVXDZDC","title":"5.0 out of 5 stars My husband loves them","author":"holly","rating":5,"content":"Really cool headphones! They’re really nice! And sit comfortably in your ears.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AES7F3OUX64VK6L25LDIUPNVR7TQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R358YJWJF71RYM","title":"5.0 out of 5 stars Wow","author":"Dalton","rating":5,"content":"These earbuds are amazing for the money, they're comfortable, the sound quality is better than any other earbud I've ever had before, and nomatter how much I shake my head I can't get these things to fall out.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AGUIVZFLO5SG3H5BQUI7ZKHETK4Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R17FJGOSB1UHEO","title":"5.0 out of 5 stars I love it","author":"Austin Arnold","rating":5,"content":"You should buy it. I can listen my music without noise","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AFKMKUQUP4QIDIJSM6SWLOKTJ3YQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R257MJWLPJ3LTD","title":"5.0 out of 5 stars That they work!","author":"Sherry B","rating":5,"content":"That they were compatible with my phone and they work GREAT","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AHFUIE7GUC2RJDJMSLLB33KAV4OQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:14","page":8,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=8","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=9","asin":"B0CF7GYNW2","page":9,"pages":72,"reviews":[{"id":"R3TOOLGUTVYLEE","title":"4.0 out of 5 stars Nice","author":"Lionheart","rating":4,"content":"Im still waiting to test device properly, look and feel is premium. I will update my review within a few weeks.","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AE5W5ICZQ5C45LK6VHUMP4SNB6CQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2J5F63E48VZCU","title":"3.0 out of 5 stars Not overly impressed","author":"Amazon Cutstomer","rating":3,"content":"I've only had these a day but there are not many reviews so I'll give my 1st impressions. I wore them for a few hours doing yard work (using my Samsung S22) and tried them with some of my favorite test tracks connected to my PC and using Amazon HD music (using Exclusive mode)The first thing that surprised me was the white case... I ordered black, and at first thought they sent the wrong ones but opened the case and the buds themselves were black. I don't like white, but whatever.Looking at the case there is not much indication of what is the front and it's a bit fiddly to open. The magnet to suck the buds into place is not very strong, so a bit fiddly to lay them in the case.I don't like wearing buds much, but these were pretty comfortable right out of the box. The insertion was not quite as deep as I like but they stayed in well while I was moving around and I did not feel the need to keep adjusting them.How do they sound:I want to emphasize these are first impressions.These have a polite sound that would probably please many people. I'm not one of them. When I got the Lypertek buds for the same price I told people \"I can't believe how good a sound you can get for $100 these days\". With these, I would say \"They are ok, most people would like them\".They are \"fine\" for having something playing in your ear while you do something else but they did not bring out any joy in the music for me. Nothing stood out about the sound. Ordinary comes to mind or, nothing wrong but nothing right. I'm not into 'soundstage' the the lack of one while listening to live tracks actually stood out to me.The sound is a bit congested, the instruments kind of bunched into each other. There is no 'air' around the instruments. I found myself pushing the volume louder than I normally listen to \"wake them up a bit\".Detail retrieval is decent, but you are not going to notice the reverb, the grind of a distorted guitar, the 'ting' of the drumsticks on a cymbal, breath sounds, etc. The overall presentation is smooth enough from low to high, with no glaring holes, or peaks. If I had to fault the frequency response it would be male voices. Just a bit in your face at times. Bass get a bit tubby if you try to push it much. In \"normal\" mode I found it just about right.Let's see what I can 'fix' with EQ. The EQ in the App has 9 bands, cool! But that hardly matters if there is no custom EQ option. Seriously Samsung? The Sennheiser App only has 3 bands but at least they let you set a custom EQ, name it, and save it.There are 7 presets, but none of them really gave me something I liked. But there is enough variety that most people would find something they like.I'm mixed on keeping them. The sound is good enough for what I want them for. listening to music while I do something else. They are comfortable and stay in well, but I am not impressed with the sound. It's \"fine\", it's \"okay\", and \"good enough\" but not impressed with the sound for the $100 price point.","timestamp":"Reviewed in the United States October 21, 2023","profile_id":"AHEC6HVESDBP2W2DMMSYGA4GPGFA","is_verified":true,"helpful_count":43,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R28TYW5YM8BHTH","title":"4.0 out of 5 stars No wireless charging","author":"Jeremy Gilbert","rating":4,"content":"Seem to work well good bass sounds pretty good","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AEUMRYBRR577SPGSGCHSOAN6LNGA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R26CCGXKSPAB14","title":"4.0 out of 5 stars Tiene buen sonido","author":"RSC 12353 Noelis Moya","rating":4,"content":"Llegaron bien sin rasguños, completo de piezas y tienen excelente audio","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AHT6F5G6B367VWOJN45JJLIDVEPA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R1E8GW3YJGD2ZC","title":"5.0 out of 5 stars Auriculares Inalámbricos de Gran Rendimiento","author":"Andre Salcedo","rating":5,"content":"Los Samsung Galaxy Buds FE me han sorprendido gratamente. El sonido es excelente, con bajos profundos y agudos claros. La conexión Bluetooth es estable, sin cortes molestos.Lo que más me gusta es lo cómodos que son. Puedo usarlos por horas sin que me molesten, y el estuche de carga es muy práctico para llevar en el bolsillo. La batería dura bastante y se carga rápido.La integración con mi teléfono Samsung fue instantánea y los controles táctiles son fáciles de usar. Aunque no tienen cancelación activa de ruido, bloquean bien el ruido de fondo.En definitiva, los Galaxy Buds FE son una gran elección por su calidad de sonido y comodidad. Muy recomendados por el precio.","timestamp":"Reviewed in the United States June 27, 2024","profile_id":"AFWDUFNPGVT3BYUERFAGB5GPKP7Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"RL5B31K2HQA4G","title":"5.0 out of 5 stars Excelente Producto.","author":"DARIO","rating":5,"content":"Me encantó. El sonido es perfecto. La cancelación de ruido es de lo mejor. Excelente opción de compra.","timestamp":"Reviewed in the United States August 17, 2024","profile_id":"AEPEUPOQNERTYVTSSQW2PP2JYF5A","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R3F77HYKHNR3X9","title":"5.0 out of 5 stars Comfortable and work great","author":"Desirae Norcross","rating":5,"content":"These are very comfortable and work great. Love the noise canceling option.","timestamp":"Reviewed in the United States August 14, 2024","profile_id":"AFGY2WCKSVMFYZUN2VSSG57VR5BQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R19W2HZ1CL5OB8","title":"5.0 out of 5 stars Convenient","author":"keiserdog","rating":5,"content":"I love these, sound is great, my one complaint is that they're not loud enough but I've never used a pair that were. They are comfortable and they stay in well.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AHHW2YID6SZBKUTTC7S2B2WG6T7Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2KGWOO8QLPUIV","title":"5.0 out of 5 stars Great Buds","author":"Mark/Sharon H.","rating":5,"content":"Great buds. They fit well, easy to setup for bluetooth and works great. Get the warranty. When you buy a page pops up saying buy this Charger don't buy it one comes with.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AHNRCVYUS64QQQNT4CMIEEEMHBKQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3UCJR5B6IAA7K","title":"5.0 out of 5 stars Big fan- I'm an ear bud convert","author":"Liz S","rating":5,"content":"I hate ear buds but these make me hate them less!! They paid so easily with my Samsung phone and laptop (my JBL cheapo ones were always struggling) and the battery life is stellar. I like the noise canceling feature and the ability to turn that off (i.e. during biking or hiking). Range is so so but my old JBLs had bad range too so I don't know how to compare.The wing tip is really what converted me because it stays in my ear!! I liked the ear clip kind previously but now I'm all in on these. Woohoo!","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AE4VOAKSVMIINXEUZTPGN6KWEYLQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:15","page":9,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=9","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=10","asin":"B0CF7GYNW2","page":10,"pages":1,"reviews":[{"id":"R30ZMMZOINAXB5","title":"5.0 out of 5 stars Will not fall out, good sound isolation","author":"MarkC","rating":5,"content":"I have purchased three or four off brand earbuds over the years. Why I didn't get a quality pair like this first I'm not sure. Very comfortable in-ear and the little wing hooks into your ear Channel when you rotate the earbuds slightly. They will not fall out and are much more comfortable than the style with the over the ear hooks. Much easier to get in too. Sound quality is very good to me I'm no audiophile. I've been part of the Galaxy ecosystem since way back. These fit in perfectly with Samsung's software and other products. Don't hesitate.","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AEERN3JKOAWRTV5FFNPM7VYPUWOQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2DWC8F630E4LY","title":"5.0 out of 5 stars Love the sound","author":"Shawn Briggs","rating":5,"content":"My last pair someone wanted more than I did evidently. Love them but one bummer is they don't utilize wireless charging like my last pair.","timestamp":"Reviewed in the United States August 11, 2024","profile_id":"AFRMFJ6RQL6QM7TIBNQPTREULBCA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R302LWBOFW4DUJ","title":"5.0 out of 5 stars Best ear buds I've ever owned","author":"Alexandra D.","rating":5,"content":"I'm extremely happy with these earbuds. I love that the software helps you fit them to your correct size that way you get the perfect fit which truly makes a difference. They're so comfortable and it's pretty much impossible for them to fall out of your ears. They connect right away and the sound is amazing","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AEF4AMKMQY7YRFFHM3SOIHHHDQ7Q","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R52RL39M3DZB1","title":"5.0 out of 5 stars Fast shipping.","author":"Amazon Customer","rating":5,"content":"Got here quick. These work really well. Sound is awesome.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AF7WVGTAQSN5J6T5IHRDJ746O4DA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R36CDEANXKU5VQ","title":"4.0 out of 5 stars As advertised","author":"Kindle Customer","rating":4,"content":"Work fine as advertised","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AETXW25JQOIZB7IHV2QDKFWYO2XA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R2O8HEINAC9D1F","title":"5.0 out of 5 stars Samsung Buds Fe","author":"Andres Gutierrez","rating":5,"content":"Excelente desde que realice la compra me llegaron antes de tiempo. Excelentes audífonos un sonido muy bueno, fáciles de vincular con el celular y con el reloj.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AGNBEYOBAEVZNPL7IJCSLRPUW5NA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R3SIU0086MVQS7","title":"5.0 out of 5 stars Everything 🙂","author":"C.","rating":5,"content":"These are the best buds I ever bought. Touch pad on the buds. The nlise cancelation is great and the ambient sound is insane. You can hear how the both modes switch. Great buy plus i got them on prime day for a great deal. Great size for the case and buds. If you have a samsung and love samsung like i do purchase these buds!","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AG5FYXUU2UEXDIPAOLKU3YPX2RJA","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R248KTR8R5PFBT","title":"5.0 out of 5 stars So Happy I Chose These!","author":"Summer","rating":5,"content":"I love these guys! Amazingly snug fit! Great sound options and quality! I was torn between the FE and the true wireless. These were $45 cheaper, fit much better and have all the same sound options and quality. So happy I went with these!","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGULJ7YPFPDYO57FPZQVN67GBJ5Q","is_verified":true,"product_attributes":"Color: WhiteStyle: Buds FE Only"},{"id":"R2H1AXL54AMK76","title":"5.0 out of 5 stars Awesome buds for the price!!!","author":"Candygirl","rating":5,"content":"I just received today I can't put them down. Sound quality, fit, ease of use 10 out of 10. Now, full transparency I have never paid more than $20 for headphones, so I may be easy to please. They even let you know if the bud isn't positioned properly. I'm in love. I will update my review when I experience the battery life.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AE2M3WK2IQP4G6GYY5BLXZUTLUEQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"},{"id":"R19K1S53XGUW9F","title":"3.0 out of 5 stars Good quality, but not \"the one\" for small ears","author":"Amazon Customer","rating":3,"content":"I like the sound quality on these enough. the tap to pause feature is nice, but I find myself accidentally setting it off sometimes when I go to adjust or re-secure the earbuds, which unfortunately happens often since I have smaller ears. Also the double tap feature to skip songs.. I can rarely get it to work. I like these better than the beats earbuds, but the search for the perfect earbuds continues. Functionality with my phone is great. Never any issues with connections and the battery life is really good for how I use them.","timestamp":"Reviewed in the United States September 5, 2024","profile_id":"AGJG2V4RIFBLRYOEOHN222ICP7YQ","is_verified":true,"product_attributes":"Color: GraphiteStyle: Buds FE Only"}],"page_type":"Question","asin_in_url":"B0CF7GYNW2","product_name":"SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]","parse_status_code":12000},"created_at":"2024-09-11 14:57:59","updated_at":"2024-09-11 14:58:16","page":10,"url":"https://www.amazon.com/product-reviews/B0CF7GYNW2?reviewerType=all_reviews&pageNumber=10","job_id":"7239648376898193409","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-11 14:57:59","domain":"com","geo_location":null,"id":"7239648376898193409","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B0CF7GYNW2","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-11 14:58:16","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7239648376898193409","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7239648376898193409/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7239648376898193409/results/1/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/2/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/3/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/4/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/5/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/6/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/7/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/8/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/9/content","http://data.oxylabs.io/v1/queries/7239648376898193409/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7239648376898193409/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7239648376898193409/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7239648376898193409/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7239648376898193409/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7239648376898193409/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7239648376898193409/results/10/content?type=parsed"],"method":"GET"}]}}