{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=1","asin":"B0B75RL6JX","page":1,"pages":66,"reviews":[{"id":"R1VIDEM80IEUVK","title":"5.0 out of 5 stars LOVE","author":"Christine M Jones","rating":5,"content":"I love the volume and Bass on these guys. The different size tips are perfect..well for me they are, they stay in my ears no matter what I'm doing , the app is helpful. The equalizer is awesome. I'd love louder, but that's just my preference, I want it to rattle my brain literally, they're loud, don't get me wrong. Only dislike, more of a little annoyance is, they're very touchy, it's not a deal breaker, I've gotten used to it already. They last all day as far as battery, my right seems to ALWAYS drain quicker, it's weird, but again, not a deal breaker. I will honestly say, I've tried so many brands, and skullcandy is just IT , every aspect, skullcandy is IT. Keep it up skullcandy , great job. Can't wait to see what's next.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AELWWUUPSVTAANZMGW6DA22DSCZQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3OPHZVX0OPQKG","title":"5.0 out of 5 stars Surprisingly pretty decent","author":"DG57","rating":5,"content":"Normally my reviews are very short and to the point however this one's going to be a little bit longer. I didn't think that these would actually be worth it but in fact they are. There are extremely many features that are missing on very expensive earbuds. And I'm talking the big brands...First I'll tell you that when you do set up with the app a hearing test it actually does work it helps greatly especially if ones hearing isn't what it used to be. Secondly, as with most, you can set your equalizer to your own personal settings if you want to. The sound, or music, actually doesn't sound awful again I was a bit surprised. Now another thing that is usually a problem for me just keeping my buds in my ears at all times. Well please actually stay in perfectly and they don't hurt one bit and that's using them for at least 9 hours in a row without taking them out. The battery life as far as I know it looks like it might be pretty good unfortunately I haven't given it enough time to judge that but by the usage I have had with the buds they seem to hold up relatively well with ambient on. Basically I'm very satisfied with these I will keep them and hope that they do keep them updated as they should when needed.Now one con is the app is a pain in the butt. It has to always know you're nearby settings it always ask you to have Bluetooth on, which is already on and the buds are already connected before you get into the app. I don't get that one maybe they'll fix it and the other which is unfortunately the case. The case is a bit flimsy and when you want to try to keep the lid open it keeps falling down so I think that that was a architectural design flaw other than that they're definitely worth it I'll get over the case problem all I have to say is if you want them you'll be happy with them. Used with an Android device.","timestamp":"Reviewed in the United States May 1, 2024","profile_id":"AHGEE6GHAOLR2CPHPYAGVOP4D4DQ","is_verified":true,"helpful_count":17,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2P911VTMFZQ9C","title":"4.0 out of 5 stars Definitely worth the money.","author":"JEB","rating":4,"content":"Are they comparable to some of the top brands? If you consider price, they may be better. My previous buds include Bose and Samsung so this is the basis for my comparison. Pairing was uneventful and the Skull IQ app is easy to use. ANC and Stay Aware feature work as advertised. Fit is comfortable and secure. Audio is more than acceptable; especially is you use the Skull IQ app to customize the sound as well as the included hearing test portion of the app to create a personalized profile. For those that suggest there is not enough bass, I recommend using the app to customize the sound and make sure that the buds are tightly fitted. I would buy them again for the price I paid (not sure why but my price was 49.88 new). Might shop harder at the $89 current price.","timestamp":"Reviewed in the United States April 30, 2024","profile_id":"AFMJ35PO4VNBE6RKUFOMU3ONELZA","is_verified":true,"helpful_count":11,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1TYWKUO3ELIOS","title":"5.0 out of 5 stars I've had lots of ear buds","author":"Katie","rating":5,"content":"I've had lots of ear buds, these are by far one of the best! They hold a charge foe a long time, comfortable in your ear, performance is great, charges fast, very durable and sound is stability. Great value for the money.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AFRSSJC3L5TZ5J65S7XCDCF5JHWQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R3H10YDL5HCE03","title":"1.0 out of 5 stars Allergic reaction, weak app, connectivity issues","author":"Mack","rating":1,"content":"Edit: added more at the endIf you had an allergic reaction to Samsung Buds 2 or their other earbuds, you'll react to these as well. I wore the Rail ANC for less than one afternoon and by dinner my ears were already reacting with liquid discharge. This morning at 4am I had one ear almost totally crusted over and still leaking while the other was leaking but less crusted. I've had this reaction before and I suspect it's the material used for the inserts. Also, the little logo they put on them didn't help either. Anything that causes friction in the ear canal is a stupid idea. I got these for a trip I'm taking on a plane across country and I'm kinda screwed now because I can't return them in time to get something else. My old wired headphones from when I bought my Samsung pgone don't react, so I took those ear inserts and luckily they fit, so I through them on. Once my ears stop reacting and chill out, I'll see if that fixes the issue in time for my trip.As far as function goes, the headphones are okay at best. They can get plenty loud to the point that ANC or their Stay Aware pass through mode mean nothing. It's nice to know I can listen at lower volumes like I prefer and still have ambient noise be mostly audible or have anc keep things subdued. But subdued is the best they give and mostly audible ambient noise is about as much as you can expect. These aren't stellar at either. Doable, but not something I'd laude about.They sound pretty good for what they are. Not sure if I'd say they're $100 headphone quality or value, allergies aside, but they don't sound awful by any means. Music was clear and had some rumble. I used the sound personalization and it was easy enough to get decent sound. There a bass boost, general music and podcast sound setting with a customizable equalizer in the app as well.The buttons on the side are touch activated and finicky. I tend to tap fast and expect fast responses, but these prefer a more methodical pace. The sweetspot for where to touch is also funky, but I started getting it after a few hours. Also, the audio queues are clear enough, but an option to remove them would make things feel faster. Also, if they're not in my ear, I wish touch capacity stopped. Plenty of time I took one out and accidentally started changing tracks, changing volume and activating pairing mode.I remapped all the touch responses and even changed what ear did what. One tap on either paused, double tap on left was volume down, on right it's volume up. Three taps left was previous track and same on the right was skip ahead. Long press in either toggles ANC on/off and pass through audio. I appreciate customization like that.For what stands out as good, I'd say it's the voice prompts. Much quicker to respond than on my phone or watch and that's kinda sad because it's the feature I'll probably never use and cared rhe least about, but seemed so much better than my phones inbuilt assistant that Samsung spent so much time, effort and money on to develop (rip bixby). If you like using voice commands, that's gonna go great, although the \"take photo\" command doesn't work with my Samsung's camera app. Again, not something I was after anyways.One of my favorite features was the built-in tile function for finding them if I lose one or both. The tile app isn't super intuitive, but I mostly figured it out and stumbled my way into it connecting both buds. It creates a tone I can hear when the room in my apartment is silent and has a directional sensor to let me know if I'm getting hotter or colder. Granted, it's not terribly responsive, sensitive or consistent, but if I moved slowly through a room, I bet between the proximity sensor and sound I'd probably find one if I lost one. It's a nice feature to have where I'd otherwise be totally screwed, so I'll take a win where I can with these.I got these on pre-order. When they were scheduled to release after 2 weeks, they ended up coming 10 days earlier or less. It seems weird i had to pre-order when people said they were already at Walmart for a couple weeks, but whatever.I'll update after my ears recover and try them using the non-reactive ear inserts from my old wired heaphones and see if they don't react again. I was furious about my Galaxy Buds 2 causing this reaction, but my wired stuff and my LG Tone Platinums never caused an issue. If it weren't summer and the LG Tone Platinums weren't makeing my neck hot, I might never have bothered looking at this style Bluetooth buds again. But it's a trip to a Nevada training center after the hottest july month on record in human history with averages around 110 in the area I'll be. I thought I'd take a chance on mild comfort. I'm hoping I didn't waste my money now that almost out of time.EDIT: It's been a few days so I'll add more input. Battery is pretty good, but it's not enough to bump a star.The app Skullcandy IQ is awful. It's what controls your key presses. The problem is the app is always on, but loses connection and resets all your programmed key presses. I end up having to reset them every day when they eventually connect poorly. The app logo constantly in my phones notification bar isn't necessary or tell me any input about my headphones. If it at least told me battery levels or connection status, maybe I wouldn't be so annoyed, but this just ISN'T ready for prime time.Also, the ear inserts are what caused the allergic reaction. They jerryrigged replacements I found by chance from a totally different set of wired buds from an old phone work well enough, but I shouldn't have to find my own replacements. At least having an option for different inserts that are non-reactive would be beneficial like memory foam or whatever. Again, Samsung Buds 2 had this EXACT issue and replacing inserts with an aftermarket set was the only solution. For a list of symptoms, it's pretty unmistakable: liquid discharge, discolored mucousal discharge in ear, weeping ear, flaking and scaly skim that seems to build up and shed, pain itching, inflammation, basically a large skin irritation in your ear canal that, if unmanaged, becomes a severe ear infection. Samsung got sued for it and has been paying out for their affected customers. Skullcandy is headed the same way with these unless they have a hypoallergenic replacement in the wing.If the connectivity issue wasn't so bad and not saving my preset remapped button setting wasn't so annoying, perhaps I would add a star or two, but this isn't ready for release and I'm probably returning after giving another day or two. Really sucks I'm screwed out of my trip for headphones, but I'm not gonna struggle with a new set of buds I paid good money for. I'll just go back to wired at this point.","timestamp":"Reviewed in the United States August 6, 2023","profile_id":"AGBD5VMAS2AAPL36TJ7KCLJ6HJNA","is_verified":true,"helpful_count":33,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2LT64DQ1X3GZN","title":"3.0 out of 5 stars Immediate issues","author":"xjarius","rating":3,"content":"I have long been a fan of Skullcandy headphones and earbuds, at least 10 - 15 years. The earbuds were always decent and sturdy, even if you got cheaper ones.My last pair of true wireless earbuds were the Skullcandy Indy earbuds, and I was so sorry to see these were no longer being made.But I was looking forward to the Rail ANC earbuds. First, ANC! Second, a decent IPX4. Third, great battery life. Plus, they cost more, so they must be higher quality, right? So I splurged a little on June 28, 2024. These earbuds sound pretty good. I can tell only a minor difference when the ANC is on and when it's off. The passthrough mode is okay, maybe about as good as the Indy's. The battery life was amazing. That's right. Was. We'll get to that. I loved using the app SkullIQ, where you can customize control settings. I was able to change what the number of taps on the sensor does. Super cool!My list of gripes as of 8/23/2024.First of all, how did my right earbud stop working within the first month? There's a sound when you press the sensor. Within 2 weeks, it started randomly making the sensor pressing sound. Then it started saying Pairing... pairing... as if I was doing long single presses. Then it started skipping to the next track(triple press) and trying to start Spotify* (double press). Within the first month it just wouldn't power on at all. I tried all the tricks and worked with Skullcandy support to no avail. They suggested I submit a warranty claim.*Sidenote: how does it fail to open Spotify whether I'm listening to Spotify or not?).Sometimes they will connect to my phone even thought they are in their case and should be off. My Indy's would do this, too, but it took at least a year or two before that started. This started within the first two months.Every once in a while they wont even connect and you will have to go to settings, forget device, then pair them to your phone again. This is what Skullcandy support had me try to fix the right earbud. Occasionally I need to do this on the left earbud as well. Well if you do this, you have to customize the SkullIQ app again.The case is cheap. My Indy's case was solid and sturdy. It had a few LEDs to indicate how much battery life was left in the case. This new one is flimsy with one light that shows you if the battery is being charged or not.Lastly, the Indy's stayed in my ears much better than the Rail's do. So I'm constantly needing to readjust them in my ears. With a name like Rail, I figured it was made for an active lifestyle. I wash windows for a living, but these things don't stay in my ears too well.As of today, they are in the mail headed to San Diego for the warranty claim. Hopefully, I get a somewhat better product when it's returned.","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AHV5ROMBVTEEYRVPTVNTHS7P52EA","is_verified":true,"product_attributes":"Color: BoneStyle: Rail ANC"},{"id":"RQBE8LOFHEMNF","title":"5.0 out of 5 stars These buds murder AirPods Pro 2","author":"Joshua Busby","rating":5,"content":"Tl;dr - Here’s what you probably came here to find out:- Sound quality is phenomenal. Deep bass and rich crystal clear highs. Hands down better than AirPods Pro 2, and significantly so imo.- Battery life is the longest I’ve ever experienced, once again shaming Apple.- Noise cancelling is great. For this, I’d say it’s equal to AirPods Pro 2, if not slightly better.- They fit very snugly in my ears and don’t fall out with movement. They come with three pairs of ear tips, each a different size.- Very good construction and premium feel. They also look really good.- The charging case can either be charged with a type-C wire, or on any wireless charger by laying them down on the charging pad.- The Skullcandy IQ app is actually useful with features such as custom EQ, voice control configuration, ANC controls, etc.Long version:Borrowed my Wife’s AirPods Pro 2 off and on for a week before deciding to give these a go as they were 50% off, and as someone who listens to metal and hard rock, these things absolutely murder Apple’s flagship buds. As far as sound quality and loudness, going from the AirPods Pro 2 to these was like going from ramen noodles to premium ribeye. The bass is right where it should be, and the treble is crystal clear and clean. Loud is an understatement. I use Spotify Premium and am happy with the EQ within that app, but the EQ within the Skullcandy app is really great as well. These are made well and feel great. Battery is roughly 6-7 hours, so really great. They fit great, are very comfortable, and don’t fall out with movement. All in all, these buds are amazing. Apple can’t compete.","timestamp":"Reviewed in the United States April 26, 2024","profile_id":"AE6BWRNCJSN5J52HYLXDSZSZT6MQ","is_verified":true,"helpful_count":36,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3FZPBV5FU3RB4","title":"5.0 out of 5 stars Impressive battery life!","author":"Matthew H.","rating":5,"content":"I previously owned the Skullcandy dime2 earbuds, but I was having to charge them every few days. With these earbuds, the battery life lasts considerably longer saving me from having to charge them constantly. The case is very sturdy and the noise cancellation is superb. Because of the sound quality and noise cancellation I can listen to music in a noisy gym without having to crank the volume way up. I am glad I spent the extra money on these rather than getting the dime 2 earbuds again.","timestamp":"Reviewed in the United States September 7, 2024","profile_id":"AFCKT7TYPROTLCNKAYFK3OJTFBLQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3AVK4OZJY3SH","title":"4.0 out of 5 stars Great ear buds","author":"Sean w","rating":4,"content":"These earbuds are great, they have a long battery life, are comfortable with good sound. I've yet to find a pair of these that will stay in my ear completely but these stay in longer than any others I've had. Skull candy makes great products and for the cost you can't beat these.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AHNK3HCWAZK3SUMPR3AZWOPRQOCA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R3BPYMHDKJ1HDW","title":"4.0 out of 5 stars Really impressive","author":"Carol Browning","rating":4,"content":"Have had many different Skullcandy earbuds and these are the best so far. Very comfortable and the sound is really good. Disappointed that they use a different app to mange then the previous models and that's why I gave it 4 stars instead of 5.I love the fact that you can pair to 2 devices at once. I use this at work and can pair to my work laptop and my phone at the same time. Really love that feature. Battery life is good and the case isn't overly big and easy to carry in your pocket.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AEUWQVUEJSNNEHU2BNE5TW3YL3SQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:08","page":1,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=1","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=2","asin":"B0B75RL6JX","page":2,"pages":66,"reviews":[{"id":"R38UEO0J0FF1Y","title":"4.0 out of 5 stars Would recommend","author":"Jesse Garcia","rating":4,"content":"The sound is what you would expect from Skullcandy, really bass heavy, which I enjoy. I like being able to use the Skullcandy app with these earbuds. With the app you can change the equalizer, switch sound modes, and customize the touch functions. I also like The voice control function. The only thing that I have a slight problem with is the fit. I use these headphones while I work and as I get sweaty they start to slip out a little bit and I have to stop and readjust. But other than that I really enjoy these headphones","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AGNAGTW7TSK4N7T24SFFAUZS7MXQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R22ZFPAU9YN9YO","title":"3.0 out of 5 stars Good for the casual listener, they are unreliable for the busy person.","author":"RiftCo","rating":3,"content":"After trying these out for a month I have decided that I don't particularly enjoy the product. They do sound great but the caveat is the reliability in pairing.The pros:Great sound, awesome EQ options, the app allows a bunch of personal customization settings that I did enjoy.The cons:The gesture button is smack dab on the rear of the headphone driver. When I would push in the headphones to secure them in my ear better, while listening to them or on the phone, I would always pause/hang up on accident.The EQ settings stay the same for both music and phone calls. I like some bass in my music.. but not so much on my phone calls.By far the killer of this product is the amount of times I had to re-pair the headphones to my phone. It is very inconvenient to do especially when I am in a rush and need to make a call.I'm always on the go, and rely on headphones heavily for entertainment and business. For a casual user these buds are great. But they are not good a good workhorse product.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AGDJLCOCQIOK772SPQI54YY7AK4Q","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1HT2LMINJ0J8X","title":"4.0 out of 5 stars not bad. good enough for the price","author":"Dinesh Bajracharya","rating":4,"content":"bought it as a gift for my brother. he liked it. but from my perspective it feels a bit cheap. the plastic body seems very undurable","timestamp":"Reviewed in the United States August 18, 2024","profile_id":"AETMEXS664R4XRASVMRWJDW75F6A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R27C2WS3LK79C2","title":"4.0 out of 5 stars Thoughts.","author":"Cesar Salas","rating":4,"content":"Sounds cool like their previous earbuds but as the previous the main downside is that they fall off a bit to easy for me no matter what eartip I use provided in the package.","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AGRGWYYBHP55HGUWMURAQ2K6GCQQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1JKFM4LUI7S8N","title":"5.0 out of 5 stars Awesome Sound","author":"Sean Stanley","rating":5,"content":"Awesome sound from these little ear buds. Great for working out or just chilling. I am able to hear what is going on around me so going out for a run I can still hear traffic or others around me. That feature can be turned off so if i want to immerse myself in the music or a movie, I can do that as well. I am real pleased with the quality of sound and the excellent bass these have. Highly recommend.","timestamp":"Reviewed in the United States August 14, 2024","profile_id":"AHWFIXRCFCH6CWLSU7AJFX44A27A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2T1NRXO5997GD","title":"2.0 out of 5 stars Unfortunately, not a great purchase… but I am keeping them.","author":"Kyle H.","rating":2,"content":"I had skull candy headphones as a kid, and loved them. Granted, this is back when headphones still physically plugged into a device or phone. So when I saw these I was super excited. Unfortunately, they ended up being the LEAST enjoyable earbud I have purchased, yet. Before you read further, it is worth noting that a lot of people are super satisfied with these earbuds, so it is extremely likely that this is more about my user preferences not matching with the specs of the item. That being said, the following are the agitations and the positives I’ve experienced since using them:THE CONS:• The earbuds regularly don’t sync with my phone & I am prompted at least 3x a week to “forget” the earbuds and then go through the pairing process again. Not a huge problem, but a mild inconvenience made worse by the regularity in which it happens.• The earbuds fall out of my ears from my jaw moving, which happens often, because my jaw moves when I talk on the phone.• The earbuds require an app to be downloaded to my phone, in order to customize each button sequence to the desired function (I.e. answer phone, play music, skip forward, etc.). The frustration I have with this is that the earbuds can answer a phone call with a tap, but they cannot end the call with a tap. So, in order to hang up, I have to use my phone screen (or wait for the person I’m talking with to hang up).• The earbuds verbalize information about the device, each time you put them in your ear. I can see how some people might prefer this, but I prefer just a simple one or two note “chime” to let me know the earbud is connected to the device. These earbuds state the following, each time I put them in: *chime*… pause… “Battery at __%”… pause… “connected”. This will happen, even if you’re listening to music or are actively talking on the phone & you swap earbuds. Again, not a huge problem, but a frequent nuisance.THE PROS:Now, despite these gripes, I will say that the sound quality of both phone calls and music are REALLY good (for the price of the earbud). Moreover, I have used AirPods, Beats Pro, and JBL earbuds… and I have had a few people tell me that the sound quality of my voice for them (when on the phone) is noticeably better. I did not ask these people before hand, they voiced it on their own accord. One person even said “did you get new headphones?! I can hear you so much better now!”. For these reasons, despite my many personal gripes, I am keeping the headphones. But buyer beware, they are definitely frustrating at times.","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AFKVKKJVHYVBJLCH466S6QD7JL4A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R33B3X3CD16JB1","title":"5.0 out of 5 stars Awesome ear buds","author":"Clint Kelfer","rating":5,"content":"I have had many ear buds over the years and these are the best I’ve had. The app you use with them offers great customization. I’m sure there are better but at a much higher price point. Definitely worth the purchase","timestamp":"Reviewed in the United States September 1, 2024","profile_id":"AHZNTYSKFSPQCVXPKCKMXVWCULZQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2RU9Z1TDLD5E9","title":"5.0 out of 5 stars Music to my ears","author":"HLV","rating":5,"content":"My wireless skull candy ear buds are perfect for me. I use them while working outside, and find the easy pause on them is awesome. If I need to pause my music I simple tap on the outer side of one of the ear buds and the music pauses. To start again just a simple tap. The case they come it great also. Its a mini storage case that charges my ear buds within the safety of the case. Love it","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AFJVKMS46LYXI46FXRFQJKUZFGNA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1RTH7DF1WY874","title":"3.0 out of 5 stars Regulares","author":"Enrique","rating":3,"content":"Los compré por el descuento que al final fue lo único de atractivo. No sé si es mi oreja, la forma del auricular o qué pero con ninguna de las 3 almohadillas me siento cómodo a los pocos segundos de acomodarlos se mueven y el sonido se filtra dejando inservible el ANC. Pensé que la calidad de sonido iba a ser mejor, no se que tan mal estoy juzgando pero siento que suenan a auriculares chinos. Vi reseñas en Youtube y decían que al principio el sonido era malo pero con actualizarlos esto mejoraría bastante (Desde que abrí los míos me salió que están en la última version, en lo personal nunca los actualicé yo mismo) pero al menos resuelven. Hace par de años tuve unos Indy Evo y me encantaban esos auriculares hasta q se los comió mi perro, no puedo sentirme así con estos","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AHHY4XK5ISA2GJ2BP2KCFFP4ZQKA","is_verified":true,"product_attributes":"Color: BoneStyle: Rail ANC"},{"id":"R3R84WJNV50LR5","title":"4.0 out of 5 stars Amazing sound quality, awkward fit","author":"ThatGamingKid45","rating":4,"content":"I purchased these in November 2023 and have been using them regularly for the past few months. The sound quality is amazing, I absolutely adore the “personal sound” through the app it uses. It connects really easily, barely a hassle. I like the added features, like how it can connect to Spotify instantly and play from the earbuds, or how it can detect whether or not you’re listening to an audiobook/podcast and adjust volumes accordingly. I also like the noise cancelling, it has a slider where you can adjust how much or how little you’d want. Overall, when it comes to the sound, it knocks it out of the ballpark.Though, one of my only gripes with it is the fit. It wasn’t built for movement. Even walking around with it indoors, it tends to pop out unless I continually push it back in. I’ve tried the multiple ear tips provided, but it doesn’t seem to help much. The other gripe I have with it is the controls, and how sensitive it is. Remember how I mentioned I have to continually push it back in? Well, 9/10 times I’ll accidentally pause the song, skip, or start pairing mode. The touch controls are nice, but I wish it wasn’t as sensitive, because the slightest poke sends it into a frenzy.Overall, it’s amazing if you’re just using it at home, stationary. The sound and battery life is phenomenal. If you plan to use it on the go, walking to and from places, etc. I’d advise to go elsewhere.","timestamp":"Reviewed in the United States March 1, 2024","profile_id":"AH35JWVQOH6GNEOZ5AXBB7EH5S3A","is_verified":true,"helpful_count":8,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:09","page":2,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=2","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=3","asin":"B0B75RL6JX","page":3,"pages":66,"reviews":[{"id":"R2WLP2MG1JHE0U","title":"4.0 out of 5 stars Pretty impressive with one flaw","author":"Brad Foster","rating":4,"content":"Out of the box, I wasn’t a big fan of these. The sound was pretty tinny and pretty weak. I saw someone recommend the Movie mode in the EQ. That helped a little bit. But the real change was when I went into the custom EQ setting and played around with it. The sound is awesome now. I put it behind my AirPod Pros, but ahead of all the other earbuds I have.I did only give it 4 stars because of the noise cancellation, or lack thereof. If you’re going to tout the feature in the name of the product, at least put some effort into it. I hardly notice a difference from when it’s on or off.","timestamp":"Reviewed in the United States May 25, 2024","profile_id":"AGFS4FQ5EXORL7KOQUANQSVWXCYA","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3LGW9PFV18CLL","title":"4.0 out of 5 stars Have to Delete and Re-load","author":"J. Gold","rating":4,"content":"These sound great and fit well, but I often have to forget/delete them and re-find to connect.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AELKIJNQKYA2LQR2YQUPPH73ZYRQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1C89N8H4OU6CJ","title":"4.0 out of 5 stars Great but no loud enough","author":"TattedPanda","rating":4,"content":"I really like these headphones but there were a few things I didn't like.I love the touch controls but when working out and sweating the controls are triggered. Ends up pausing and skipping songs while I'm workout out. I turned off the touch controls but it's a pain always reaching for my phone.Not loud enough when in the gym. Planet, LA and 24hr fitness all play pretty loud music and I can still hear it when I have the headphones all the way up. Played with all the settings and it just wasn't good enough for me.For now I'll stick with my grind fuels","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AH7WYKETZZMZGWLVCNI44UYGIROA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RYO7AA9Q4IL4F","title":"4.0 out of 5 stars Great features but....","author":"David Jackson","rating":4,"content":"Ok I've used these for a few months now. The sound is great, I'm more partial to bass and these delivered. The noise cancelling was really good no complaints there. The stay aware feature needs more work, the outside noise I could only hear if the volume was at the lowest setting. The Tile feature, is freaking awesome! Iost these bad boys a couple times and found them easily when connected with Tile. The battery life is also really good, I have only run out of juice once when I had a busy day.For the most part, everything worked really good. But there is one thing that is annoying but I'm dealing with because everything works awesome. I have to re-map the buttons the way I want at least once a week. It only takes a few moment but it is super annoying.","timestamp":"Reviewed in the United States April 26, 2024","profile_id":"AHIS27WLNG2KYAOR64HYQSQBG4QQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2F4AFFWI7KH0A","title":"5.0 out of 5 stars Better than AirPod pro","author":"Zach","rating":5,"content":"I don’t usually write reviews, but this was worthy of it. The sound is way better than AirPod pros. A little louder than the AirPod pro. The ANC is good not as good as AirPods but good. The comfort level is way better than AirPod and the price is exceptional.","timestamp":"Reviewed in the United States August 17, 2024","profile_id":"AFIBTN2DND6A6A5CN4EOC2TIBKKA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RWXI5GL4PIKWS","title":"4.0 out of 5 stars Love SkullCandy","author":"Jennifer R.","rating":4,"content":"Darn near perfect except for occasional cutting out. Noise cancelling is 🤌🏾🤌🏾🤌🏾 as per usual with SkullCandy. Don’t know why anyone would spend more $$$ for other brands.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AGG36IRNTQQ7V7JLFDIQCH3LMVNA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1ZQ3XL403KQN8","title":"5.0 out of 5 stars Great","author":"Helen Duerr Sullivan","rating":5,"content":"I've enjoyed using them. I love them. I have a friend interested in getting a pair.Performance is excellent, button are easy. Charging is fast. Very comfortable. Easy to pick up and go","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AFXFFVSGCFE63WFRMHMQMGJNFS3A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1SXJYNODH15XA","title":"4.0 out of 5 stars Good","author":"Justintherobot","rating":4,"content":"Good","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AESMYC7FWGB5WJDAETSXQADVWOJA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"RDOBFEG1VQ029","title":"5.0 out of 5 stars Great earbuds","author":"Amelia DeVoy","rating":5,"content":"The battery life in these earbuds are great. I normally only need to use one at a time and I don’t need to worry about missing music because it needs both earbuds, it recognizes just one being used and the audio adjusts. It works awesome for making phone calls. Everyone can hear me from either ear bud. This was a great purchase.","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AGYO3JSR6ZIJT3MA2SMEKEFXJ3KQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1RAB2GUOMEPLS","title":"4.0 out of 5 stars comfortable and sound good","author":"Jason D.","rating":4,"content":"bought these for my mom and she likes them but they don't want to turn off when you put them back in the lil box which made it so she couldn't hear anything on her phone.","timestamp":"Reviewed in the United States July 9, 2024","profile_id":"AFYYDAW54VIPSEMAEKCBLSLA6SGQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:10","page":3,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=3","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=4","asin":"B0B75RL6JX","page":4,"pages":66,"reviews":[{"id":"R3FB87QT486DD3","title":"4.0 out of 5 stars Works great, has a mind of its own","author":"TAMI M","rating":4,"content":"I love the sound and the ANC. The ringing in my ears has finally died down. I wish they would allow more app compatibility on user app though. My preference is Pandora and while it does play on headphones, it fights with Spotify, because that it the default player. I wish they would allow the user to choose the default player. The earbuds have excellent sound, but the controls are very sensitive and activate at the slightest touch, which is slightly annoying.** Update - the right earbud became intermittent, then the audio cut out completely, the controls still worked, but no more audio. I have sent the earbuds back to the company for warranty and I am currently waiting either for a new set or my repaired earbuds. Will update when I found out which.","timestamp":"Reviewed in the United States April 10, 2024","profile_id":"AGBAKUXOCNQAQ3QPOZ6SCHRUASKA","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1F6U8JZBMGTJM","title":"3.0 out of 5 stars These are good but have so many annoying issues","author":"Fredis","rating":3,"content":"These earbuds are really good sound wise and noise cancelling wise! The battery on them is also really good. However they do have a bunch of annoying issues. For example sometimes they will connect to your phone even thought they are in their case and should be off. Every once in a while they wont even connect and you will have to go to settings, forget device, then pair them to your phone again. And if you had custom control settings you will have to redo that in the app again. I recently had another issue where one of them was not charging and I basically had to wait for it to die and then it charged… like huhh. Overall the earbuds are good listening wise and battery wise I even like them better than the airpods but they just have so many tedious issues that kinda ruins it. Also the case just feels a little cheap/flimsy hahah.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AHEQ6DV7S4JA2N46CQ6HEMYCQIBQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1WYQTTEJ2W6P9","title":"2.0 out of 5 stars Disappointing","author":"Bandito","rating":2,"content":"I am a big fan of the SC line of ear buds. Let's get that out of the way. I own a set of Grind and Push Active, currently, and the case for the Push stopped charging, which is why I am here.I had really high hopes for these and was really let down. I purchased a set (XT) from Walmart and they sounded terrible. I returned them and saw these on sale and got them, thinking they might be different. The Walmart set was tagged with the 'XT' qualifier, so I didn't know if there were different components used in them.There aren't.1. I feel like I have average sized hands for a dude, so I don't know why I seem to fumble with getting the buds out and into the case. And when I say fumble, I'm talking about the kind of fumble that causes them to fall down a storm drain 10 feet away. I have had to hunt them down because they shot across the room when getting them out. I don't do that with my other sets. I feel like its my technique, but I dont know what the right one is...2. Touch Sensitivity is off the charts. I cannot turn up the volume, turn on ANC or anything else without accidentally pausing what I am listening to, EVERY SINGLE TIME. If you want to take one out to talk to someone, don't hold it in your hand. Now my boss knows I listen to Hailee Steinfeld, and SkullCandy is to blame. 100%. Thanks... I stopped using this feature, I lost patience and went back to doing everything on my phone. This may be a \"give it time\" thing or maybe making pause/play three taps is the answer.3. The sound. It's kinda bad... especially when you get up in volume. Even at about 75% I can hear distortion and they're no louder than my other sets at 75%. This is why I returned the XT to Walmart, because of this distortion. I do not have this issue with the Grind or Push Active, even at 100%.I don't know what happened.The positives:1. The announcement is toned down and less obtrusive. So if someone calls and I want to put them in, I dont have to pause my convo for 45 seconds. I can hear over it enough now to understand what's being said.2. The bass on them is really f'in nice, which is what I wanted when I bought these. I think this is the trade-off with distortion though, which is a major bummer. I will say that when these things get rockin with a nice bass track that doesn't distort, they can wiggle themselves right out of your ear. All you have to do is push them back in...pause...","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AGMO6CYINLL4ZTWZS7VP5Z3AB5VQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1E0IYO04W6YE0","title":"5.0 out of 5 stars Great sound","author":"Amazon Customer","rating":5,"content":"No cons all pros","timestamp":"Reviewed in the United States September 7, 2024","profile_id":"AF7AXRYDPDPXXUTIMP6LSLAI7HEQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3AO8DO9J1BH94","title":"5.0 out of 5 stars Quality is very good","author":"Ernestine Williams","rating":5,"content":"The sound is awesome","timestamp":"Reviewed in the United States September 8, 2024","profile_id":"AGIWMBJ26UYMXCSHD3LKPEUY22KQ","is_verified":true,"product_attributes":"Color: BoneStyle: Rail ANC"},{"id":"R11ZFEAX5DSWCQ","title":"4.0 out of 5 stars Full-Bodied Sound ... For One","author":"Josh Doncevic","rating":4,"content":"Bought these during Amazon's Black Friday sale with the express purpose of listening to music at work. Up until today (3/5/2024), when this review is being written, ownership has been fantastic. The Rail ANC earbuds performed effortlessly and are light-years ahead of my previous earbuds from Gravastar. However, one earbud, the left specifically, has ceased to emit any sound. Its touch and ANC features still operate, but there is zero sound emitted through the speaker. This is the first time an earbud or similar device has done this in my experience, and while I know nothing is perfect forever, but I am wondering how it happened. I have my volume set to its lowest setting and do not drop, abuse, or otherwise mistreat the device. When not in use, both earbuds are stored in the charging case. I should also add that I did attempt to pair the earbuds as if for the first time and the left earbud still refused to emit any sound. A disappointment to an otherwise fantastic product.","timestamp":"Reviewed in the United States March 5, 2024","profile_id":"AECWLJLCPVHBKGMPQAO4HXIXPP5Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2HRGCB1DG7GG1","title":"5.0 out of 5 stars Compren","author":"Cruz","rating":5,"content":"Tiene buen sonido","timestamp":"Reviewed in the United States September 8, 2024","profile_id":"AGHJAVJU3HPB5CLMD36D2KTSV5KQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RC4EZ6L9GP7L7","title":"3.0 out of 5 stars Not bad for price","author":"Ivaan","rating":3,"content":"They do work well and connected easily, the ANC is not very great by any means kind of a let down, the sensitivity of the button on the headphones is to much I don’t like that at all, the earbuds them selves as well are a little rough on the ears, I have the same issue with the old apple AirPods, over all tho not to bad for the price","timestamp":"Reviewed in the United States September 4, 2024","profile_id":"AE2YR4C4XLKG7RO7UK66JPKOQ5OQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1HP5CWJCT1K99","title":"4.0 out of 5 stars Great earbuds and they fall out","author":"Knitting gardener","rating":4,"content":"I really like these earbuds. They fit comfortably, great sound quality, great microphone. The battery use life between recharging seems kind of short. From fully charged to 30% in about 3 hours. The case recharges them quite fast. However, they fall out, no matter which pieces are used. Maybe it's the shape of my ear canal. But with the effort required to keep pushing them back in and the placement of the \"buttons\" on the piece, I end up disconnecting calls on the regular. If don't keep pushing them back in, they will fall out and then I'm scrambling on the zoom call to find the errant earbud that is now under my desk. Next time, I'll get the ones that have the over the ear loop.","timestamp":"Reviewed in the United States April 3, 2024","profile_id":"AHRNZEW4G46FQ673KQ7LJ55ZUGAA","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Rail"},{"id":"RDIOPTSZB8Q5J","title":"4.0 out of 5 stars Amazing sound","author":"Nixon","rating":4,"content":"Great pair headphones, skullcandy never miss with their mids, bass no questions asked. Comfortable fit to the point I fall asleep with them in my ears, waking with no pain from pressure points. Great battery life, however the Noise canceling is waaaaaay beyond disappointing, turn it on and I noticed there's barely any difference. Other than that still a great pair headphones I would recommend.","timestamp":"Reviewed in the United States May 24, 2024","profile_id":"AHVPQORAOXOCN7VKBCHZ4U44Z3SQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:11","page":4,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=4","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=5","asin":"B0B75RL6JX","page":5,"pages":66,"reviews":[{"id":"ROVY95GZ5B8XH","title":"4.0 out of 5 stars WOW! A must for the Music lovers.","author":"Amazon Customer","rating":4,"content":"Music comes alive with this earbud. It’s can blow away the other expensive earbuds.Not fit comfortable in the ear but it’s ok because the price is too good.","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AE37OC4NBCIXWRACSPWRNFA3F7UQ","is_verified":true,"product_attributes":"Color: BoneStyle: Rail ANC"},{"id":"R1L95JYX8VW2P1","title":"4.0 out of 5 stars Great bass and sound cancellation.","author":"Good sound quality  👍🏼","rating":4,"content":"After using these for about a month, I'm impressed with the sound and bass quality. However, I noticed that after a few hours of use, my ears start to feel a bit uncomfortable. This might be just me, but it's something to consider.","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AEASEOCUGDDSV3LMB2VNTOKXRXGA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R50M5EAGIIT2Q","title":"3.0 out of 5 stars Horrible battery life.","author":"Amazon Customer","rating":3,"content":"I bought these after using the ANC Sesh for over a year after seeing that the battery life was supposed to be better than the ANC Sesh by a few hours. That was definitely not the case. With the ANC Sesh I could listen to music almost all day without having to charge them. With these I'd be lucky to got 3 hours before having to charge them and the headphones case battery runs out so much quicker. Very disappointed as I listen to music all day, every day while working.","timestamp":"Reviewed in the United States August 17, 2024","profile_id":"AELT3XPIYCIOJKC5K5LZIJIQCJAA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"RXAV9XU31P1YD","title":"5.0 out of 5 stars Great product!!","author":"Frank M. Ciufo","rating":5,"content":"These earbuds are really well constructed. The sound is excellent and I highly recommend these.","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AHBKMZ2JIIW7YSJ7JPISJU7XH2JQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2MDTVNK2W67IS","title":"4.0 out of 5 stars Wife likes them","author":"Ashur Pritchett","rating":4,"content":"Better sound than her old ones. Flimsy material, but didn't haven't broke like her old ones. Software is unnecessary.","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AFJSVFK3J4ZDID3YI4QJ6GTCEUWQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2I527F2ENPT0","title":"4.0 out of 5 stars Decent","author":"Mick Lee","rating":4,"content":"Fir the price it's great, just too bad you have to have the app open for the equalizer to be adjusted, then they are amazing","timestamp":"Reviewed in the United States June 17, 2024","profile_id":"AEW2GF3QKGBUVNZYHJ577OZT2HQA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R2J8AY68BZQFGH","title":"4.0 out of 5 stars I am coming from the Indy and from skill candy","author":"Kenneth H Addison","rating":4,"content":"I like this brand because it isn't apple or the tiny buds that fall out of your ears. These fit but I do wish it had the wings like the Indy that stay in the ear better. The sound quality is amazing but you do need an app to maximize the features. I am happy with it and the wireless charging is nice. The other downside is the batter indicator light is a single blinking light instead of the 4 lights on the Indy. I recommend these and make sure to get the anc because without it these aren't worth it. The anc is good and can cut down 95% of my vacuum cleaner noise.","timestamp":"Reviewed in the United States April 5, 2024","profile_id":"AFCGCVTEWX3VTCXKA6BTU27WEMTA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2JN0ATBMRN5IQ","title":"3.0 out of 5 stars Decent but one obnoxiois problem that adds a few other problems.","author":"justin","rating":3,"content":"Unfortunately the design on these don't stay in your ear. It will constantly fall out your ear everytime you move or make a facial expression it starts chipping away out your ear.Not only that cause it falls out your ear alot you have to readjust it to push it back In and the annoying part about that is the ear buds are touch sensitive meaning they habe touch sensitive buttons. So just touching the dumb earbuds pauses the audio or goes into this annoying voice announcer about switching into some kind of Spotify mode or something.It ends up being like you're dealing with a annoying misbehaved kid while you're trying to enjoy any peace time. It's just a hassle to use them.Other than that it would be a solid wireless ear buds if it weren't for these issues.I like that when you turn them on it tells you how much battery life it has.It has light indicators on the charger to let you know how much battery is left.You can add bass on the app with the app adding other customizations.I will say I'd like it if the volume was a tad bit louder than it is but again other than that it would have been a good product without the mentioned issues.","timestamp":"Reviewed in the United States March 24, 2024","profile_id":"AFMBE3QKIEVWF65EAIWXJ5RFPKEA","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RG5HJZGK1CKR","title":"5.0 out of 5 stars Great ear buds (RAIL ANC)","author":"Dustin Vollmer","rating":5,"content":"Great bass, awesome sound, long battery life and the ANC is actually pretty good. For the price, you can’t go wrong.","timestamp":"Reviewed in the United States August 14, 2024","profile_id":"AE5DEWGEMCICWTRVGULW7MQQSLEA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1H38HUGMY1D7R","title":"5.0 out of 5 stars GREAT WIRELESS EARBUDS","author":"Tim J. Quass","rating":5,"content":"If you want a lesser expensive earbuds, these are comfortable, high quality, sound amazing and I honestly would buy these over the other high priced brands","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AGK4DZIJHF27EKWQNRPV5E3JLPMQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:12","page":5,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=5","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=6","asin":"B0B75RL6JX","page":6,"pages":66,"reviews":[{"id":"R1X4SIKA3JEK6U","title":"5.0 out of 5 stars I can't go back to regular earbuds","author":"leandra boochoon","rating":5,"content":"Absolutely loved my purchase! The sound is so clean and crisp, unlike anything I've ever used in the past.","timestamp":"Reviewed in the United States August 13, 2024","profile_id":"AGQZ2P74SXXHRFURFCU6TUWMVFBA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R2QEF12KADE7MH","title":"5.0 out of 5 stars Awesome Bass","author":"Jeff","rating":5,"content":"Most headphones and earbuds lack any deep bass and can sound tinney at best. I have a pair of Skullcandy headphones that have exceptional bass with great highs and midranges. So, I thought, lets try the earbuds. I was blown away by the strong deep bass and again, exceptional sound quality. The app gives you the ability to further enhance your sound quality. So, if you are looking for quality sound with that strong deep vibrating bass, these earbuds work perfectly.","timestamp":"Reviewed in the United States July 7, 2024","profile_id":"AHSZD4F27Y2Q6NRREYREZUJO3WJA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RPLBU72H6YNS7","title":"3.0 out of 5 stars good sound but bad mic preformance.","author":"Brian Jacob Johnston","rating":3,"content":"This is a mixed review for me honestly . I like skullcandy for the audio quality and loudness, but when i make calls only some of who i call hear me well even with the ANC active.","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AEVPRBU5EBILSM7LQHBYB5JSEITQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R19BOR1CENEAAM","title":"5.0 out of 5 stars Had em for a week","author":"Jeff Herrera","rating":5,"content":"So far they sound great. Nice and clear sound. Decent bass. App has an adjustable eq so you can fine tune. Charges fairly quickly. Had multiple different brands and never had an issue with skullcandy. Hoping they deal well with every day wear and tear.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AGFQAFQ4KMLKZBH7VHSB5X2SFDFQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2YFHCB9MKLK3N","title":"3.0 out of 5 stars Not free returns","author":"J.P.","rating":3,"content":"You have to pay return through Skullcandy. One of the ear buds didn't work and they wouldn't exchange through Amazon. We had to pay to ship then back to Skullcandy but they did offer a generous exchange budget to buy new ones through their website.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AEYUK7LB6TNTWUYF6UVYXR7SBV3A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R3FNYRWYWKQQ9P","title":"5.0 out of 5 stars Great product!","author":"Sur","rating":5,"content":"Amazing value for the price! I’ve been using it daily, and it hasn’t disappointed me yet.Very satisfied!!","timestamp":"Reviewed in the United States August 13, 2024","profile_id":"AHIXZF3QOGNDOMBXB6YLDXYKIRIQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RM0PZSP8UUTJO","title":"3.0 out of 5 stars I like them but the battery life isn’t the best","author":"Ashton Denton","rating":3,"content":"I really do like them. Although they require a whole different Skullcandy app than the Indy evos do. And the battery life isn’t the best. I’ve used the ear bud for little over an hour, when I put it in, it was at 90% and now it’s saying battery low. I liked my almost two year old Indy evos more. Maybe with more use I’ll like these better but the actual ear bud life isn’t the best.","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AERTMWYF7L6VYYONB6PHMALD2BZQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R1TTJRBTPCL3Z","title":"4.0 out of 5 stars Buen sonido","author":"Alberto perez","rating":4,"content":"Cancelación mala. Mejor compra el no ANC.","timestamp":"Reviewed in the United States June 22, 2024","profile_id":"AEPXQF4PFS266R7CRKGD7OEZ2IKQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RGQNXQ1RVQN8E","title":"5.0 out of 5 stars Better than Air Pods","author":"That guy","rating":5,"content":"I’ve used Apple AirPods for yearssss now and I and super impressed with the skull candy Rail ANC. I probably won’t ever go back to Apple ones and the app is super easy to use and I love how easy you can customize these to your personal liking I give it a 10/10!","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AHHMGNP6776L7PWW4TBZGHCU3FPA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1LPI2KFYOG11G","title":"4.0 out of 5 stars Great For The Price!","author":"Jared Morgan","rating":4,"content":"The Skullcandy RAIL's offer a mix of impressive features but still has a few limitations. The Bluetooth connectivity is exceptional, ensuring a seamless pairing process, stable connection, and quick reconnection. The device excels in battery performance, boasting extended life and rapid charging capabilities. However, it falls short for gaming enthusiasts due to noticeable latency issues, impacting the overall gaming experience. Additionally, it's worth noting that the Skullcandy RAIL's do not have in-ear detection. Despite these limitations, the Skullcandy RAIL remains a strong contender for those prioritizing top-notch audio in their daily activities. What makes it even more appealing is that it offers these features at a great value for the money.","timestamp":"Reviewed in the United States March 6, 2024","profile_id":"AF7OR7OPG7TSZ242HTS3UNY6IIHQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:13","page":6,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=6","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=7","asin":"B0B75RL6JX","page":7,"pages":66,"reviews":[{"id":"R2FOQ25BAK8IX0","title":"5.0 out of 5 stars Great Design","author":"Kindle Customer","rating":5,"content":"These are worth the price. Whether using as earphone or with noise cancelling. Work amazing.","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AHI47AZQ2HJ6YWBU4KDLWZIOJIJA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3F7LCNY6XXJYL","title":"5.0 out of 5 stars Solid product it sounds great with bass boost. I like this product","author":"Drableques","rating":5,"content":"Well tell you the truth it says it has options in my knowledge this sounds like skullcandy rail was exciting","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AG4SV7KS47CI6PAM23BVYPK4NDKA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1HXXBPBFA8RTK","title":"4.0 out of 5 stars Surprise !!!","author":"E.M.","rating":4,"content":"Wow, Easy to use, good looking, less expensive than I-crap, & other $200 buds etc. .... Give them a try, you'll be pleasantly SURPRISED !!!","timestamp":"Reviewed in the United States May 16, 2024","profile_id":"AG36RTTW7RPP3TUXV2U3AEH7TCGQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1PC8KAJGKNLRX","title":"5.0 out of 5 stars Buen producto","author":"Hernanvenezuela","rating":5,"content":"Alta calidad... Original... Llego en buen estado funciona correptamente... Recomendado 100%","timestamp":"Reviewed in the United States August 13, 2024","profile_id":"AHQB6ZPL64BUF25Q622L7MBH6IRQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RN9XO8R0A8OI","title":"5.0 out of 5 stars Amazing Bluetooth","author":"Amazon Customer","rating":5,"content":"This has been the best Bluetooth that I've found that is clear, ppl can hear you without background noice","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AEBVAX6Y447XF4OPPXR2YHI2TRMA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R39UIXWR7QONVC","title":"4.0 out of 5 stars ANC is a joke","author":"Bad choice","rating":4,"content":"Great earbuds but the active noise cancellation is a joke","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AHB6KC6D4LBJXA72JIWIUARMFQHQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3IA0IA7LYZPSP","title":"3.0 out of 5 stars Get it on sale.","author":"Nicholas Hunt","rating":3,"content":"First pair had to send back cuz one wouldn't charge. Second set one only charges part way. Cool that they sync to dual devices. And voice control is nice. Sound is alright. But not worth full price.","timestamp":"Reviewed in the United States August 9, 2024","profile_id":"AE5DLXIFUFFSES42BHLKQXBOZQJA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R2E2L5H3BDFLY5","title":"4.0 out of 5 stars Definitely worth it!","author":"Kortney Collins","rating":4,"content":"I've been using the Skullcandy Indy Anc's but since I lost them I've switched over to the Rail Anc and it was worth it. The case, for starters, is more beautiful and distincable than I thought it would be with the glossiness at the top and and blue led light on this inside. The sound quality was good but I had higher expectations for the $100 I was spending. My only complaints would be the fact that they are a little too slippery in my ears so they're sometimes on the verge of falling out and the connectivity issues that I experienced with the Indy Anc. Overall an amazing set of earbuds to grab if you're looking for something reliable.","timestamp":"Reviewed in the United States February 2, 2024","profile_id":"AH2LXL4RUCVVTBW3ZVXPERFG4KDQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R29E5DQ3BLLTBZ","title":"5.0 out of 5 stars Amazing for price","author":"Vickie Tesch","rating":5,"content":"I've used airpods pros 2 for a while and decided to try these out, these sound very close to those but with more bass and a really fun app. These are some of the best headphones I've had and will definitely be my pick from now on","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AEKIKJGGEHHYKSLERBA25YMRW3GQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"RHZ2EBQ29ZX6F","title":"5.0 out of 5 stars Great for the price","author":"JJ Cunning","rating":5,"content":"I've been a Skullcandy user for almost 20 years. I recently purchased and love them, the app is simple, syncing is easy. Sound is great, talking on call is good, voice command is awesome and I love the 2 ways your able to charge the earbuds. Definitely great value and Quality for what you pay for. I also love the way the look. The battery life is amazing. I've used them at work, the gym and pretty much all the time. My only critique is making them fully waterproof but are at least water and sweat resistant.","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AFQ3VIS3KNIPQRXAFBNUXNQEJ2EQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:14","page":7,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=7","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=8","asin":"B0B75RL6JX","page":8,"pages":66,"reviews":[{"id":"RLXFY8SZH6LDM","title":"5.0 out of 5 stars Effective noise cancelling at low volumes","author":"jewelspot","rating":5,"content":"Surprisingly good noise cancelling even when volume is very low. Neighbors have horrendous large barking dogs they do not control, these cancel that noise out, without having to blow my ear drums out with volume so loud. The bass is really strong too. I also like the app that has various settings for headphones, I am a bass head so I appreciate the pre-set equalizer that enhances bass. The only con is battery life is shorter than some other brands, but I'll take that for the much better noise cancelling in this price range. Great option for this price range.I tried Anker noise cancelling ear buds, but they really could not compete with these as I had to have volume up almost max for same noise cancelling effect. At that point its merely just the louder noise blocking another less loud noise versus noice cancelling.","timestamp":"Reviewed in the United States May 12, 2024","profile_id":"AEP4M5FH4BC6VMHZMVVEORHXBK4Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2J0E49ZOBOMD9","title":"4.0 out of 5 stars great earbuds","author":"carlos castillo","rating":4,"content":"had them for about 3 months, lost them so bought another pair, very comfortable, great sound quality, great bass, amazing customization. only thing bad about them is sometimes they have trouble connecting but other than that amazing","timestamp":"Reviewed in the United States April 30, 2024","profile_id":"AHP3MLIL63BS7TAZ6ZF3WTJBZUAA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R2MDL9G9EYNPGH","title":"5.0 out of 5 stars Great earbuds","author":"D Lockwood","rating":5,"content":"Perfect for listening to music while I work","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AFNC323XMCSYQ3MK4JUYKTIXGVDQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1MLYZDVIHTLQY","title":"3.0 out of 5 stars Decent","author":"James Hunter","rating":3,"content":"It’s alright, I bought it when it was on sale and I’ve had it for almost a month, and within the last week my left ear piece kept not working and somehow even when I cough the audio just disappears in my left ear piece which makes absolutely no sense to me. Makes sense why it was on sale, I honestly would not buy this headphones again if I had to choose.","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AF4ED3W52VQS3BSWHAEWSSBNHADQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R18X3QP71NQXGD","title":"4.0 out of 5 stars Great buds","author":"Todd","rating":4,"content":"The sound quality and fit on these are great. I wish the \"stay aware\" audio mode actually passed more ambient sound, but overall they're great.","timestamp":"Reviewed in the United States April 29, 2024","profile_id":"AHFVKY4PEUT3OBRJZPOEBDL4CA2Q","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1OPT007WAQZ1E","title":"5.0 out of 5 stars Skullcandy","author":"Slick","rating":5,"content":"Just awesome","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AHYZLUWAQRULCZZP7AFRHLE3TSAA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RJ5GQJWB1W6MS","title":"2.0 out of 5 stars Great sound with long bat life..horrible design.","author":"BriMan73","rating":2,"content":"First the pros: great sound with control in the iq app. Ease of changing tap response such as instead of one tap to increase volume you can change it to two taps. Charge is exactly as stated lasts a long time.Cons: unfortunately the cons outway the pros. DOES NOT STAY IN EAR WHEN YOU MOVE. If you want to use these in a cubical or laying down their fine. Start to move around and they start to fall out. Can't change the tips much to anything bigger which came with it or it doesn't sit in the charger. I've tried buying different tips but nothing works. If they won't stay in their useless. Everything I try to adjust them back in my ear it wants to open Spotify (which I don't use) and is annoying.I was so hopeful about these but now I regret buying them. If you looking for long last battery life, great sounds and control as long as they stay in your ear these are NOT what you want. Look elsewhere. So sad.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AG5USOLAUNUEXR7746LCF354QEWA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R16KF05EO8CYJ3","title":"4.0 out of 5 stars Pretty decent earbuds","author":"Cam Wood","rating":4,"content":"I got these for my son and he really likes them. I also tried them and thought the sound quality was pretty good and the anc pretty good. They're not spectacular and I was kinda hoping for more as my other son has some Skullcandy headphones and the bass on them is incredible.","timestamp":"Reviewed in the United States April 2, 2024","profile_id":"AFMCM3ECORVWNK2ZRJILWDSKPX3A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2HOUFNILOE1A3","title":"5.0 out of 5 stars Better than airpods","author":"Kelly","rating":5,"content":"OMG these earbuds are better than airpods. I highly recommend these headphones","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AG34SUONHYKF7ZRTKOVPA7XWYSRA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2ZSE3QH9B8J1I","title":"5.0 out of 5 stars Buy them","author":"Your Reviewer 👍🏼👎🏼","rating":5,"content":"The media could not be loaded. So I have noise canceling rail, buds, and non-noise canceling rail buds. They’re both really good the non-noise canceling ones. I got on a huge discount on their website. So I grabbed them. You’ll rarely find the noise canceling ones on sale so just beware of that because I thought I was ordering noise canceling and I was not.These are noise canceling your ears really really good. I move around a lot. I talk a lot and earbuds. Just do not stay in my ears. I have a weird shaped ear I guess. They don’t stay in my ears no matter what and these do and they work really good!Keeps the charge really really good. I’ve charged mine like twice since I’ve got them and I’ve had them for well over a month.","timestamp":"Reviewed in the United States May 11, 2024","profile_id":"AHW2WKDDHSK6E6PJK35RUA6DPUSA","is_verified":true,"helpful_count":16,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:16","page":8,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=8","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=9","asin":"B0B75RL6JX","page":9,"pages":66,"reviews":[{"id":"R1EM4D5AWEDFNF","title":"5.0 out of 5 stars The battery life is great, very satisfied.","author":"roy alexander pena","rating":5,"content":"so I've been using these for two weeks now and I'm very satisfied I mean they got great sound quality, great bass, decent microphone and they are very comfortable I personally use the small ear tips but they fit great. the touch controls are amazing and the voice control is really good the only downside about the earbuds is that you have to leave the skullcandy IQ app open if you want the voice control feature. oh and the battery life is awesome I can use these all day and charge them for a little while and then keep using them.but overall these are great.","timestamp":"Reviewed in the United States May 21, 2024","profile_id":"AESWUT4AFLDMIYB356TWBPCTHPYQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R214TSCMO5RZIJ","title":"3.0 out of 5 stars Mid sound mid performance.","author":"Mark Redding","rating":3,"content":"One of the ears is out of power 20% of the times I go to use these. Probably connection issues in the case. Not a fun problem.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AEN2KR6OSZKXIDFG4MH3ACEIGGFA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R13LXGHP1KEGA0","title":"5.0 out of 5 stars Love em","author":"Isaac","rating":5,"content":"I love them largest drivers in the earbud market","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AF33HXEYVYC27GBMSTZW4KWWHCMQ","is_verified":true,"product_attributes":"Color: BoneStyle: Rail ANC"},{"id":"RWSDQCPLX990R","title":"2.0 out of 5 stars Downgrade from Indy ANC","author":"Eli","rating":2,"content":"Pretty disappointed in these, as they are literally a downgrade in almost all metrics from the Indy ANCs I have had previously. Sound quality seems fine, but that's about it. MANY connection issues including; The earbuds not pairing correctly sometimes, The earbuds will not disconnect or shut off when put in the pod, if the pod is not charged. The touch controls seem to require a random amount of touch/force to activate each time(sometimes a brush of hair will trigger it, sometimes a full pressed finger won't). The list goes on.Most of this could be excused, or at least justified by the relatively inexpensive price, except I have owned two different pairs of the previous model the Indy ANC and neither of them had these problems.TLDR: Worse product than the previous iteration for the same money. Womp womp.","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AFZFPSBDGQHEU3QLLAOMPLXDGEWQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R1HA7DY0QEQ4CV","title":"4.0 out of 5 stars Buy it for the sound, not the ANC","author":"Luis C. Diaz","rating":4,"content":"I have the first Rail earphones, and I purchased these to check them out. Soundwise, these are solid, and I like how they fit. If you can swap the ear tips for foam, you will get a much better sound and fit.The ANC and transparency are sub-par. I have similar-priced Jlab earphones with ANC and transparency that do a better job. I also have the Beats+ earphones, which are top-level on ANC and transparency.Although I like how they sound and fit, their main advertised feature, active noise cancellation, is not their most robust feature. Future firmware upgrades could make them better. These are all right, but buyer beware - preferably buy if on sale.","timestamp":"Reviewed in the United States November 7, 2023","profile_id":"AGD5UG3GIGHLQSXR2D44JMZSIBSQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2I0IQ3XB63SDZ","title":"3.0 out of 5 stars Found out I got sensitive ears and had a reaction to these.","author":"Ben Rakes","rating":3,"content":"Never knew I had sensitive ears, but had a reaction to these. Switched out the soft in your ear part 3 times with the same result. They work good","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AER4J44RP42MSGUKAHRUEO6CZY6A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R9A5XMRNIS5SM","title":"3.0 out of 5 stars Ok for the money","author":"mike hoban","rating":3,"content":"Decent play time. They could be louder sensitive to the touch they disconnected or stop playing when you adjust them in your ears. Don't love them don't hate them.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AEVFD6YVSOGCQQTOZLK23BXJ5Y7A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3C9ITFW7VFEYD","title":"3.0 out of 5 stars Not Compatible with Conch Piercings","author":"Elizabeth Juntunen","rating":3,"content":"The sound is awesome, the battery life is awesome, the ANC works really well. But these are so uncomfortable with a conch piercing I'm going to have to have to return these. I can't wear them for more than 20 minutes at a time in my right ear. The touch controls are also super sensitive so I adjust them and it pauses.","timestamp":"Reviewed in the United States June 25, 2024","profile_id":"AEDPUKZZRXEOQHH4OXIDW55XPCXA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R3GHVD40F9MWL6","title":"5.0 out of 5 stars Excelente","author":"TITO","rating":5,"content":"Me agradó todo, el sonido ,el control por voz lo fácil que es usarlos y la duración de la batería es excelente los recomiendo","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AHQUOR6KVUS4C24MBM2HXL552O6A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RV5UPOIE32IWD","title":"3.0 out of 5 stars Nice sound but...","author":"Pao Vue","rating":3,"content":"These are nice looking and sounds great but they don't stay in my ears. I always have to keep adjusting then to stay and they've almost fell in the toilet a couple times already lol. I'm going to have to look for new earbuds soon.","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AERXUXTWL3MS67NHX2UMLFS2MNRQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:16","page":9,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=9","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=10","asin":"B0B75RL6JX","page":10,"pages":1,"reviews":[{"id":"R6X3PZ138MC3D","title":"3.0 out of 5 stars Buen audio","author":"mateo auquilla","rating":3,"content":"El ANC FUNCIONA EXELENTE PERO cuando se activa el modo atención no se escucha nada","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AFYBHJLOLNFK5RQGWO5CXRXBB66A","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R2159V3AJJ4UEF","title":"5.0 out of 5 stars In love","author":"Kita","rating":5,"content":"Honestly I been using skullcandy since I was in middle school u can't ever go wrong with this brand in my opinion great quality and the anc and everything else is spot on voice control can get testy and sometimes not work however it's not to often just open app and it reboots it also I'm sure as technology advances these things will be fixed in future they r upgradable and all around one of the best earbuds to have quick warning tho the buds r silicone so if silicone makes ur ears itchy that may be a problem I personally have itchy ears my whole life with headphones but I get by and it's not a deal breaker for me however this is more for others that this would be issues with","timestamp":"Reviewed in the United States March 18, 2024","profile_id":"AFHBYDRL7IXLW5ZFHAFL22C6VFHQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R38TZJKDBJ00DZ","title":"3.0 out of 5 stars Great sound, uncomfortable if worn for too long","author":"Mosses","rating":3,"content":"The sound on these are very nice, clear and crisp and deep base. Unfortunately, after wearing for a couple of hours my right ear became sore. The next couple day it felt as though my ear had an ear ache! Maybe I have abnormal ears but it made these ear buds unusable for me","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AHX6IZ4O3LH4NKQSQTIUAGDYOULQ","is_verified":true,"product_attributes":"Color: BoneStyle: Rail ANC"},{"id":"R2E938IAQPNT6S","title":"3.0 out of 5 stars Not functioning properly","author":"Marcos","rating":3,"content":"I feel discouraged about this product since only the right side works. The left earbud turns off as soon it leaves the charging case. The problem might be because it’s not charging. Even though I feel something else is wrong with my left earbuds.","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AHL4EVTRITGWTRO6E6SVMQ6DKRWQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"R1YMM4G0EFRAEK","title":"4.0 out of 5 stars ANC is just an advertisement gimmick","author":"ABW","rating":4,"content":"Dont buy it if you are hoping that it have a decent ANC feature. Other than that it is a well rounded product.","timestamp":"Reviewed in the United States March 25, 2024","profile_id":"AF5K7RLXBML4LDLBODX3G2C5M2EQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R22R0HNR1KGIBL","title":"5.0 out of 5 stars Strong bass!","author":"jeannie","rating":5,"content":"Love these headphones! I didn't want to break the bank, but also wasn't trying to find something cheap. These are perfect midrange headphones that have a great bit of customizable sound settings in the app!","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AEGB7KMPFE3DCU6FEZUACFOHKVYA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RRZKYKJDBQDPR","title":"5.0 out of 5 stars excelentes audífonos","author":"Gustavo Rojas","rating":5,"content":"los recomiendo 100% buen sonido a un precio accesible buena cancelación de ruido y su app es muy buena y fácil de usar","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AET6O3H3ZF6A3PD3OMTODYIPK5IQ","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"R6BBSFYBPABHS","title":"3.0 out of 5 stars Overall they're pretty good","author":"Colter","rating":3,"content":"I was pretty taken off guard by all the features these had compared to cheaper older earbuds I've had, the features and everything are great, good sound quality. The only complaint I have is that the noise cancelation, ambient sound setting, and regular earbuds sound setting all sound exactly the same for some reason which was honestly a bit of a bummer because I got these earbuds for that feature specifically but whatever they're nice. They also look pretty cool.","timestamp":"Reviewed in the United States May 25, 2024","profile_id":"AFWWY47ZQQSUDXCHIX6K3WQJBVLQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Rail ANC"},{"id":"RJYA1H2VTETTN","title":"3.0 out of 5 stars Good, but doesn't charge in the box half the time","author":"HazelAnne","rating":3,"content":"They last a while when they do charge, but they often just don't charge when you put them in. It also connects to your phone while in the box sometimes.","timestamp":"Reviewed in the United States July 9, 2024","profile_id":"AEY6VEZCKZ4PC3IPW6RJQAHPBELA","is_verified":true,"product_attributes":"Color: BlackStyle: Rail"},{"id":"RMAQ6ZQTGIBI4","title":"5.0 out of 5 stars Muy buenos","author":"Senovio Muñoz","rating":5,"content":"Buen presio","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AECRG5UIPPWUOGJRLLSQ227XCW3Q","is_verified":true,"product_attributes":"Color: BlackStyle: Rail ANC"}],"page_type":"Question","asin_in_url":"B0B75RL6JX","product_name":"Skullcandy Rail In-Ear Wireless Earbuds, 42 Hr Battery, Skull-iQ, Alexa Enabled, Microphone, Works with iPhone Android and Bluetooth Devices - Black","parse_status_code":12000},"created_at":"2024-09-11 14:54:05","updated_at":"2024-09-11 14:54:18","page":10,"url":"https://www.amazon.com/product-reviews/B0B75RL6JX?reviewerType=all_reviews&pageNumber=10","job_id":"7239647396794223617","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-11 14:54:05","domain":"com","geo_location":null,"id":"7239647396794223617","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B0B75RL6JX","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-11 14:54:18","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7239647396794223617","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7239647396794223617/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7239647396794223617/results/1/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/2/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/3/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/4/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/5/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/6/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/7/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/8/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/9/content","http://data.oxylabs.io/v1/queries/7239647396794223617/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7239647396794223617/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7239647396794223617/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7239647396794223617/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7239647396794223617/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7239647396794223617/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7239647396794223617/results/10/content?type=parsed"],"method":"GET"}]}}