{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=1","asin":"B099TJGJ91","page":1,"pages":773,"reviews":[{"id":"R1VLF39D9VE7FP","title":"5.0 out of 5 stars Clear sound and portable","author":"Pia Sareen","rating":5,"content":"I'm absolutely loving my new Bose SoundLink Flex Bluetooth Speaker! Here's what I like:- Portable: This speaker is so compact and lightweight, making it perfect for travel, outdoor adventures, or pool parties.- Clear sound: The audio quality is exceptional, with crisp highs and deep bass that impresses every time.- Long battery life: Up to 12 hours of playtime means I can enjoy my favorite tunes all day long.- Stylish: The Stone Blue color looks sleek and modern, fitting in perfectly with my outdoor decor.- Microphone: The built-in mic makes hands-free calls and voice assistant interactions a breeze.What I like least:- None! This speaker exceeded my expectations in every way.This Bose SoundLink Flex Speaker is a must-have for anyone seeking a reliable, high-quality portable speaker. Its durability, sound quality, and versatility make it perfect for any setting. I highly recommend. Value for money.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AFJ5257WTRMSPHS5NSC2CVRXIJVA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Stone Blue"},{"id":"R2TB41OYEQ665X","title":"5.0 out of 5 stars Simply great.","author":"Jake","rating":5,"content":"I have thoroughly enjoyed my entire ownership of this speaker.Time of writing this review is roughly 8 months after purchase, having used this speaker practically every single day since. This was a replacement for a very well-loved but somewhat lacking B&O (P3?) oval-shaped speaker that inspired of few of my must-have features.My key requirements in purchasing a speaker at this price point were:- Punchy, solid bass, with high accuracy, clear playback throughout most of the volume range- Relatively attractive, understated, simple design with ergonomic and intuitive controls- Easily oriented for high quality playback in a variety of different situations (facing sideways, upwards, at angles)- Long-lasting battery without any obnoxious constant playback interruptions informing you of battery life remainingThis speaker delivers on all of these.The bass is incredibly clear, with no horrible warbling and distortion that’s very common with dozens of other similar speakers. The audio playback is very crisp and clear, with no noticeable quality losses. I’m sure it’s not perfect, but it’s more than adequate for 95%+ of people. Even at low volumes, the quality is still extremely high. There is a usable, enjoyable sound at every volume level.The design is simple, but handsome. It does not look obnoxious or out of place anywhere. It is just the right size, not too large to pop into a bag, and not too small as to have low-power drivers with poor sound. Very easy to transport. The squared design makes it very stable on most surfaces, but is still rounded enough not to get caught on things. The controls are very easy to understand, even the multi-device Bluetooth cycling and syncing. I have no complaints.The speaker works well for playback in nearly any position, especially when placed on a table or other nice playback surface. It can be placed facing upward, and the speaker enhances playback for all-around sound. When placed horizontally, the same happens for directional playback. Very impressive stability in a wide variety of situations. Some would consider the lack of a lanyard or string to be a downside for this point, but there is massive benefits to keeping this speaker on a surface.The battery life is incredible. Vastly longer than I had really expected for this speaker. With my personal usage (middle volume range, 2-3 uses a day for 30 to 60 minutes at a time), I usually recharge every 1-2 weeks. Not sure what exactly that equates to in real playback time, but I still find it impressive. The speaker will notify you at 20% and 10% battery level, which is exactly what I wanted. Many other speakers will interrupt playback at 75%, 50%, etc. I’ve not experienced any noticeable battery decay during my ownership, but I have only fully depleted and nearly fully recharged the entire time, with no “filling up” in between.Downsides do exist, but most are inconsequential for me.- The audible indicators that inform you of which device you are connected to can sometimes feel a bit sluggish, especially with long device names.- I feel the price point is still a bit on the high side for the value, but I feel I’ve more than gotten my money’s worth. I just like a good deal.- Volume occasionally spikes very high in certain scenarios when switching between devices, but is fairly easily turned down after a quick scare.I would highly recommend this speaker to anyone in the market for a speaker at this price point. This is an especially good deal on sale. If you’re still reading at this point, just get the damn thing on the way.","timestamp":"Reviewed in the United States May 4, 2024","profile_id":"AHZBIFMKWWZHILYEIYOSP4AIA37Q","is_verified":true,"helpful_count":255,"product_attributes":"Color: Black"},{"id":"R2LQYVEK3JWJW2","title":"5.0 out of 5 stars Great clear and powerful speaker","author":"LilliesofTruth","rating":5,"content":"The sound quality is absolutely exceptional, delivering rich, clear audio that fills the room effortlessly. Whether I'm listening to my favorite music, catching up on podcasts, or enjoying movie nights, the speaker amplifies every sound with incredible depth and clarity. The design is sleek and modern, making it a stylish addition to my home decor, and it is super portable, allowing me to take it along for outdoor gatherings without any hassle. Setup was a breeze, and the Bluetooth connectivity works flawlessly with my devices. I even got a cute matching accessory holder to carry it like a handbag. Worth the money!","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGER2OA4FJUBXTG4D47RSLLBPTMA","is_verified":true,"helpful_count":14,"product_attributes":"Color: White Smoke"},{"id":"R178SB5RANHLM7","title":"5.0 out of 5 stars Big Sound, Easy Connection, Small Size","author":"Jalapeño 023","rating":5,"content":"I’ve had this speaker for about six weeks and have only positive thoughts. The sound can blast through my house or back yard, it holds a charge, as since the first charge, I have only hooked it up one time. It announces how much charge is remaining and what it is connected to when you power it up. It connects quickly. I really enjoy the Blue Stone color. I have used it all over the house including at the end of the shower (not in the water as it is NOT waterproof). The size makes it easy to put in a bag to carry and it feels like it is well made (not fragile). I am considering buying another one because apparently you can connect them together within range!I bought it for $99 during Prime Days, but even at regular price $130 I think, it is a great deal. If I have any issues in the future, I will update this, but so far SOOOO GOOD!","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AF5LQJHZHDXWVQRLZQPO2FWKSBMQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Stone Blue"},{"id":"R3T58CJGN9U85E","title":"5.0 out of 5 stars This is the ONE!","author":"Bryan A. Currie","rating":5,"content":"I had a sonos that crashed out. Wanted to replace my portable waterproof speaker with something good. This Bose is amazing. Tough, durable, waterproof. Sounds amazing. Perfect for the dock on the lake or the board on the beach. My prior Bose speaker was finicky with connectivity, but this one connects immediately. No problems, long battery. Great value and excellent sound for the small size!","timestamp":"Reviewed in the United States August 9, 2024","profile_id":"AFGN4GW4C2QMSKXB576QGKU4VPSQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R2Y3WBHYS3U0M4","title":"5.0 out of 5 stars A premium speaker in a sturdy package.","author":"Reviewer MHM 3-5","rating":5,"content":"I bought this speaker because I wanted a way to listen to music while grilling in my backyard. I had no expectations of it being a “party” speaker or anything of the like.But my goodness. This speaker punched above the weight I expected and what reviewers claim. They say it’s good for less than 10 people. Probably true if in an enclosed space.Outside, standing in the corner of my backyard about 40+ feet away, the speaker volume is at about 60-70% and with the air conditioner droning on I can still hear this speaker, and the vocals are clear, the instruments are clear, and there’s even some punch of the bass. It’s so much more potent than I expected.I actually bought a second one (the one pictured) so I could utilize Party Mode and Stereo Mode, and then these are far better than they have any right to be. The bass shook through the house at about 40% volume, to the extent that my wife actually asked me to return one and get some noise cancelling headphones if I wanted to be blaring music all day. 😂So (for now), I’m obliging and returning one, but honestly, I don’t want to. One of these speakers are great. Two make a great portable stereo system.Now for the feature set. Key selling points for me were:1. Durability. It’s made of steel and silicone, is rated to withstand a dunk in water and dust. You can enjoy this in the yard, on your workbench, swimming, shower, etc. I live in high desert, and the wind blew over these speakers from a table to the ground and they didn’t have a single dent or scratch. Which leads me to…2. The device has sensors built in that detect its positioning, so the sound quality was maintained even if it’s on its back, side, or face down. None of the other products that compete in this segment offer that function to my knowledge.3. Unlike other products that I considered, this sounded good right out of the box. Anker (Soundcore) offers some great competition in this segment, but needs the EQ tweaked to shine. They’re not bad by any means, but I wanted things to just be simple. Power on and go without fuss. Bose delivered that.There are similar products for sure. Ultimate Ears will also let you pair two portables to create a stereo, but it lacked the intelligence that this speaker did.We already covered Soundcore. Tweak with the EQ, save some money, you’ll likely be happy.These speakers do often go on sale, and I purchased mine used (like new) and refurbished respectively. The “Used” unit was actually brand new from Amazon, broke the seals on the box and everything. Far as I could tell, the speaker just rolled around in someone’s trunk unopened before returning. The box had some cosmetic damage but no dents, broken seals, and all accessories were obviously also unopened.Refurbished unit came straight from Bose. Also came with all accessories and literature, just a box that was labeled “Refurbished”. Warranty on refurbished or new are 1 year regardless.I bring this up to encourage you to save some money, reduce some e-waste, and buy secondhand like I did. No judgments if you want to go new of course! But I got 2 speakers, one that was new in reality, essentially $100 off the set, and I didn’t miss out on anything in terms of product or warranty.$150 is pricey for a speaker, but $103 for a Bose speaker is not. Especially one that can literally go for a swim.Four criticisms I’d like y’all to know. First, compression above about 75% volume. Your bass will flatline above this point to maintain clarity of the track as a whole. In reality, that just means you go from a slightly warm tone to a very neutral tone of sound profile. No big deal unless you’re blasting EDM, Hip-Hop, the like. As I said, this little 20W speaker carries enough punch that 70% was more than enough to fill my backyard.Second criticism is no biggie for me, but worth bringing up for those shopping the competition. I didn’t want to fuss with an EQ, but competitors do have them to fine tune your sound. Consequentially, the app is basically useless beyond seeing your battery life and an option on how to do party mode (not required).Third criticism is truly a nitpick, but why do I have two apps for my Bose products? Why do I need one for headphones and one for speakers? Wish Bose would put all their portable speakers and headphones into one app. You could easily knock out criticisms 3-4 by just putting this speaker into the Bose Music app, like my QuietComfort Headphones, and this VERY speaker's big brother, the Soundlink Flex Max, is already there. Why the heck is the Soundlink Flex not in Bose Music, with a basic EQ like the others?Fourth, this uses outdated Bluetooth. No big deal. Pairs easily. But don’t expect to watch movies or game off of this. Latency is too high.Anyhow, enough of that. Go buy one. Or better yet, two. You won’t be disappointed.","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AH5F7QHDE5VKRAMBN43A5WPU4ADQ","is_verified":true,"helpful_count":120,"product_attributes":"Color: Black"},{"id":"R3N5UYTNS8D2V6","title":"4.0 out of 5 stars Small speaker, big sound, travel friendly","author":"jonathan lopez","rating":4,"content":"Got this lil thing for Prime Day for only $99. I’m not going to lie, I had low expectations and planned on returning it. After opening it and setting it up, I got to see what the hype was about. Took me a couple hours of listening to figure out if it was a bang for my buck or a waste of money.I currently have the first UE Megaboom that I use daily that I bought back in 2016. It’s loud, has bass and can fill a room. Sadly, the charge isn’t exactly reliable so I was looking for something new. The Bose Link Flex definitely has a great quality sound. It will definitely fill a room. I like to use mine in the shower and acoustically in the shower the bass just sounds amazing!! Speaker actually fell off the shelf from the bass and survived the fall.Now, I listen to just about every genre of music. I found it to sound best with Latin music. Vocals are super clear. When it came to rap music (or music with lots of bass) I found it to sound perfectly balanced when the volume was at about 75%. Above that you’ll definitely still get volume but the bass will take a seat back. I’m used to the UE Megaboom that has 360 sound. While the Bose Link Flex will fill a room, the sound seems more straight forward depending if you want to stand it up or lay it down.Bose App is decent. Doesn’t really have any equalizer setting on there if that’s what you’re loooking for.I got this because it is small enough to pack in a carry on and not take up too much space in my bag. Might I add, it’s almost the same size as my iPhone 14 Pro Max . I can easily carry both in one hand. Easy to say, I’m going to keep this speaker with me. Now let’s see if the battery life is legit. I’ll check back in.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AF35A3ETTRWH62AWEWFQ2GO27VJA","is_verified":true,"helpful_count":26,"product_attributes":"Color: Cypress Green"},{"id":"R3ROA7AIPUTWTJ","title":"5.0 out of 5 stars Superior Sound Quality in a Compact Design","author":"Brandon","rating":5,"content":"The Bose Soundlink Flex Bluetooth Portable Speaker offers exceptional sound quality in a sleek and compact design. The speaker delivers rich, clear audio with deep bass, making it perfect for both indoor and outdoor use. The battery life is impressive and the Bluetooth connectivity is seamless. The speaker is also durable and water-resistant, ideal for taking on the go. If you want a portable speaker with premium sound quality, this one from Bose is an excellent choice.","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AFQ2RJJY4FMBW4LFKJTH4YCBL25Q","is_verified":true,"helpful_count":9,"product_attributes":"Color: Stone Blue"},{"id":"RTTQUD9NY9L3G","title":"5.0 out of 5 stars Way better than expected!","author":"Rich","rating":5,"content":"The last time I tried Bose speakers was about 25 years ago and I swore them off completely because I didn't like their signature sound. After reading all of the glowing reviews and watching many, many speaker reviews on YT, I decided to give the Soundlink Flex a try as a replacement for my aging Sony SRS-X3. I initially purchased the Beosound A1 (2nd Gen), which has superior mid and high sound quality IMO, but had to return because the it was very underpowered. Where the Flex can easily fill a 500 sq ft space, the A1 provided incredibly low sound at a distance of 15 ft. The Flex puts out more bass, if not more than the A1, and the bass offers more punch at lower Hz than the A1. The overall sound is great for the price but would be really nice if the app included an equalizer to help push up the mids and highs.Prior to purchasing the Flex on Amazon and trying to save a buck, I bought the Flex SE from Costco thinking it was the same product that was just repackaged. After 15 minutes of trying to use as a speakerphone, I finally figured out that the SE does not have a built-in microphone and therefore cannot be used as a speakerphone. So, I immediately returned the SE and bought the non-SE here.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AHWOBQMLF2N4Z4TCEPMHAL4ASVHQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R3TVEXDLBORXWI","title":"5.0 out of 5 stars 5 Million Stars!! ⭐⭐⭐⭐⭐","author":"Caitriona Gillespie","rating":5,"content":"OMG this is the best speaker which is not a huge floor speaker (over 1 foot high) that is part of a massive speaker system. The sound quality is truly impressive for a speaker of any size, & I think that if I bought another one, which I'm seriously considering, it would rival my Kenwood stereo system, which has two floor speakers that are over a foot high each, & the Kenwood amplifier, & the Kenwood 5-CD player. All that stuff is so big that it needs its own cabinet & takes up several feet of floor space. I don't know how the geniuses at Bose have done it, but they have somehow packed all that sound into a speaker less than half the size of a loaf of bread that is also a very appealing shade of lilac that goes with my décor. The Bluetooth connection works perfectly every time, even though I don't have the newest phone out there. I'm so in love with this speaker, the only complaint I have is purely aesthetic & easily fixed- the fabric loop attached to this beautiful lilac speaker is, for some unknown reason, an entirely ridiculous shade of brilliant orange, which clashes hideously with everything. I solved this problem with a dark purple Sharpie marker. That is the only complaint I have. While this speaker comes without any instructions on how to set it up, the set up is so easy, even when you're not a technology person, that I set it up myself with no help in under a minute. I plugged it in, turned it on, turned the volume all the way up- for some idiotic reason, it comes with the volume all the way down- & then turned on the Bluetooth on my phone & had it search for Bluetooth devices. My phone found the speaker very quickly, paired with it without issue, & started playing. One important thing to know is that when you leave the range of the speaker for an extended period of time, like when I leave for work & take my phone with me, the speaker will turn that connection off, so that when I get home & want to use my speaker again, I need to go over to the speaker with my phone & push the power button once. The speaker will say how much battery power is left & that it is now connected to my phone- I don't turn the Bluetooth off on my phone when I leave the house. I recommend turning the speaker all the way up & then controlling the volume through your phone, which is what I do. I think that's the easiest way to do it. One charge of the battery lasts a long time- at least 12 hours, so that part's great as well. Just buy it already, you won't regret it. It'll beat the pants off of all of your other speakers, even if you already have a nice set of Bose speakers.","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AGKOCRUHY2FG2ZHWTZRUH5JYIFBA","is_verified":true,"helpful_count":26,"product_attributes":"Color: Chilled Lilac"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:29","page":1,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=1","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=2","asin":"B099TJGJ91","page":2,"pages":773,"reviews":[{"id":"R2TT1UU35P8I2W","title":"4.0 out of 5 stars Surprisingly loud, no EQ controls, few caveats","author":"Jacob Teeler","rating":4,"content":"Bought this for work (I run a forklift and JBLs just arent loud enough) and was pleasantly surprised by how loud it gets. Sound quality is fantastic at all volume levels, its durable and holds up pretty well to the elements. The battery does genuinely last a full 8-10 hour shift playing constantly. A few things to note however.There are no EQ controls for it. Sound is well balanced but theres no bass boost, treble, no nada built in.The app is unnecessary once you get it set up with your device, really only need it to check the battery. The speaker will tell you what its battery percentage is if you turn it off and on though.Max volume is entirely dependent on the device its paired to. If i pair it to my PC, max volume is pretty quiet. If i pair it to my buddy's phone it gets pretty loud, but nowhere near as loud as it is paired to my phone.Volume controls are independent from the device and speaker. You can turn your speaker volume to max but your device is the primary control. So if you have the speaker on low volume and your phone all the way to the max, it wont be as loud as both at max, and vice versa. Its very odd.It does not remember the bluetooth volume of the device its paired to, so if you turn it off and use it the next day, it has a habit of being at full blown volume by default. Just be mindful.Other than that, its excellent and no one will be disappointed by it.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AHEGWVGORT2NYKVPVFMFBFDUYI7Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"RPGQ38IJUG9YG","title":"5.0 out of 5 stars Sounds really good","author":"Scorpion E","rating":5,"content":"Bose has an acquired sound and I love it! Coming from multiple Bose headphones and older speakers, the soundlink doesn't disappoint processed or not. Some don't like it. I love it. Just like all my previous Bose speakers the quality is top notch. Bluetooth connectivity is super stable and easy to setup. Perfect size and weight for travels. Every button has a positive click. Everything about it screams high. quality. Just A quick note about the battery'sperformance., I've played the speaker for more than 12 hous straight on medium volume. Battery level still said it had 10% left great value. The only thing I wish was for anotherdriver for a stereo effect. Not a big deal though. I usually just leave it in a corner and let it do its magic.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AH5ELZEOMIWHECBJ5U7OAFSSDGFA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3OU0P95XIL20O","title":"5.0 out of 5 stars Amazing Speaker","author":"Shashank Shekhar","rating":5,"content":"I have one Alexa echo that is scheduled for morning and evening routines doing amazing job, got this speaker for taking up meetings as it has microphone as well, listening music, connection to FireTV, all amazing. It's my first Bose product in Life and I am very much impressed, I usually use for 2 - 3 hrs a day and once charged, battery last up to 5 - 6 days, type C cable charging is fast. Sound is amazing so is the bass. Inactive duration to 5 or 10 minutes in Bose Connect App boost Performance by switching off speaker when not in use for Long, and price on offer goes Value for Money.","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AGKQIENLTSDGFHJF6VNBGHTGVDGQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3PQFUOLSJBHRB","title":"5.0 out of 5 stars Bose quality","author":"Tenkiller","rating":5,"content":"Bose has been one of the gold standard in sound for decades. So it’s not surprising that they pack a lot of quality into this little speaker. For one thing, holds a charge a long time! And it announces each time it’s turned on how much charge is left. No guessing. The sound quality is really decent for the size of the speaker. It can get very, very loud, if that’s your thing. It has a bass booster that I usually leave on. I appreciate that it is water resistant as I take this into the bathroom, the kitchen, camping, etc. It paired readily with my iPhone. There are some other features I haven’t played with yet, like doing my Teams meetings with it using the onboard mic, but I suspect it will be fine. If you are looking for a reasonably small Bluetooth speaker with a big sound without breaking the bank, give it a try.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AG4KHYIUPQPNTJR7JU5GD7DGV7QQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Cypress Green"},{"id":"R5B40RH01FWBR","title":"5.0 out of 5 stars Excellent sound quality, great for outdoors activities, and at a fair price, too!","author":"blair","rating":5,"content":"Perfect for a picnic at the park, day in/by the pool, or a beach adventure. I use it indoors all the time too--especially to sing along to my tunes in the shower (love that it's waterproof so I don't have to worry). Solid battery life, too. Bring it to your next social gathering, maybe even get a communal streaming playlist going (I use Spotify's Jam Session function), and just have a blast with the background soundtrack that you deserve in your life!","timestamp":"Reviewed in the United States September 4, 2024","profile_id":"AGQEGD4G2HOMGAD2QZNVW7EYTE7A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1JSRE6SH7YE46","title":"5.0 out of 5 stars Good sound, solid unit, but CONNECTION difficulties to know","author":"Dexter Haven","rating":5,"content":"You may have trouble getting this to play sound from you desktop computer, as I did. The unit misleads you by saying you need to download the app 'Bose connect'. I tried to, but could not get it to download from the App store or from the Bose website. Other Bluetooth speakers connected automatically for me, so this was a hassle. I tried to chat with the Bose help bot, but it was of no help; the lady on the phone at Bose tech support was of no help and disconnected mid-sentence and didn't call me back. I tried to return the item on Amazon, then saw a troubleshooting video. Open your 'systems settings' on your computer and select 'sound'; click the Bose option for speaker 'output'. For some reason this Bose unit doesn't default as the output as other Bluetooth speakers did on my computer. Then you should be able to hear it.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGMDFCAFNSOMPAQOPYPJSNKY2HGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Stone Blue"},{"id":"R3GTJEUFZD2385","title":"5.0 out of 5 stars Excellent Sound and Volume","author":"George K","rating":5,"content":"I am impressed with this Bose speaker. Deep bass and clear high notes. Battery plays for a very long time. It can play for 2 hours and still have a 75-80% charge remaining. Connects every time to your phone and announces the battery level. The soft rubber outer case absorbs any shocks or drops very well. I’ve had Bose products for 20 years and have been satisfied with all their products. Great value and easy to use.","timestamp":"Reviewed in the United States August 31, 2024","profile_id":"AHHX2R45PN4X67PGTD7PPLBMVPAQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R13TYQLVUD6BW9","title":"5.0 out of 5 stars Good Bluetooth speaker.","author":"NYC-lady","rating":5,"content":"Bought the white smoke. Sound is good.Used with iPhone & Laptop. Definitely improves the sound and can play loudly if needed. I enjoyed with music, talk radio & movies on laptop. It’s a little heavier than expected but worth it to hear good sound. Also nice that the rain didn’t ruin it. Suggest the light color if you use in the sun. I feel like the black might get to hot.Ps I needed to also use the sound keys on the keyboard of laptop to increase the sound more. It looked like it was on loudest on the screen & on the speaker but it wasn’t.","timestamp":"Reviewed in the United States August 17, 2024","profile_id":"AGTHSKIOHMPV7ZLDJYB3BXEYNXOQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R2NW2TXGJH7D82","title":"5.0 out of 5 stars Good sound from a not so big speaker","author":"John ski","rating":5,"content":"I already had a couple of bluetooth speakers, one of them sounds awful so I thought I would buy a Bose and see what I thought. The audio quality is absolutely better than the other two I have. I frequently find myself bringing the Bose with me into a room that the old speakers are in instead of listening to one of the other bluetooth speakers I have. The audio is so much better I don’t want to listen to the others I have. Now the price is 3 times more but YOLO, so.","timestamp":"Reviewed in the United States August 18, 2024","profile_id":"AEHRJ5ANPZCJ7YT6YW5L3BWPEUQQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Cypress Green"},{"id":"R1FOENHI4L5MDI","title":"5.0 out of 5 stars Bose","author":"redraven13","rating":5,"content":"It’s a Bose, a review is really not necessary. I Love it. I own a few Bose products, and not dissatisfied with any of them. Great sound balance, not flooding you with Base, but it’s definitely there. Just brought it camping and it awesome. Caught a few baseball games and it sounds great with XM Radio. Will continue to buy Bose.","timestamp":"Reviewed in the United States September 5, 2024","profile_id":"AFTNW7OXUCY7RSOTDZ5UO7FKGCCA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:31","page":2,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=2","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=3","asin":"B099TJGJ91","page":3,"pages":773,"reviews":[{"id":"RK883MX8LWVAN","title":"5.0 out of 5 stars Great sound in a smart, attractive package.","author":"Bruce C. Moore","rating":5,"content":"Wonderful sound if you want/need something small and portable. Covers the full range with clear treble, mids and bass, nicely dispersed. Put it anywhere and it is capable of delivering a good listening experience. Dust proof, water proof, it even floats. Come on! It does a great job of taking good sound wherever you want to go. No video because whatever device you're using to read this already show what it looks like, but in most cases it won't do justice to the sound it puts out.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AEI6DX7M6TUCQKM7M435POO3IUMA","is_verified":true,"product_attributes":"Color: Cypress Green"},{"id":"RJE5OLXRUQ60K","title":"5.0 out of 5 stars Good clean sound.","author":"Greg","rating":5,"content":"Paired automatically to my phone/music with nothing required from me. Great clean sound if I'm playing quietly or blasting it while I'm working outside. No distortion, nice trebles and solid bases, accurate mid-tones. It tends to run through the battery a bit faster than I thought it would but, it has never been an issue. I'm glad I bought it and would absolutely buy it again. It's surprisingly much better than I thought it would be.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AHAZ7PYOIZDHWKN7IRVPTI2G4JIQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2VABNN5ANFQ8A","title":"5.0 out of 5 stars I’m hearing music like never before","author":"Alana Borum","rating":5,"content":"I did not have a great sound system to listen to my music on. Used to the quality of my car speakers, which are good but not great.This speaker is great. I can hear subtleties in my favorite music I couldn’t hear with my usual sound system. A few seconds in and I can tell this is a high quality speaker.","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AHQT3W6H2GLGPSWFS4YE35CSGIQA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2MAV4C6A149IH","title":"5.0 out of 5 stars great sound, easy to use","author":"Gailviolin","rating":5,"content":"I've had a few different bluetooth speakers and this one is by far the best. My last one was okay but had annoying flashing \"disco party\" type lights that took 6 pushes to turn off. It was hard for me to finally decide to replace since nothing was wrong with it, it just irritated me. This one has the best sound of all my speakers, easy use buttons, easy to set-up. Has automatic shut-off, which is a plus in my book. Basically, you get what you pay for, and this is worth it.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AGMV6S54ECLF76MRQLGULO77HSCQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Stone Blue"},{"id":"R2NDD8TK14618X","title":"5.0 out of 5 stars Amazing, clear sound!","author":"Kristen Garcia","rating":5,"content":"I was fortune enough to get this speaker on a lightening deal, but it’s amazing!! The sound is super clear. You can have multiple people connected to it, so you don’t have to do that annoying thing of disconnecting your phone every time someone else wants to use it. It’s small enough to take with you everywhere, but big enough to put out amazing sound! Bose is already known for their great speaker quality, and this one is definitely living up to its reputation!","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AHC6VCNNNWPOWFYMAU3OGQERLRIQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: White Smoke"},{"id":"R1EP4TS637TD8G","title":"5.0 out of 5 stars buy with confidence!","author":"Akumal Larry","rating":5,"content":"I have purchased several of the Bose portable speakers over the years. They have lasted, are well-built and provide surprisingly great sound. I purchased this latest speaker because of the waterproof and float capabilities. Pretty cool!FYI. My other portable speakers are still going strong after 5-7 years. Great products! Buy with confidence!","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AH4UP246WUA4RAXAZ6PTEPHNLZVA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2MLVPMTCERUY","title":"5.0 out of 5 stars Best small portable bose speaker ever!","author":"Lauren Burke","rating":5,"content":"This is our 4th Bose speaker that we've purchased. I bought this one to replace my Bose soundlink color 2 speaker that stopped working after a few years. I'm so glad I purchased it! It has waaaaaay better sound quality than the soundlink color 2 model! I was ecstatic when I plugged it in and heard how awesome the bass is and the volume level it goes up to is great! I'm excited to take it to the beach and the pool! I just received it in the mail today and wanted to let others know how great it sounds. Hopefully it lasts awhile! Buy it! You'll love it! I just ordered a hard case for it to keep the charging cord with it and to protect it when I pack it in my beach bag and suitcase when traveling. I love the stone blue color. I highly recommend this Bose flex speaker!!!!","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AH6PAONOIJTCWDHJBZNAVNICK7UQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Stone Blue"},{"id":"RAELRM15U6GVN","title":"5.0 out of 5 stars Sounds awesome.","author":"Zaphod42","rating":5,"content":"This was a present for my wife. We’ve had this for a couple years now and it works and sounds as good as ever. For suck a little thing it really makes a great sound. Bluetooth connection is easy and the battery power has remained excellent. You can play it all day without needing a charge. Excellent purchase.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AFIED2YTBFX3LM3U66KN5IO3YD2A","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R363RRXDDAFSL1","title":"5.0 out of 5 stars Amazing Bose speakers in looks, easy to use, and an awesome sound!","author":"Chris","rating":5,"content":"I LOVE these Bose speakers! I got two so I could do stereo sound. It has a “party” setting also. I have a wraparound porch so it stretches the sound out nicely! I like the rubber cover because I use them outside a lot! It was easy to pair it to my phone and to pair up the second speaker. Just follow the instructions provided! This was a great investment because I’m all about music 🎶 and good sound. I even listen to my podcasts using them. You can adjust the speakers either by the controls on the speaker or by your phone, which is really convenient! Even if I’m talking on the phone and want the conversation heard, it can come across the speaker! The USB/C charger cord comes with it. It charges very quickly! I like when you turn it on it tells you what the battery level is at and where it is paired to. These are the best little speakers with a huge sound that I have ever had! But then….it’s a BOSE!!!! The loop on the side makes it possible to hang the speaker easily too. That’s especially helpful outside on the porch where I have a number of hooks for hanging plants! I don’t have to worry about its stability, although it has a nice balance of weight to it just to sit it on a railing! If you like what I described, you will want to own one or more! It’s worth it!!!","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AG5JIIHBPOPFMX2ZVVWDWOPO4OMQ","is_verified":true,"helpful_count":16,"product_attributes":"Color: Stone Blue"},{"id":"R1SMNFQY0PT04M","title":"5.0 out of 5 stars Excellent speaker","author":"like2win","rating":5,"content":"This is a great speaker. It has great sound that plays. When you turn it on it tells you what the percentage of charge is left. It’s very easy to connect and play music. As soon as I turned it on it connected to my phone.","timestamp":"Reviewed in the United States September 1, 2024","profile_id":"AHNAHH2QXXPEQ5BDPTTN4X5M3UVQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:32","page":3,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=3","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=4","asin":"B099TJGJ91","page":4,"pages":773,"reviews":[{"id":"R3VNSDOKNA5BMQ","title":"5.0 out of 5 stars Rich sound quality","author":"MISC SHOPPER","rating":5,"content":"Love this not just for my music, but for audibles! Makes the whole listening experience amazing. Easily paired with my phone one time, so no matter what ap I’m listening from, it works without all the hassles like other speakers I’ve tried. Pretty blue, too. Kinda blends in any room. Love it!","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AGODHJY24O5GW53NY2ZW73RB73PA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RM8XKNWXW2JYF","title":"5.0 out of 5 stars BOSE for the WIN!!!","author":"Onile Stacey","rating":5,"content":"This Bose speaker does not disappoint! The sound is crisp and clear, and I love the bass levels; when that bass kicks in, it becomes a full-on party! The color is perfect, as it fits all of my periwinkle/lavender color schemes. I had no problem connecting my phone and my MacBook Air to the Bose app. I did have to go into my settings and change the output to the Bose speaker, but other than that, the connection is flawless!I recommend this speaker to anyone who wants superb sound on the go or stationary. Oh, and it holds a charge for quite some time. I love how it lets me know how much charge I have remaining and which device it connects to when I turn it on.This is a fun product and also use it for my massage work it really is a handy tool as well.","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AFDJQE4XDMVCR3MMLC2F3YAMJ5FQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"R1FMQ4N9K1V3ZR","title":"5.0 out of 5 stars Sound is great","author":"Mary Ann","rating":5,"content":"I love bose, this is my 3rd time buying soundlink speakers and they are great to pair with phone, good performance and solid sound, hopeful for a long charging battery life for hours of good sound system","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AHCTN2ICC5GKBLNZEMVM7VVH545Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1QRQ1TTDSTLFF","title":"5.0 out of 5 stars Great Speaker","author":"Timothy currier","rating":5,"content":"This speaker is amazing. Sound quality is unbelievable in such a small device. Customer support is great too. We had a problem with it and they mailed us a brand new one in no time.","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AGWXRTC535FKU7UIUK2QXBLQZBAA","is_verified":true,"product_attributes":"Color: Cypress Green"},{"id":"R9MBUHVTHYYML","title":"5.0 out of 5 stars Superb sound","author":"Patricia Forbes","rating":5,"content":"Received this speaker as a gift. I have 2 other portable dishes and while their sound is great, Bose is much clearer and surround sound is impressive for such a small device.Would definitely recommend","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AGHAVEENKAWQYHABTX5RTI3JT2KQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1NJVFBBSQHMJQ","title":"4.0 out of 5 stars Decent sound regardless of orientation","author":"Amazon Customer","rating":4,"content":"It was on sale. It was purple. It was Bose. Those were my reasons for purchasing, despite the reviews complaining about the voice prompts. I used the Bose Connect app to set it up, but I deleted the app afterwards. It was always saying the speaker disconnected even though it was still playing. The app let me turn off the voice prompts. Then I found the actual user manual online and discovered an alternate method:Press and hold + and - simultaneously until you hear “Voice prompts off.”It sounds pretty good, but I mosty use it for voice.It doesn't matter how it is oriented; it still sounds good.But the material that it's made of is messy. It picks up dust and dog hair way too easily. I am trying to find a good way to keep it clean.I think it's going to work well for me.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AHXBSFLODAFXN733X6TNRLBILMAA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"RZLFK0U17P3AL","title":"5.0 out of 5 stars FANTASTIC acoustics. Easy pairing.","author":"Owen Hewetson","rating":5,"content":"I listen to a variety of music from Country to Rock. The acoustics of this Bose is spot on. All instrumentation comes though nicely while the vocals are crystal clear. The drums of \"In the Air Tonight\", the guitar solo of \"Comfortably Numb\" and the vocals in \"Bohemian Rhapsody\" want for NOTHING.Half volume is more than enough for me in our lounge with the speaker on the far side of the room.I am a bit \"Technically Challenged\", but pairing the speaker up to my iPhone is a breeze.I can recommend without hesitation.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AFOHJOWNEYYE4JNELZNAYYDQ733A","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"R1Q81WO9WK27UF","title":"5.0 out of 5 stars Great sound, looks good","author":"Kristi Koechel","rating":5,"content":"Great sound, bought using discount on Prime Day but would have paid full price for this. Great value for the money, great sound and performance, connects to Bluetooth easily, stays charged, love the color!","timestamp":"Reviewed in the United States September 2, 2024","profile_id":"AGICDGBTDE32SN3ONRQDPHP2YFOA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2CLQB668O7RHB","title":"5.0 out of 5 stars Perfect for every day use!","author":"Bryan","rating":5,"content":"This thing is awesome, I got it in the green and it has woodsy vibes. The sound is amazing. I use it 2x a day in the shower as well as on my back sun porch. It packs the perfect amount of bass and the sound quality is superb with everything from pop, r and b, country, classical, opera, you name it. The battery life is good and the connectivity is instant. Very happy with it.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AHNJKX5B5IMJ43GFL4TJIHOXTEWQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Cypress Green"},{"id":"R22BP3UXW8MVME","title":"5.0 out of 5 stars sound quality","author":"Max","rating":5,"content":"I'm absolutely thrilled with this speaker! The color is spot on, and the material feels soft yet is easy to clean. The sound quality is impressively good, which was a wonderful surprise. You can position it on its side for directional sound or lay it flat for excellent, all-around audio clarity. Its size is perfect for placing on a desk, counter, or even packing in your luggage. The audio is clear and crisp, and it's waterproof, making it ideal for use in the shower. Charging is straightforward with a USB-C connection, just like most of my other devices. The buttons are soft yet durable. So far, I haven't found anything to dislike about it!","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AHBACXI2N3R5HP7LWWUEPXQB3XYQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Stone Blue"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:33","page":4,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=4","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=5","asin":"B099TJGJ91","page":5,"pages":773,"reviews":[{"id":"RV5O6PFBME3FH","title":"5.0 out of 5 stars Merry Christmas to my husband.","author":"El See","rating":5,"content":"He loves it. Uses it in his work shop to listen to Amazon music. It’s also our trip speaker when going to resorts to enjoy music in the room or on the balcony. We also occasionally use it on our front porch. It’s never being blasted so the sound quality is just fine for us.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AEF5UR7SVN3S6GAFH6XKQWW6WTTA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3F7JYC0PYH0JW","title":"5.0 out of 5 stars This a Great Buy and a Huge Value","author":"Bob D.","rating":5,"content":"My wife asked for another product for her birthday, but she saw this speaker on line. She came to me and said \"I know you ordered XXXXXXXXXX but I'm pining for this and is there any chance you could cancel that and get me this?\" I said the item couldn't be returned but I've got a bunch of points and we ordered the speaker. Very glad we ordered it! Sounds great! The only downside is the charging cable is too short; I just used a different cord.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AEWF5HEADBXML5O2C5EOIURMUTEQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2BLTAF363OQTJ","title":"5.0 out of 5 stars Amazing Sound","author":"Lynne","rating":5,"content":"This portable speaker is just what I need for pre-recorded accompaniment tracks for vocal solos. I purchased it to use for an outdoor wedding. Unfortunately, the wifi didn’t extend outside the lodge, so I wasn’t able to use the device as intended. I kept it because the sound for the size is amazing!","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AGFFAOOGZNTRXWXHVENLTZ5CRSXA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Stone Blue"},{"id":"R1V15QXTC1CXMA","title":"5.0 out of 5 stars Nice speaker","author":"Henry","rating":5,"content":"Pairing this speaker with my phone was easy. couple glitches but had it done in 10 min. Very loud, can hear it everywhere in my 1100sq ft home. Mainly I bought it for out on my boat. I can hear the radio even when my 90 4 stroke is full throttle. No buttons sticking out to break, this seems durable expect this will be in service for a long time. Battery life seem okay. Gotten it wet with no issue. Not going to water test it, will save that for somebody else. Yes, I would recommend it.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AE3KWAMUVSXDEQILGJTAR33SBJSA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1ILZYTTZJERMC","title":"5.0 out of 5 stars Amazing Sound, Build quality","author":"Mustakeem Nuruddin","rating":5,"content":"This speaker gets very loud perfect for outside use for picnics and such, also works amazingly well for indoor use i just got it the other day and used it while boxing at the gym. Heavy base songs also sound really nice on it so far.","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AE5Z6CVZSDZEZE545NIDF3QILOIQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R671UAG2XG874","title":"5.0 out of 5 stars Great sound!","author":"Jen","rating":5,"content":"This tiny speaker sounds amazing! Very impressed. Perfect for playing music and podcasts from my phone while I’m working around the house and I can hear better than my phone speaker.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AF6HCYZEP6W2VDCITDHN4GAWWZAA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R14IMD6ILHO41O","title":"5.0 out of 5 stars Love Bose","author":"Dianna Diaz","rating":5,"content":"Bose has always been up there when it comes to picking out sound. The quality is always high and they always last years if you take care of them correctly. I love that it connects to multiple devices, which is perfect for my classroom. Love the carrying case as well.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AECSJACZXQHDGRZLRDGHFEZ7RBKA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RWPJOORLGLZ7X","title":"5.0 out of 5 stars Good","author":"Vanessa castilla","rating":5,"content":"So far it has worked very well for us, the sound is good and the charge lasts a long time, the material is nice but not so easy to clean","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AEPB3FK2MX4G4X7IL3HIQWBO5XKQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RCN8ABJ1TO325","title":"5.0 out of 5 stars Great for Audible Books","author":"Zac s.","rating":5,"content":"This speaker is really good for listening to Audiobooks.Works well for casual party music by the fire outside.Works well for garage time working on motorcycle or truck.I would say, if you want a super bass speaker, this is not it. This is decent. Even for my ears, which I am hard at hearing. It's a nice looking speaker. Not too heavy. I use it mostly in the kitchen while I cook. It's probably a 4/5 there is much better speakers in the market. But, not for that price. It is a mono speaker on the right and a Support speaker on its left.If I could have changed anything about the speaker.. I would design it to be stero speaker. But I suppose I could just buy another and pair them together to get stero.","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AHY3MSBL4AB3SG7IX74XALOR76DA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Stone Blue"},{"id":"R2U1RS6DOVGNBD","title":"5.0 out of 5 stars Excellent sound","author":"Miles","rating":5,"content":"I love my Bose. It is light n have a powerful sound. I love to listen to relaxing music while I work around the house. A smart buy!","timestamp":"Reviewed in the United States August 31, 2024","profile_id":"AFMQP4VM55ONIZVYFCTZWRXPDY7Q","is_verified":true,"product_attributes":"Color: White Smoke"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:34","page":5,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=5","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=6","asin":"B099TJGJ91","page":6,"pages":773,"reviews":[{"id":"R11TUE6Y91ZTPI","title":"5.0 out of 5 stars Excellent full spectrum sound","author":"D Glass","rating":5,"content":"I use this mostly with my digital TV. It connects by bluetooth automatically. I have it by my livingroom chair and can hear my TV perfectly over all the apartment noises. The bass is amazing for such a small speaker, much better sound than the TV. It is my second one as I gave my first Bose speaker(different model) to my mechanically-minded son thinking it was broken. He figured out it was the charging base it sat on and not the speaker that was broken. He plugs it in directly (like this one)to charge and it works perfectly despite being 9 years old.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGVBSAPNFETY4MRIQX33J7NZCN5A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Cypress Green"},{"id":"R12UNY46UB24L8","title":"5.0 out of 5 stars Stereo or mono!","author":"Francisco","rating":5,"content":"I have 3 of these Bose speakers and I can link them all 3 in mono or 2 in stereo with the app “ Bose connect” for a crisp and and clear sound with good mid range and extraordinary bass for the size of the speaker. Superb sound indoors.","timestamp":"Reviewed in the United States August 18, 2024","profile_id":"AFAQZDQL3GTP2OFPOPKUXZMACQNQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"R3JFLPOAA6Q5NH","title":"5.0 out of 5 stars Bose water proof speaker","author":"Amazon Customer","rating":5,"content":"I love this speaker, so do the people at my swimming pool. Great sound, easy to throw in my beach bag and the charge last for more than a couple hours. When not at the pool I use it in my home, especially the bathroom. Great little investment!","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AH7NNYNSZNDUHQJXQJKFBUIS77UQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Stone Blue"},{"id":"R40DA4I7DUXLD","title":"5.0 out of 5 stars Sweet sound and sleek look","author":"Jean M Turner","rating":5,"content":"The sound quality is great, and I like that it has a good IP rating. Waterproof also means dust proof, so we can use this at the motocross track.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGJCA5DJRMSVSEUZMZMGGWELY6LQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2CSVHOD22SM6X","title":"5.0 out of 5 stars Great Find","author":"Greg","rating":5,"content":"Easy to use, connect and sounds fantastic. So far, the charging life of the battery is not 12 hours. It's more like 8-9.But its still worth the buy.","timestamp":"Reviewed in the United States September 5, 2024","profile_id":"AEXBZXKC2V7JVPXJFXWVNYIUF4QA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3FOPHNTFOCRT9","title":"4.0 out of 5 stars Good splurge","author":"Amazon Customer","rating":4,"content":"I have the original Bose sound machine for years and the quality is fabulous. I wanted some thing that I could take around with me. Didn’t wanna spend the money. Found this one and thought I’d treat myself. Glad I did can’t say that the sound is quite as clear, but it’s perfect for what I need","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGWOAWHXOCQOLCRXBFJXIB5Q6ZKQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R2JPRKJ2WZ70BW","title":"5.0 out of 5 stars LEGIT!!!","author":"Amanda S.","rating":5,"content":"This speaker is amazing… smaller than I thought it would be but PERFECT! The sound quality is amazing… deep sound. Absolutely love it!!! Bose for the win!","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AGU3MNI4256DPVSEH764ME3DLPOA","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"R1YRCHPCA2STP4","title":"5.0 out of 5 stars Small speaker Big sound","author":"Tony","rating":5,"content":"What’s not to like about this speaker. Great sound in a small package. The highs and lows air outstanding. I own several Bose products and a few from other well known brands. So I truly appreciate great sound reproduction. For the size, this is outstanding. I read other reviews that say not enough bass or treble. I believe you will enjoy this speaker for what it is. A small but great sounding speaker.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AH35HARRVML5DRKBBBVQ7OBEA7FA","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"RQALUUYJSIT6A","title":"5.0 out of 5 stars Portable Speaker","author":"Jose","rating":5,"content":"This is by far the best portable speaker I have ever owned. The sound quality is immaculate, with a bass that is incredibly smooth and buttery. I love it so much that I brought it with me to a small gathering. Even in a pretty large room, it played music beautifully, and people were impressed with the sound.Overall, this is a great speaker! It exceeds my expectations in terms of performance and sound quality. If you're looking for a reliable and impressive portable speaker, I highly recommend this one.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AEA76CNGB75445PR4RJJZF3BHM6A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Cypress Green"},{"id":"R1C19NHDR1VSJW","title":"5.0 out of 5 stars Best speaker I've owned","author":"Michael","rating":5,"content":"Compared to other 20 - 80 dollar speakers, these are so much more pleasing to the ears. I wonder how they compare to alternative products in the same price range. Bought at $110. So far, I've had a very good experience personally. Will update review as needed.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AFVQ25IS3DXN5JNVI3D73IQ5TKHQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:35","page":6,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=6","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=7","asin":"B099TJGJ91","page":7,"pages":773,"reviews":[{"id":"R233UOJQG7OJEP","title":"5.0 out of 5 stars Sounds great","author":"vsas","rating":5,"content":"I purchased this during Prime days to replace my last speaker. The new speaker looks great and sounds great. I am glad I chose this speaker.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHPRNOX2OGDFQOLZ2DCEIVFKUK6Q","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1OTAF9805WV1D","title":"5.0 out of 5 stars Love","author":"tmb0324","rating":5,"content":"I bought this during Prime Days!! Love it and got it for a good price! I bought the teal colored one and I love it! The sound is awesome.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AHJNNSXPA6WDJFVYRY242JUQUX5A","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2XROV4NTQCB9U","title":"4.0 out of 5 stars Wouldn’t connect; hold the power button for 10 seconds.","author":"K. G.","rating":4,"content":"Just got it, needed to download an app to get it to connect, dumb. Wouldn’t connect, had to hold down the power button for 10 seconds to reset it, then it worked with the app. Also deleted all other Bose Bluetooth devices, not sure if that was necessary or not. It sounds great!","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AEOILW77ONBBNKG7XU3C3L5OPQCQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RQ5NKF7TUKPUI","title":"5.0 out of 5 stars Awesome sound, sturdy build!","author":"Jun Mark","rating":5,"content":"I was in doubt at first because of how small it looks like, but don’t be fooled – this fella packs a punch! Sound signature is amazing for its size, no compression whatsoever even in max volume. Sturdy build as well, perfect for outdoor activities!","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AHKFPZCPIRGCG6ZMEISA3QP63ZIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1N3FUL4C0AV4T","title":"4.0 out of 5 stars 6always loved Bose products","author":"Joyce Trawick","rating":4,"content":"7/3/24 My Bose Sound link speaker was delivered today!! Just in time for the 4th of July picnics and outdoor music. I owned a Bose Soundlink I for years unfortunately it was locked in a hot car for 3 door before I realized I had left it there and it played a short whiel and died. I just got this one and the sound is even better!! It's a compact size and I chose the dark green color( something different from my white one) I listen to a lot of Biblical recordings and through the speaker it gives it a fantastic voice and musical entertainment. The price seems reasonable compared to other potable speakers and I am putting o n the list for possible Xmas gifts.","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AE7Z2L3KR5TQYFLXUB5HNUQATTPA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Cypress Green"},{"id":"R3UW7G8Y017Y2F","title":"5.0 out of 5 stars Good sound","author":"Amazon Customer","rating":5,"content":"Can be a bit boomy. I do think the older SoundLink has better sound, but this was a great prime day deal. Much better than cheaper speakers.","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AHXVJH2Q3G7ZVJP56AB3QTNWH6BQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R3CTEYAXVL0SGM","title":"5.0 out of 5 stars Great Bass at a Reasonable Price","author":"Jenna A.","rating":5,"content":"Love this little thing! So portable, and surprisingly bumpy base and clear sound. I'm a big Sonos fan and considered both of their portable speaker products, but in the ended, decided on the Bose SoundLink primarily because of affordability. So glad I did! Not to mention the color options are so cute - something for everyone for sure!","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AFO3PBLJ4UQFFPP634RVCRFHSOXQ","is_verified":true,"product_attributes":"Color: Chilled Lilac"},{"id":"R26IQPIOD6CKV1","title":"5.0 out of 5 stars The sound is wonderful","author":"Howie","rating":5,"content":"I’ve got a drawer full of wireless speakers, I didn’t need another one. The Bose beats them all in sound quality. Try it, you will like it.","timestamp":"Reviewed in the United States September 4, 2024","profile_id":"AFZE4XMNIQDGJXPHWYJ3TXEDN76A","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RCL6GMDG3AU8I","title":"5.0 out of 5 stars Great sound","author":"John P.","rating":5,"content":"This little box put's out some great music and you can feel the bass. I will only buy Bose from now on. WOW what a product","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AHO6SETWMSXQ2HOTDZOJFLVNZONQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1XNP6CE1QG0DK","title":"5.0 out of 5 stars Very Pleased!","author":"Kindle Customer","rating":5,"content":"Arrived as predicted and was easy to set up. Very pleased with the color I chose and the sound was perfect. The price was great also.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AEMSEN3YYX4VPPUBSZ66BBVDHYPQ","is_verified":true,"product_attributes":"Color: Stone Blue"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:36","page":7,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=7","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=8","asin":"B099TJGJ91","page":8,"pages":773,"reviews":[{"id":"R16WQ5AHX01IGV","title":"5.0 out of 5 stars Bose sound link !","author":"Linda M.","rating":5,"content":"Bose quality knocks it out of the park again. I love the new color and sounds great when linked to my other one I have.","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AEQODI77VVKH2CW6GKBOYKV75SJQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"RU34GUPT3K2Q","title":"5.0 out of 5 stars A-MAZING","author":"Amazon Customer","rating":5,"content":"I absolutely Love, love, love this portable speaker. The sound, bass and range are great, both indoors and outdoors. When it goes back on sale I am purchasing a second one!! my mom and two cousins want one now as well.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AHBIMXVX5LIZKYAOV3TPSTUVYT5A","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R3450LU6V0H3U4","title":"5.0 out of 5 stars Amazing Sound","author":"jselb10","rating":5,"content":"The party never stops with this speaker! Sleek and modern looking design. The sound quality is great and it's small enough to take everywhere!","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AE7U2UKGXJS2DOSLUFMFPGJJJFQA","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"RB6W9UDLYSTVH","title":"5.0 out of 5 stars Easy to use","author":"Deborah Rains","rating":5,"content":"Sounds great and easy to use for my technically challenged mom. You don’t need the app. Just connect to Bluetooth and power on and off.","timestamp":"Reviewed in the United States August 11, 2024","profile_id":"AEM6HYLVA2DEVHVOC7OR6GIR4N6A","is_verified":true,"helpful_count":2,"product_attributes":"Color: White Smoke"},{"id":"R327B4PQXF1ORN","title":"5.0 out of 5 stars Best ever","author":"Suzanne Solomon","rating":5,"content":"We love these small speakers. I have had Bose speakers for years but these are my favorite because they are small and my favorite colors!","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AEQ3URWVY75UQ2TGQMMBYJDH2MQQ","is_verified":true,"product_attributes":"Color: Cypress Green"},{"id":"R2OXD72R7LNTGC","title":"5.0 out of 5 stars Perfect sound in a small package","author":"justncase0611","rating":5,"content":"We all know Bose sounds great but for the money, this speaker rocks.Grab two of them and pair them together for bigger sound!","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AH47Z2JS3Y6LHKEML5WSRBMCCPSQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1S2R3URFI9T3A","title":"5.0 out of 5 stars Love it!","author":"Michele Keyer","rating":5,"content":"My Beats Pill died and I replaced it with this. Oh my goodness - I’m amazed at the quality, the sound, everything. I love it!","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AG2R32ZZJBPLAIITHHO2XAOMYY6Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RZKA2TAXTSBGQ","title":"5.0 out of 5 stars Great sound system","author":"Martin McGinnity","rating":5,"content":"WE LOVE THE SPEAKERS SOUND. EASY TO USE POOL SIDE. WE USE A MUSIC APP ON MY PHONE, THAT HAS LIMITLESS SONGS TO HEAR.","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AEPFQVMPXICCE4ZGVKLKKTR67HEA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R310CNRQ5ZPMHI","title":"5.0 out of 5 stars Bose speaker","author":"Sittersue","rating":5,"content":"I always heard that Bose was a great product. I am so happy that I got mine at such a great price. I love it.","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AH5X3L5ZEZHQW3CCY2ORJO2HOPXQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R25MEIJ7ITHXZK","title":"5.0 out of 5 stars Great little speaker","author":"Tracy","rating":5,"content":"I have been wanting a bluetooth speaker to have when my family and I are hanging out in the backyard. This Bose speaker sounds great and has really good sound quality in such a compact design. It charges quick and you can use it while it is charging. It is easy to connect or pair with a Bluetooth device.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AFKO53LMYACK3OKWWH2XECL6PGBQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Cypress Green"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:37","page":8,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=8","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=9","asin":"B099TJGJ91","page":9,"pages":773,"reviews":[{"id":"R3DB033JMKDSFQ","title":"5.0 out of 5 stars Best speaker ever","author":"Amazon Customer","rating":5,"content":"We've tried a half dozen speakers but Bose is by far the best. Easy setup. Long battery charge (10 - 12 hrs). Great sound!!!!","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AGFS2WORGQQ7ZEKMOMKHRCNZLTUQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2LQ5BYRTC6SKZ","title":"4.0 out of 5 stars Very good speaker","author":"Rodrigo L.","rating":4,"content":"Very good speaker. It is not cheap. It could be more cheap. The brand Bose add some value. I would like more power. At small room or at a table of friends is ok. At noise outdoor, like a beach, or gin, it does need max vol.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHTI7CJURCR3E6CFA4C3BNXAIROA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1CVP162HE2H63","title":"5.0 out of 5 stars Poolside Music","author":"rockinr","rating":5,"content":"We had2 JBL flip waterproof speakers and one finally gave out. They have wonderful sound. I decided to get the Bose because I’ve always wanted one. This sounds tremendous!! Nice bass. Battery lasts a long time. Try it for yourself you will definitely like what you hear!!","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AG6XT2BEBWHGASHZFHW7DRCFZELA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RMUYYKJ5WTA8Q","title":"4.0 out of 5 stars The sound is awesome but...","author":"HB","rating":4,"content":"It's a Bose so I expected high quality audio and the speaker does that. It's compact and that's part of the issue. It tips over very easily as the base is rather narrow. Second, the battery life leaves a bit to be desired. It's not as long as other speakers I have had but it's decent. I wish the bright white/blue lights were red or could be turned off. It gives off just enough light to be bothersome if you truly need a dark room to sleep. Forget using the app, all it does is connect and you don't really need it to even do that. It wouldn't control anything on this speaker. Lastly, why is it talking? I don't need it to tell me the battery level or that my device is disconnected. I don't need it to speak at all. It's rather annoying bc if you disconnect and don't turn it off, it promptly reminds you. Spooked the hell out of me several times. It gets 4 stars bc audio wise it's absolutely on point as expected. It's the little details that are missing that list a star. Would I buy again? With improvements yes, as is I'd have to think about it.","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AGRPNG4CNHIH5CUK2WGOP4EVFYJA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Stone Blue"},{"id":"RW19LAV7IG11T","title":"5.0 out of 5 stars Unbelievable Sound!","author":"Michael S.","rating":5,"content":"This product is phenomenal! It has replaced my current stereo speaker system! The bass is way better than I expected! Bose you have done it again! Keep up the great work you are doing! I like this thing! Thanks!","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AEG2C2M4RWRJSBBJY2VWZAXGLQ3Q","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"RT3YPMPSZGITR","title":"5.0 out of 5 stars Great sound","author":"JackieAmazon Customer","rating":5,"content":"Small speaker- perfect for what I wanted. Best sound quality from any speaker I’ve bought in the past took a minute to set up- had to reboot- but nothing hard. Best speaker!! Bigger than I was expecting!","timestamp":"Reviewed in the United States August 12, 2024","profile_id":"AGT5GAOUOAPKULJC5F5XT2TJWOJA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RXE60DKGSDE2U","title":"5.0 out of 5 stars Sleek design and great sound!","author":"Donya Davis","rating":5,"content":"I like the sound quality and how it projects from the sleek designed speaker. Considering the small frame it performs in a great way.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AGZH53W5TWH7X24YBX4Y72G6HI7A","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R4EH7D8EGR7YK","title":"5.0 out of 5 stars Great Sound","author":"Debra","rating":5,"content":"I was thoroughly impressed by the sound for the size speaker this is. It is a convenient size with a big punch! I am happy to report that the skeptic in the family was also impressed and I got the thumbs up on the purchase!","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AHFIG3QXGQ373AZ7XGQPUAY7ALDQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R1A0NC91DS3DYP","title":"5.0 out of 5 stars As good as described","author":"Tracy R.","rating":5,"content":"Personal use. Hand hang strap used to keep out of sandy areas. Sand and waterproof. Would recommend fir beach vacations.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AHWHDOXXTNT6QL7OXLEQAAQEUAQQ","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R2O7EM40HC5S5W","title":"5.0 out of 5 stars Great speaker","author":"Suzanne","rating":5,"content":"I had one in black and loved it so much. I had to buy this green one! It’s a great speaker with great sound and holes a charge for a very long time. Don’t hesitate to buy it!","timestamp":"Reviewed in the United States August 18, 2024","profile_id":"AGBFPYOFHE3DY2FASPM27TYBEHPA","is_verified":true,"product_attributes":"Color: Cypress Green"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:38","page":9,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=9","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=10","asin":"B099TJGJ91","page":10,"pages":1,"reviews":[{"id":"R36YHGL95K3QBJ","title":"3.0 out of 5 stars there’s a time and place for it!","author":"Steven Jerome Staten II","rating":3,"content":"I purchased this because water broke my old Bose Revolve+. I don’t consider myself an audiophile, but I do listen to music religiously — 100k+ hours annually — and I can appreciate a crisp sounding speaker with nuance. This speaker lacks the nuance. It’s not terribly loud in my opinion, even on full volume in my small apartment. However, it is durable, and I love that it’s waterproof. Upon further research, I discovered that Bose is actually NOT worth the value for the money — many audiophiles recommend purchasing from another brand, as these speakers can be made for less than $50 and sold for $400+. Initially I purchased the Bose Soundlink MAX and another Flex (product listed here) as well, in hopes of amplifying the sound as well as achieving stereo sound in my apartment.After doing some research, I returned the Soundlink Max and one of the Flex speakers as well. I purchased some ELAC speakers instead for HOME use, and kept one of the Bose Flex speakers for shower use and traveling, as I spend a lot of time on the beach and this is dust and drop resistant. I purchased this on Prime Day for $99 before tax. I would NOT say it’s worth $150 full price. The battery is not great. I can leave it charging overnight and it dies with moderate use before the day is over. Mediocre in performance overall.It’s worth nothing that when I purchased the Soundlink Max from Amazon, the box itself clearly states that the speaker comes from Bose “RETURNS AND REPLACEMENTS.” I believe the speakers sold on sale are probably speakers that were defected or returned by other customers. Keep that in mind!","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AGCXGALSGPD6TVVAU6JWGT6SY4FA","is_verified":true,"helpful_count":4,"product_attributes":"Color: White Smoke"},{"id":"R293ZXMMJOFKV4","title":"5.0 out of 5 stars The sound of Bose","author":"Florence Campbell","rating":5,"content":"I bought this speaker to use in my home. The great thing about it is that it’s blue toothed to my phone. The sound is very clear in a small places. I’m glad I made this purchase.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AEOQSEHUYNW3VUOG35PNSEE3LIGA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1RC8B8SAHAJGQ","title":"4.0 out of 5 stars Bose girl here…","author":"C-Line","rating":4,"content":"I’ve been purchasing Bose products for about 25yrs. Their products are usually well made, durable, sturdy, efficient and unbreakable (based on how you care for your products). I purchased this little gem and didn’t open it until a week later. Used it for 2 hours, put it back in the storage case that I purchased (because we must care for our Bose products properly)LOL. Went to use it today (3 days later) and the battery is at 30%. The battery 🪫 life on this speaker SUCKS!!!! Bose needs to upgrade or do something about this speakers battery life. Other than that, it’s a great speaker with great output (to my liking).","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AGPIOFYEAQFGLB7IRE3EXGB6Z3CA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Chilled Lilac"},{"id":"R61DQBVV1AK4H","title":"4.0 out of 5 stars Great sound","author":"Abigail","rating":4,"content":"Sounded great but I could never get it to connect with Alexa. I ended up returning it. It may have been operator error but in any case i wanted voice control and I s couldn’t make it work. I really liked the size etc also.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AGTJ3NMZJJOKP5PLJS4YTOWZQ4ZQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R4HL1RX7J85C7","title":"5.0 out of 5 stars Bose is all you need to know","author":"sue","rating":5,"content":"What can you say, Bose sound in a small package. One of the best Bluetooth speakers I've ever had at a very friendly price. You can't go wrong. If I could give it 6 stars I would.","timestamp":"Reviewed in the United States August 9, 2024","profile_id":"AGWUVKYAKULLZTTJBPTII2GKI4KA","is_verified":true,"product_attributes":"Color: Stone Blue"},{"id":"R1XEI087L27YYU","title":"5.0 out of 5 stars Great product.","author":"OCDReader","rating":5,"content":"I bought this for my husband and we love it. Great sound quality, switches between bluetooth users easily and does what it says.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AFIZVCRSTK4IARRTUFNYDHAQU3IQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R2TK77MNUQQ83Q","title":"5.0 out of 5 stars Wow!","author":"Mark Twain","rating":5,"content":"I bought this Bluetooth speaker as a replacement for my another brand of speaker that was showing its age after several years. This speaker sounds really, really good for its size. It puts out quite a bit of bass for a speaker this size. I wish the battery lasted longer, but of course if it lasted twice as long, I would still make the same comment. I highly recommend this speaker. 👍🏻","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AE5EQTJLIIAW2WNE3U7P6S2UBQTA","is_verified":true,"product_attributes":"Color: Cypress Green"},{"id":"R3VC4C7R84FC1X","title":"5.0 out of 5 stars Best purchase in a long time","author":"Kelly L.","rating":5,"content":"Van lifer here. Needed something better than my cell and this is wonderful. Nice bass. I don’t have WiFi sound I can’t use the app evidently but I’ll set up sound preferences when I am connected.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AGSKACOGSISWMPALMLBX726O4MQQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2V79BVI4UTYHX","title":"5.0 out of 5 stars Great sound!","author":"DublinOH","rating":5,"content":"Great sound for a small unit. Like that it is waterproof and very portable. We are remodeling our master bath, and it will be nice to have quality sound while I soak in the new jetted tub!","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AFO5XCK5RD6ELA5AFI2BNMUY6LJA","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R36X2ALFJBMP3R","title":"5.0 out of 5 stars Nothing like a Bose","author":"Nelle","rating":5,"content":"I bought this because it is the more updated version of my other one. Of course Bose offers high quality sound that is unmatched. Very pleased with my purchase. It's what I've come to expect from Bose.","timestamp":"Reviewed in the United States August 26, 2024","profile_id":"AF6QLNKVT5TOE73JL6H3SLLZ5R7A","is_verified":true,"product_attributes":"Color: Stone Blue"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-08 14:28:27","updated_at":"2024-09-08 14:28:39","page":10,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=10","job_id":"7238553782961849345","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-08 14:28:27","domain":"com","geo_location":null,"id":"7238553782961849345","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B099TJGJ91","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-08 14:28:39","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7238553782961849345","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7238553782961849345/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7238553782961849345/results/1/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/2/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/3/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/4/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/5/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/6/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/7/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/8/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/9/content","http://data.oxylabs.io/v1/queries/7238553782961849345/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7238553782961849345/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7238553782961849345/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7238553782961849345/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7238553782961849345/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7238553782961849345/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7238553782961849345/results/10/content?type=parsed"],"method":"GET"}]}}