{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=1","asin":"B071JN4FW6","page":1,"pages":313,"reviews":[{"id":"R3BNGB4S06XGRB","title":"5.0 out of 5 stars Big bass, quality sound and the ability to expand via TWS makes the Soundbox XL a winner.","author":"bazguitarman","rating":5,"content":"After reading/viewing many Amazon and YT reviews I decided to take the plunge and ordered my first Soundbox XL. I say my first for a real and specific reason I will cover futher into this review. After receiving, unpacking, charging and seamlessly pairing my first Soundbox XL I excitedly brought up some music on my Android device.....And I was met with the quality sound I expected after my pre purchase research. While not audiophile quality, the Doss Soundbox XL does deliver high quality sound. The bass was deep, the mids were musical and the highs were pleasant and spacious. The Soundbox XL really does take advantage of it's larger size to create a more spacious than average soundstage and open presence. Overall I found it to be everything it was advertised to be. As far as sound quality it was everything I hoped for and definitely punches above its reasonable price point.Now for the one and only \"negative\" of the Soundbox XL. It's not very loud. It is only slightly louder than my much smaller Anker Soundcore 2 speaker. If you are expecting truly room filling output prepare to be disappointed. While the output is quite a bit louder than conversation level don't expect it to be party level. In that respect I was a little disappointed. That is until I took a realistic and honest look at the speaker and its sound quality. There is absolutely no way that Doss could have pushed the output level any higher while maintaining 40 hz. and lower bass response. Sure the XL has a dedicated sub, but it's not a 12\" sub. Sure the XL has dedicated power for the sub, but it's not 500 watts. There is only so much that you can do with this small form factor. And after taking that into consideration I raised my initial opinion from disappointment to grudging understanding and acceptance.But, I still wanted more output. And that's where the second best feature of the Soundbox XL comes into play. The newest version of the XL features TWS (true wireless stereo) connectivity. This feature allows you to easily daisy chain two Soundbox XL's in true stereo for more output, more bass and even bigger soundstage. So I quickly ordered a second XL and I am glad to report that the TWS feature works perfectly. It really does elevate this speaker system to a whole new level. Now I have the room filling output I was after. And it sounds damn good. The big bass is reinforced and even more impressive. The soundstage is as big as you want it to be. And the sound quality doesn't have to suffer at all. The two speaker units are perfectly synced with no latency at all. I couldn't ask for this feature to work any better. Not only do I get higher output levels but I now have the option for multiple room sound. I am loving this speaker system now.So.....If you are looking for extended bass performance the Soundbox XL definitely delivers. If you are looking for quality sound that is balanced and pleasant it's also in the Soundbox XL. And last but not least, if you want the ability to expand with a second Soundbox XL the TWS feature is a game winner. Whether you want higher output, fuller sound or multi-room capability adding a second Soundbox XL via TWS is simple, satisfying and rewarding.","timestamp":"Reviewed in the United States May 11, 2021","profile_id":"AHW2IWXM3NJJLNRD22WM3LAZ6E6A","is_verified":true,"helpful_count":23,"product_attributes":"Color: Black"},{"id":"R8POLFK8EAUS0","title":"5.0 out of 5 stars UPDATE Aug 28 - Great Sound, Disappointing Build Quality","author":"James E.","rating":5,"content":"The DOSS Soundbox XL seem to be plagued either by bad design issues or a high rate of poor manufacturing quality. I recently got one, and took off the cover to remove that speaker grill liner some reviewers said causes a rattle and saw the left tweeter cone was mashed in. I returned it to Amazon only to get a second one with an annoying bass vibration, one recent Amazon reviewer described as a \"farting sound\" with music with a strong bass line. It actually happens at 54 hz when you use a tone generator and comes from air blowing out the jack/slot holes in the back.I really liked the sound, but I feel this needs to be shared. DOSS needs to get it together before I would even consider a THIRD.UPDATE: Aug 29, 2017Within a short time, I got a reply in this thread requesting my email in order to receive a replacement free of charge from Milla with DOSS. Without that, I would have probably not ordered a third.The replacement arrived a few days ago and I am submitting the following update. Milla was quite wonderful sending me updates as to the status of the arrival of the new unit. The first thing I did was remove the grill to check if the dust liner was loose like the first two only to find that it was attached directly to the inside grill. The drivers looked perfect. After charging a few hours, I was ready for my test to confirm if the air leak problem was fixed. I put on a few bass heavy songs and listened for that telltale air leak. As i turned the bass up to the point of distortion, the cabinet seal held. I got no rattles The top trim plate seemed to be secured tighter as pushing down on it detected no movement indicating bad adhesion. This one as far as build quality was perfect.Rather than evaluate the sound in depth right out of the box, my experience as an audiofile knows that it takes a few hours of playing different kinds of music at various levels to allow the speakers to break in and not sound dry and stiff, but more rounded like live music. After two days of playing off and on, the sound difference as they broke in was quite noticeable in the sense of warmth also with an increase in sonic accuracy. I highly suggest one of the better apps for music playback rather than the generic one that comes with your device if you really want to experience their true capability. As an audiofile, listening to various players using my headset was the test.. After trying/buying several, Jet Audio Plus was my choice. I custom built my home PC with a high end audio card including custom opamps, mil-spec capacitor, low noise motherboard, a case that isolates the power supply, routing the wiring, etc. Windows system tweaks, and special software that as a result compares spec for spec and in sound quality with the more expensive audiofile preamps sold separately.So using this app, I have been listening for hours with everything from smooth jazz, rap, rock, and other types also with various dynamic ranges. I will give my impressions based on other bluetooth speakers i have auditioned.Frequency Response: To my ear, this speaker is flatter and more neutral and natural sounding than most. The bass extension is uncanny for a box this size and not only goes lower, but maintains a sense of focus and tightness to actually be able to hear the low notes, not the boomy blur that seems to radiate out of most of the others at this price range. I actually put a little dip in the bass at 60hz because i felt the bass a little overemphasized for my room proportions. The mids were just fine. The treble has a slight roll off due to the dust cover I presume, but it is easily correctable with your player's equalizer with just some minor tweaks above 10k.Soundstage: The Soundbox XL creates a soundstage that occurs just in front of the speaker and has a 3D quality of air, that is missing from most of the others. It is so good that on certain songs you can hear each instrument or voice distinctly in their own \"space\". Also when placed 12 inches from a solid wall, the soundstage blooms to a room filling wall of sound as the back wall reflections contribute to the sense of space and presence. This also increases the bass to a point you can FEEL. This same effect happens placing it in a corner, but i found that 33\" from the center of the back of the speaker to the corner works without overloading the sound with bass.Dynamic Range: After the speaker broke in, i noticed the sound become more alive in sense that as each instrument or vocal in the music became louder of softer, the overall balance of soundstage pretty much stayed flat instead of the dropouts or peakiness you hear with speakers that have a narrow range of accurate frequency reproduction based on the frequency amplitude \"sweet spot\" of each driver. It results in a lack of listener fatigue for extended music listening and as a result is more akin to my home rig sound. Overall Loudness: For most listening, esp indoors, I find the volume range more than adequate. This range can be extended using the preamp setting in the equalizer such as the Jet Audio to levels that go beyond the max that is available on the generic device that is set to protect the internal speaker and earbuds. A step or two up is what i found works best. without significantly increasing the possibility of damage.This speaker ROCKS! If I have to find a fault, it is having readjust the speaker volume each time it is turned on. The speaker sounds better with its volume set at max and controlled by your device. If you do this make sure the volume on your device is turned down a lower range before you adjust the Soundbox XL volume to max.In summary, based on their top notch customer service, better build quality and the other attributes I highlight in this review, the DOSS Soundbox XL, especially at the price point, is 5-Star product. There just is nothing better, IMHO. I can't wait for the pairing option to come and and review a stereo pair! Thanks, Milla.Well done, DOSS!﻿","timestamp":"Reviewed in the United States August 15, 2017","profile_id":"AEP6PLVW7LABDSUKZDMRH43CRL5A","is_verified":true,"helpful_count":144,"product_attributes":"Color: Black"},{"id":"R1C5C7FRCA3FW7","title":"4.0 out of 5 stars A POSSIBLE FIX IF OUT OF WARRANTY - SPEAKER WILL NOT POWER UP","author":"JHelms","rating":4,"content":"I purchased two of these speakers from Doss for bedroom / kitchen use in August 2019. One of the units failed after 10 months of use. Doss was AWESOME and sent me a replacement speaker at no cost. Customer service was great. They did not want the old one back so I decided to have a look around and figure out why the unit was not working. I hate just throwing things away if they can be fixed.Symptoms...- Unit would randomly shut off while plugged in until it would no longer function. Red light on back just blinked next to power cable inlet- While unplugged, it would turn on and off at random by itself powering up and down making the power up and down tones. Would drive you mad with the on / off / on / off tones- Finally, unit would do nothing at all. No soundIssue found:- The internal battery BMS (battery management system) had failed. Battery had no connection at the output. I found no way to unlock this very basic BMS so... it's dead. Unit uses two 18650 cells (nice). I did confirm both 18650 batteries were still good as I manually was able to charge them and check balance. So the BMS just horked out (not the fault of doss, they do not make the BMS or battery pack)I started to look at small replacement PCB's to replace the BMS, then I realized HEY! I NEVER use these things portable. I always have them plugged in. So I tested the unit without the battery pack installed. Nope... No-go. When the circuitry does not sense voltage on the battery connection, it does not allow the unit to power up.I ran some tests and the fix is easy if failed this way. Just solder in two jumper leads from the 12VDC input to the battery connection posts. This allows the unit to power up as it senses voltage even though the battery is not present. I have been running it this way for a bit without any issue. Quick and easy for a solder slinger. See photo for added wire leads. Blue is the color I used for positive.Adding a little video on the tube you can search for to show what I did in case the photo does not cut it. In a few weeks I will be doing some affordable upgrades to this speaker to hopefully get the mid-range and treble in-line with the bass (speaker replacement).BTW, this speaker uses an NTP8320 amplifier / dsp chip. Clearly, Doss did some programming to the DSP's onboard EQ to add this much bass. I wish it was user programmable as this chip has a lot capability.Overall, I feel the speaker is limited by the two super generic 2\" paper cone full range drivers. The sub seems to work quite well in this tiny package with the two passive radiators. I ordered a few different versions of full range 2\" drivers with the same basket so they will be drop in. Hopefully, one of the versions will work better offering more efficiency (louder mid and treble) and some treble extension.For the cash paid, this is a VERY well built little unit. They really spent some time engineering it and most will find the sound adequate for a little room speaker. Far and away better bass than anything I have heard in this price range or even double. Set this unit in the corner of a room and it sounds quite full and much larger than it actually is. Everything from weight, to enclosure assembly is top notch and far better than I expected.","timestamp":"Reviewed in the United States July 4, 2020","profile_id":"AFHAUFM3YV4VIZR6JB5S6EE47LKA","is_verified":true,"helpful_count":22,"product_attributes":"Color: Black"},{"id":"RTPUMQD0O5KNJ","title":"5.0 out of 5 stars Fantastic Speaker","author":"Snapcap","rating":5,"content":"The speaker arriver on time and packaged well. The speaker is beautiful. I went with the gold tone and it looks very nice. The speaker over all looks and feels of much higher quality than the price point might suggest. The Bluetooth was very easy to connect taking less than a minute and one button push. The sound quality is amazing. The bass is great with no vibration and the high and mid level tones are so clear. I have this connected to a phonograph, but it sounds better than my high end surround sound bar. I am looking at other DOSS products to replace some existing speakers. I don't review many products, but this speaker merited one for it's exceptional quality and low price.","timestamp":"Reviewed in the United States May 8, 2024","profile_id":"AEZPNIJBRNYSBQ3DHULPSLX7GBUA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Gold"},{"id":"R38078EFVVGKNW","title":"5.0 out of 5 stars Great sound for price! Well worth it!","author":"tony","rating":5,"content":"Bluetooth speakers are all the rage now going from high end Bose systems to ones that are clipped to your belt and all levels between. Trying to produce a product that stands out of the norm is tough but I believe DOSS has done so with its Soundbox XL. Having bought the DOSS Traveler and using it for river tubing I was eager to get my hands on the Soundbox XL.The XL packaging doesn’t have the flair as the Traveler. It came with the power supply, AUX cable, and a small printed manual. It’s not the packaging that sells the product. It’s the quality build, sound, and ease of use.First off I wanted to look at the build. The speaker is solid in its appearance, weight, etc. The matted finish shuns fingerprints but will pick up a few smudges. The weight at about 3.5 pounds will not let it rattle off the shelf. Another reviewer stated that had the plate around the buttons come off but that wasn’t the case with mine. There are no visible holes except the AUX, DC power supplier, and TF (SD) card slot.Let’s talk about the sound. After a 12 hour charge recommended by DOSS I sat down and ran it through its paces. First off I connected to my phone’s Bluetooth (an easy process) and just played some music to get used to the buttons. I then started up a frequency generator and sent a series of tones through the speaker. To my ears I could hear from about 35hz to 11500khz.I verified this with my Sony Monitor headphones plugged into the phone. Since the ability of hear higher tones goes down with age the younger folks out there you will probably hear a wider higher range. Overall the sound was very good no matter what kind of music I pumped through it. I easily got eight hours of music out of a fully charged battery.I played three hours of classical music at about 30% of full volume. The sound filled the room easily. I pushed the volume to 100% and heard no distortion. I then played another four of hours of rock music. Again I had pushed it to 100% volume and heard no distortion. Keep in mind unless you have your Bluetooth transmitter setup differently the sound will be flat; there are no bass or treble controls on the Soundbox. Where is no audio being played there was a very little hiss.The bottom line. If you want the best bang for the buck, you can’t go wrong getting this speaker. For moving it around the house, used as a small sound bar for a small TV, backyard parties, etc., it would hard to find something as good as this for the price. Well done DOSS.","timestamp":"Reviewed in the United States August 25, 2017","profile_id":"AG4SEK3G5PQIA3XA2RQV4MJREISA","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R3CVV579ZZPGWF","title":"5.0 out of 5 stars Sounds so good it threw me into a d e p r e s s i o n","author":"V","rating":5,"content":"I have designed and built my own portable speakers for years now as a hobby, my main goal is always to get a better bass/quality/volume to size ratio than store bought speakers of the equivalent cost. This is so slim yet sounds so good and goes quite loud for its size & with impressive bass, my expectations for a speaker of this size at this price point were blown out of the water. And worst of all, it set the bar so high for my speaker building hobby, that I stopped building speakers altogether for a brief time, because none of my designs at the time had the potential to come anywhere close to the sound quality-to-cost ratio of this.It’s no bang & oleufsen speaker, but it blows even the old Bose soundlink 3 OUT OF THE PARK, so for the price point, my personal opinion is that this speaker absolutely cannot be beat.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AGR5PL73A63NBRDRHGZBFN6RSFRA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RISA2268RCCEA","title":"3.0 out of 5 stars (EDIT: Mine has had issues.) Excellent speaker. DSP + Subwoofer + Battery! Value at top of charts.","author":"PHIL","rating":3,"content":"I don't have any experience with owning bluetooth speakers, but I have demoed the stuff at best buy. I've owned a lot of hifi though: Magnepan, Stax, Hifiman, and lots more, more than I can remember.I became aware of this speaker by stumbling upon oluv's review while looking for a portable speaker. That dude seems to have heard hundreds of portable speakers, and he measures frequency response and makes binaural recordings. Thanks oluv.The speaker sounds great with a neutral frequency response. The bass is the most impressive part: plays deep, low distortion, and tuned relatively flat. I didn't think that I could get a portable this nice sounding for not much $$ when I first started looking.I just received the speaker today, so I'll probably update this post with more comments, pics, and maybe some measurements.I do have a question for all you other owners. When the speaker is on with nothing playing though, do you hear a hiss/static sound coming through the speakers? Its very low, but discernable within a few feet of the speaker. The sound remains when you play music too but it's not audible over the music. I figure it's normal and am not too concerned, but if it's just me... I get the same static sound in my car's aftermarket stereo with it's aftermarket DSP, amps, subs, and speakers. You can hear it when the engine is OFF and no music playing, but the battery and stereo is ON. At first that noise bothered but eventually accepted that practically it's a non-issue because you can't hear it when the music is playing, then add engine and road noise.I originally bought the speaker for my wife, but I might end up getting two.EDIT: The speaker sounds awesome but the static/hum produced by the speaker is maybe too annoying. It's acceptable for music because its mostly inaudible over the music. But for listening to podcasts while sitting near the speaker the static may be too loud. I'm trying to decide if I should order another to see if I got a bad unit or just returning. Can anybody comment if they have the same issue?Edit: 1star removed. The static is enough to make me not recommend this speaker for low level listening (nearfield). Also the frequency response is a little too much on the warm side. I use EQ to balance, but thats my preference.Edit: 1more star removed. The bluetooth connection to iPhone has been a bit finicky since first use, but generally connected with just a couple tries. Lately however its been getting worse, and just today I couldn't get it to connect at all. So, I tried some other devices and I could get my iPhone to pair with those without issue. I then tried the Doss with my iPad and that took three tries before it would connect. And now, I can't get the MODE button on the DOSS to switch over to another function so that I may use it with my iPhone via aux cable. I am now going to be more insistent on a refund/exchange.","timestamp":"Reviewed in the United States September 4, 2017","profile_id":"AGLVG7GK6XUOWDKYNDJLDWJXGIYQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"RCEIO0X6YT1NO","title":"5.0 out of 5 stars Better sounding speaker than those costing twice as much","author":"R. Richardson","rating":5,"content":"Great Speaker! I hooked it up to my Echo Dot in our family room. Fantastic sound and volume. Best low bass I've heard in this size and price speaker. I didn't hear any rattling at high volumes like some reported. Bluetooth range is good. I've taken outside to patio without any breakup. The range I tested was only about 20 feet with a wall and sliding glass doors between source and speaker. I play Amazon Music Unlimited via Echo Dot - sounds great!Cons: When I connect with Bluetooth, the speaker disconnects after a period of time of no use. I ask Alexa a question and get no answer and find that I need to turn the speaker back on because it turned itself off. The workaround is to connect to Echo Dot via provided cable. The downside is you need to keep the speaker close to the Dot. But at least it doesn't turn itself off - usually. Sometimes I find it is off and I have to turn back on, but not as often as when using Bluetooth. I keep it plugged in all the time except when moving it to the patio.Another con is there is no equalizer function to adjust bass or treble. Not a big deal as the sound and balance is great.Volume is plenty loud for our large family room. With the volume all the way up, it is too loud. If using for an outdoor party with lots of people and area, it may not sound as loud as some larger speakers.If you want a fuller soundstage, place in the corner of the room. It will improve the fullness of the sound. However, we have the speaker in the center of one wall and it sounds fine.I contemplated the Harman Kardon Onyx Studio 2 larger speaker because my friend has one and it sounds fantastic. I chose this Doss Soundbox XL because of the size, reviews, and price. I am happy with my decision. If you listen to a lot of music every day, you may want to consider the Harman Kardon.You will not find a speaker in this range with the clean bass that picks up bass under 40 Hz. You will hear clean bass down to about 25Hz. The sound is crisp, clean, and deep where you feel it vibrate in you. Most smaller speakers are boomy sounding and make people think they have loud bass. I was like that with my Home Theater setup... I had a 16\" subwoofer that shook the house. I thought I had good bass. Then I purchased a 14\" much more expensive SVS subwoofer and realized what other audiophiles were talking about when they said \"clean bass.\" Very crisp, no distortion, short punch without the hollow boom. Makes the music sound so much better.You can read the specs in the description - so I won't repeat here. Suffice it to say, for the size and price, you can't go wrong with the Doss SoundBox XL.You will not be disappointed in this speaker. It sounds much better than others that cost twice as much.","timestamp":"Reviewed in the United States November 3, 2017","profile_id":"AE4NEUMATGXZ32QFZEEMQZGIP72A","is_verified":true,"helpful_count":22,"product_attributes":"Color: Black"},{"id":"R5H3UJAQNL0TQ","title":"2.0 out of 5 stars Needs some work.","author":"Handy","rating":2,"content":"First, lets start with the size, it's quite large at 12\" wide by 5\" tall. I spent a month digging through every video andreview I could find about this speaker before I finally made the plunge, but somehow this particular aspect of thisspeaker never seemed to make it to the list of things to talk about and of course, I did not actually look. To the average viewer, it seems smaller in size in the videos.It seems very well constructed and unlike many of the older reviews, it does not have the vibrationissue that plagued these in the beginning. In fact, the foam pad, that at first was simplyfloating in the grill and then later glued to the grill, has now been removed all together and I thinkthat this was probably the best way to fix the issue.The buttons are very tactile and they actually took a bit of pressure to respond to my choices.For instance, the volume keys on my unit did not actually work very well at first. I needed to press quitefirmly to get them to respond, but after doing that to all the buttons, it seemed to do much betterand now does not require the firm press.Appearance is simple and has some small issues. First, there wasn't any protection film on the button bar on my unit. I'm not sure if this was missed, or that this is the way they all come. But I did notice some dings and scratcheson the edges of the button bezel that were likely due to manufacture issues. Since this part is very shiny and reflects quite a bit of light, this took away from the \"New\" feel, but was not in anyway a deal breaker. The next small issue is the black high gloss frame around the grill and back. This border is so glossy that it attracts all sorts of dust and hair. I found myself wiping if off many times just in the first hour of playing with it. The third minor issue is the grill. It picks up every little bit of oil from your fingers. If you pick this unit up, (in the only real way to hold it) your fingers will press against the grill. When you set it back down, there is a very dark smudge where your fingers were. It is very noticeable and could be easily remedied by using a fabric cover instead of the semi-gloss paint. I think this would also give the unit a much more pleasing visual presentation and allow it to compete better with other portable speakers in it's class.The unit is charged with a propitiatory 12 volt 2.5 amp round plug charging adapter. This has some benefits and drawbacks. The benefit is that it will charge much faster than a typical USB charger. The drawback is that you will need to keep this charger with you in case you need it. That can be an issue if you don't have a bag to carry it in. The plug felt snug and should provide a long life as long as it is not dropped or banged while plugged in.So how does it sound?Let's start with the sound stage. This is the feel of the sound, and how wide the music coming out of the speaker feels when listening to it. The Doss XL does not have a very wide sound stage at all. For example, I have a Go Groove SonnaVerse UBR sound bar on my monitor for my computer. This is not a very high end sound bar, but does have a good sound stage that allows you to feel like your not listening to your music in a audio tunnel. When listening to the Doss, it seems very narrow in it's sound stage. In fact, you can test this yourself by simply closing your eyes and then taking the speaker and putting it a few inches from your face playing it on low. When you do this, the sound stage is like it should be. But as you move the speaker farther from your face, the sound stage starts to collapse and by the time your arms length away, it sounds like it's coming only from the middle. This severely dampens the \"stereo effect\".The sound Quality. To be honest, after a boat load of reviews of this speaker I had some pretty high expectations, and when I played my first songs on the speaker from my phone, I almost thought I was going to ship it back. I use a paid music app called Power Amp. It is very powerful and versatile app, and has many settings that allow you to customize your sound the way you choose. And on my Sony V600's headphones, it rocks like no tomorrow. But on the Doss, this was not the case no matter what I did to make it come out better whether using Bluetooth or the headphone jack to aux input.One thing I did notice after using this speaker for a day or two is that if you have your phone volume up to 100%the pre-amp in the speaker starts to distort and the speaker sounds really bad. If you turn the phone volume downto 80% then that distortion goes away. I'm not sure if this is an issue with certain types of phones or a bigger issuewith the pre-amp in the speaker. I found that it did this only when using Bluetooth or the headphone jack to aux.Since the volume on the speaker is separate from the phone volume you could turn the speaker volume up to maxand then use the phone volume to control the volume. On the SD card it plays very clean at any volume.But my real reason for buying this speaker was for the TF card reader, or \"Micro SD\" card reader.I use this speaker at work, and I don't keep my phone with me when working So I needed a speaker that wouldplay off of a micro Sd card, and not many portable speakers come with this option, so my options are limited.So I loaded a bunch of tunes on the SD card and let it rip. The highs are still pretty muddy even with some very good quality songs. At this point, it's obvious that this is a tuning issue inside the speaker it's self. Even when using the phone through the head phone jack it still would not allow anything above 8K to really come out. I think if they had made the tweeters angle a bit to the outside of the speaker and adjusted the internal EQ, this would fix both the sound stage and sound issue. I took the speaker all over the house and tried different angles and placements. Putting it in a corner amplified the lows considerably, but also muddied them just a bit. Over all, I was much more pleased with the sound out of the SD card than the Bluetooth, but all three suffer from muddy highs. Also, once past around 1/2- 3/4 volume the bass tends to fade a bit, and you loose those rich lows. I guess this is to be expected though, When it's playing, you can feel the vibrations from that sub and it's pretty awesome. My guess is that this is done to keep it from distorting at high volumes, and also a way to give more battery life.I have only three real complaints about this speaker, and one has to do with your choice of input. When you turn the Doss on, it automatically goes into Bluetooth pairing every time. Even if you were using the SD card or the aux plug in for your source. The minute you turn off the speaker and turn it back on, the speaker does not remember your last input setting, and again tries to pair with my phone. And of course my phone prompts me every time it tries to do this. So every time I turn this speaker on I have to wait for it to start pairing before I can hit the mode button to change it to the SD card input. Thankfully though, it does remember what song I was playing last and continues to play from that point.Second issue is the rubber feet. Seriously guys and gals at Doss. This speaker has some really good bass and will move around at higher volumes. Put some bigger feet with some better grip on the bottom of this thing. The ones that are on there are only a half inch square, and are so recessed into the plastic as to almost make them useless. I took the advice from another reviewer and purchased the SoftTouch Self-Stick Non-Slip Surface Grip Pads - (6 pieces), 1\" x 4\" Strip - Black s from Amazon when ordering this speaker and that fixed that issue.Third issue (and this is the biggest) is the clear lack of good high end sound 8K and above. It really hurts the music and also the sound stage. I can clearly tell most of the high hats and cymbals are being muffled and chopped out.I did a side by side comparison with my low end speaker bar with the same songs and even my wife, who usuallycould care less about sound quality, said she could clearly hear the sound difference.I truly believe that if they fixed these three issues, that this speaker would be almost unbeatable, and worth more money.So, the Pro's and Cons' here.Pro's:Awesome Sub lows reproduction. You will never get anything better in this size anywhere.Good weight to keep it from going anywhere if you use the pads.Visually appealing but a bit dated in style.Battery life is around 8 hours with fast battery charging. Around 2-3 hours for 8 hours of play time at 1/2 volume.Incredible bass reproduction (Yes again). This is where this speaker really shines. It's like having a small sub woofer.Con's:Easily marred by finger prints, dirt and dust. This is not your dirty area speaker.Not water or dust resistant in any way, do not use if you think it will get wet or in dirty environments.No USB charging.High end sound is very muddy and was almost a deal killer for me. Update: Was a deal killer for me.Does not remember input settings when powered up.Rubber feet are a joke.Would greatly benefit from a felt bag or some sort of protective case.My final thoughts. If they would put some sort of rubber casing, even a slip on shell and fix the grill with somefabric, this speaker would be better suited for outside use and look much better and I would have paid more for it.As is, it's more suitable for inside on the go music for maybe your office or such.Also, having the sound buttons have either a different indent or placement would greatly help in findingthem since they are in the middle of the buttons and you have to look to see which one is which.I work in a controlled area and I actually found a zip up bag at my local second hand store thatfit this speaker perfectly for only $1.50. So now when I'm carrying it around from location to locationit does not get all mucked up with dust or get dinged or scratched up.Base reproduction is absolutely amazing at low to almost 3/4 high volume on almost all the music I testedBut the lows come out much better if the speaker is placed in a corner. When putting it in some placesin the house, the lows almost disappeared. So speaker placement is important.If they could fix the issue with the highs, this speaker would be freaking awesome.Many thanks to the reviewers for all their input and especially to Oluv's Gadgets, truly the best speakerreviewer on the internet.Update 8-11-19Sadly, I had to send this speaker back. The missing highs and the narrow sound stage was just too much for me.The speaker had a canned sound that I just could not get past no matter how much I loved the lows.Hopefully, they will read this and perhaps even find someone that can tune the speaker better for them.Till then, I cannot recommend this speaker to anyone.Update: 8-19-19So for a little over $20 bucks more I purchased the Anker Soundcore Motion+ and I can, withoutany reservation at all say that this is what the Doss should have been. Clear highs, even betterbase without the muddyness. USB C 2.0 amp charging. 6,700mah battery with 12 hour play time.Nice rubber casing with a better grill. Easy to find volume buttons.The thing blew me away. This was Oluv's pick of the year by the way.The Doss folks need to buy one of these and compare their sound with it.I think it would really help them to get the sound on the Doss right.","timestamp":"Reviewed in the United States August 8, 2019","profile_id":"AH5V4FGFB6RGWQGFJZAK5MGAHZUQ","is_verified":true,"helpful_count":58,"product_attributes":"Color: Black"},{"id":"R1CQ8PJG5DQKBQ","title":"4.0 out of 5 stars vs JBL Xtreme, who wins? I found out.","author":"Kinh Williams","rating":4,"content":"I'm going to tell you right up front, I'm comparing this Doss speaker to a speaker that *normally* cost more quite a bit more than the SoundBox XL. Why? Well, because like many of the reviews have said, including clavinetjunkie whom I respect tremendously as a product reviewer, this speaker punches above its weight class. It's true! This speaker *does* compete against much more expensive BT speakers! And had I not scored this JBL Xtreme, on sale for only $128 (refurb - Frys), I probably would be blissfully satisfied with this Doss Soundbox XL for a bargain of a price and never looked back. Frys sells manufactured refurbished JBL speakers often so it's not like rare deal - Wait a week or two and you'll see the same advertisement. It took them more than once to get me to finally break down and bite. So without further ado, just how did this $90 Doss Soundbox XL compare to my refurb JBL Xtreme? If you're interested, read on.Do you like bass? No really - do you like *real* bass that's normally only produced by an actual subwoofer? The Doss is your speaker. It is downright amazing what this little speaker can do while being relatively so small. There's a \"Test Your Speakers\" video on Youtube by \"Doctor Mix\" and this speaker actually plays sub frequencies at audible levels as low as 20hz! In contrast, the JBL Xtreme doesn't come in until 60hz (and when it does come in, it comes in over-boosted as if to try and make up for the lack of tones prior)! The Doss is capable of playing distinguishable melodic bass tones in your song that only comes out as a repetitive thump in the JBL Xtreme. Rap songs really show off what the Doss SoundBox XL can do. Sounds like a clear winner is Doss right? Again, Read on.Mids, Highs, \"Soundstage\", \"Imaging\" \"Clarity\". All those are, in different ways, related to each other and this is where the JBL Xtreme shows the Doss what it's like to play with the big boys. I played all my favorite songs, ranging from EDM to Alternative Rock, subjected my wife to blind, speaker A vs Speaker B, back and fourth switch tests and it really was no contest. After switching from the JBL Xtreme, mid-song, back to the Doss, it's like the \"it's floating in the air\" wide imaging/soundstage the JBL Xtreme is putting out has been butterfly-netted and thrown in to a small box. That's literally the best way I can put it. For example, take a very vocal song with acoustic guitars in the background, like Paramore's - The Only Exception and switch back and fourth between the two and you'll know exactly what I'm talking about.Build, design, and structural quality: Surprisingly, they take up nearly the same amount of space (see pictures), though the JBL is much heavier. They both require proprietary chargers though the JBL's charger is pushing quite a bit more power allowing you to charge quickly *while playing music*. I know why they rely on proprietary chargers but l wish both could have the option to charge via USB *in addition*. I don't know why they never offer that - seems like an easy compromise and customers would love it, even if the USB option would be slower. Build quality, the JBL is much sturdier, nicer and looks like it would hold up to general wear better. Being water resistant means you can just rinse it off and not worry about it. The Doss has a much more plastic'y feel but come on, you got to remember it's only $90 dollars here. Again, I already warned that this wouldn't be an apples to apples comparison but with everyone agreeing it punches above its weight class against much more expensive speakers, we can't just only talk about the sound quality when we're referring to a \"portable\" bluetooth speaker. Portable means it's going to get a little beat up and the JBL will fair better, provided your kid doesn't stick a pencil to its expose bass radiators on the sides. ;) Also, be careful with the Doss speaker as it produces so much bass, combined with its low weight, it can vibrate and move across the table and possibly fall over an edge and commit suicide. I would add more sticky pads under it and be mindful of where you place it.Sigh... If only I could combine these two speakers. The bass capabilities of the Doss SoundBox XL and the Mid/Highs & soundstage of the JBL Xtreme would be perfect. At the end, I chose the JBL Xtreme. The bass is just as loud as the Doss, but not capable of getting as low however the wide-open soundstage of the JBL Xtreme (superior DSP perhaps) more than makes up for it and just makes music more enjoyable, frankly. Please don't get me wrong: I don't think the Doss sounds bad. I don't think its sound stage / imaging is terrible, I just think the JBL is that much better. In fact, I would say the Doss SoundBox XL is on par with the another speaker I recently fell in love with and reviewed on Amazon against several speakers: the Anker Soundcore Boost (thanks again to clavinetjunkie's review which pointed me back to Anker to give them another chance). I had to knock off one star though. My Doss SoundBox XL has the same buzzing/rattling sound as a few of the other reviewers had mentioned. I know you can take it apart and fix it but Doss really should resolve that before sending them out. It's only noticeable when up close to the speaker (less than 10 feet) so it may not bother most.Overall I do recommend this speaker, I just wanted to give my two cents on how well it does against a more expensive speaker, in this case, the JBL Xtreme. Btw, against the JBL Flip 3, 4, charge 2 & 3, no contest - this Doss speaker is way better as far as sound quality. Again, bear in mind, ruggedness/portability is not the SoundBox strong point.","timestamp":"Reviewed in the United States July 31, 2017","profile_id":"AEFXWNIATB23AKSAQ3PQNRKJ2BGA","is_verified":true,"helpful_count":779,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:46:58","page":1,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=1","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=2","asin":"B071JN4FW6","page":2,"pages":313,"reviews":[{"id":"R3JBFP2IRKNPOC","title":"4.0 out of 5 stars Very good sound","author":"Annette Langford","rating":4,"content":"Lives mostly in our living room. Sound is very good, both high and low frequencies at a fairly high volume. My disappointment is battery life. It could be better. Operating the speaker with a charger plugged in does not color the sound or add to the sound - good. Bluetooth connection is easy and solid.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AE6ME2SV2WYYFETNPE4XYBW3R7FA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R1RMKRKVIDPT6M","title":"4.0 out of 5 stars Sounds very good but could use a remote and the aptX codec to keep your Mp3s from being re-compressed by Blutooth SBC.","author":"K. Krueger","rating":4,"content":"3/31/2018 UPDATE. The tiny original DC charger port finally snapped. Doss Support replaced the whole speaker and the new one has a larger charge adapter. With no way to charge the batteries I bought an 18650 lithium wall charger and external battery box (see photos). A little soldering, drilling, and some #6 bolts have the old speaker working again;) You might consider any of the following three items as a deal-breaker:1. No remote or phone app, so you have to walk over to adjust volume when playing via micro SD.2. No AAC, aptX, or WiFi to prevent losing audio quality due to compression via Bluetooth's SBC codec.3. No matter which Bluetooth speaker is purchased, you may also need one of these: Azio (BTD-V401).Like others, I immediately pried the front grill off using a small flat-head screwdriver and removed the paper inside. It's just loose and floating around so it makes noise and I am leaving the grill off since it only serves to mute the highs without mellowing lows. Black and unobtrusive plus it is quite heavy for the size. The bass caused it to move three inches and fall off a short step, so the stock feet really don't have quite enough grip. Then it's fairly thin and likely to fall backward onto the delicate A/C plug. After listening for a few days I realized the sound was a little better when aimed slightly up. I wound up building a custom wood frame to raise it a couple inches, lean it back about 30 degrees, and protect the plug.The sound evens out a little after a few hours playing. Bass is especially strong when playing WAV files from the micro SD input, maybe too much! I wish there were an equalizer on that input. If you watch reviews they only use Bluetooth, and to me it sounds like that input received a lot of software refinement.At $89 the sound quality is pretty good when you feed it CD quality files. I describe the sound character as a 'high fidelity boombox'. It's just as loud on battery as with A/C and there is plenty of volume to be had. The only speaker even close to this price which I like as well for its sound, is the 'Creative ROAR'. Honestly, at $99 direct from Creative I would buy the 'ROAR' if I had it to do over. Go to $159 and the 'RIVA Turbo X' sounds very good in surround mode. You can compare all their sounds on Mr Oluv's wonderful site 'interactive speaker audio database'. Without surround-sound, the Soundbox-XL has a fairly narrow stage. This means it is not great for TV and you will probably want to stick with stock speakers there.Paired with a tablet or phone it is far better than those tiny built-ins. The highs and mids are very well done. I am hearing a lot of my Mp3 and WAV files as if for the first time. I keep thinking to myself either, \"So that's how the artist intended it to be?\" or \"Whoa, I never knew they missed a note!\" Acoustic songs like \"Little Martha\" by 'The Allman Brothers Band' and \"Chicuitita\" by 'ABBA' sound beautiful! However, bass heavy club and heavy metal music are just not as lovely. After listening to 100+ songs, drums and bass are perfectly loud but very similar in all songs. I think it has something to do with the limitations of a passive radiator style woofer? This 'thump/pop' effect is most noticable indoors and through the micro SD. Outdoors via Bluetooth the effect is almost unnoticable (again the Bluetooth channel seems to have received the most attention). So, it has proved to be a nice way to fill my large two car garage with music.Offering this speaker at $89 instead of Sony's @$200 price for their SRS-X77 design, means Doss changed or omitted many features. The passive radiators and all drivers (32w) are changed from the original 40w Sony design (neither bad nor good). Removed was WiFi and its high data rate streaming capabilities, Mp3 upscaling, NFC, DLNA, Bluetooth AAC support, and Chromecast. Instead of all that, you get Bluetooth 4.0+EDR vs plain 3.0 in the Sony. I tested the Extended Data Rate feature vs non-EDR Bluetooth using two Android phones. Both connections sound virtually identical when playing either 256kbps Mp3 files or 1411kbps WAV files. This makes sense because EDR does nothing to increase the data rate of audio over Bluetooth and the 'lossy' SBC codec is still being used to compress then decompress the stream. This is where including advanced codecs (AAC/aptX) would have prevented my already compressed Mp3s being degraded further. Uncompressed WAV definitely sounds better than Mp3! As an example, the finger cymbals in \"Easy Skankin\" by 'Bob Marley' lose their highs and blend in after compressing it to a 320kpbs Mp3. So, I recommend using CD quality music files from the micro SD to get the very best out of the, Doss Soundbox XL. I'm still keeping this one as my first Bluetooth speaker due to the lower price and since it met my need for an excellent boombox in the garage.","timestamp":"Reviewed in the United States August 21, 2017","profile_id":"AGEEG22KTHDKDJHOXNATVRQ6MHNA","is_verified":true,"helpful_count":46,"product_attributes":"Color: Black"},{"id":"R1O2H6J25RHRUT","title":"5.0 out of 5 stars Great sound","author":"George","rating":5,"content":"Speaker provides a good balanced sound.","timestamp":"Reviewed in the United States September 4, 2024","profile_id":"AE3J2ZAL5WV2RMKRFLGYL7YZA2ZA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R2YTWUK01VXGK3","title":"4.0 out of 5 stars Great speaker for small areas","author":"Isaac Hinojos","rating":4,"content":"I have tried a lot of speakers and this is by far the best speaker for the price I feel a good comparison is a Bose Soundlink its not obnoxiously loud but not quiet I wish there was a little more bass and pop but its very crystal clear and have put it through a house renovation with dust water etc and has still held up","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AEFQSM3D4GLTS2OYPAPFI5HZ6PYA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2JXPVHFG2E1CC","title":"5.0 out of 5 stars YOU CAN OPERATE IN YOUR SLEEP","author":"Dennis R Wyant","rating":5,"content":"Previously, I have had at least 10 blue tooth speakers. All have had small buttons, most requiring sight to turn on or off or adjust the volume. This unit has raised buttons, I can adjust the volume or turn it off while I am half a sleep. It is perfect, just what I have been looking for years. The quality of the sound is superior to the smaller speakers. I just like everything about it. Sleepy Denny","timestamp":"Reviewed in the United States July 15, 2024","profile_id":"AF4HMR6TI6LJMUCPCOMTMEGSVCSQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R1AUVPELO0X6Q7","title":"5.0 out of 5 stars Excellent sound","author":"Robert Lyon","rating":5,"content":"Gave this as a gift for my girlfriend, she loves it. It has excellent sound quality from such a small box.","timestamp":"Reviewed in the United States August 17, 2024","profile_id":"AGZLECVFPDW4EEXTPLRWXBMB7XTA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R2QSKVZQ7OUYAD","title":"5.0 out of 5 stars Great so far, I can't really complain especially for the price.","author":"Benji","rating":5,"content":"I have tested out and heard quite a few Bluetooth Speakers and this is one of the better ones and probably the best for the money, although it's hard to say for certain as there is so much out there that isn't mainstream or on Amazon that is high quality but as far as what is on Amazon you really can't go wrong with this, I have some high end in ear monitors for when I want the absolute best sound quality but for the rest of the time a Bluetooth speaker is fine, that's not to say this doesn't put out high quality sound, it's just not as high up on the scale, I also have some high powered bookshelf speakers for when I really want to crank up the music, but this speaker fits perfectly in it's Bluetooth nitch, I'm surprised that they went with such a small battery though, it's the same size battery as my old flip phone that I still use as an alarm clock and it's not big at all. I don't really use it very much on battery so it's not a concern for me but if I were needing to use it a lot on battery I would be looking to replace the battery with something a lot bigger and I am sure there is more than enough room inside. The only other suggestions I have for the next updated model would be a physical switch to completely disconnect the battery for better standby life and some kind of switch to turn off the annoying led that lights up the ceiling at night, some of the high end routers let you turn off the led lights and that is very smart, most people don't need a constant led light on all of the time, they don't even really need a switch, just put it on a timer and if someone wants to see it they just press the power button briefly or the mode button when switching modes otherwise it's completely pointless light pollution. Also on the next model if they can add another subwoofer and have another set of passive radiators on the back that would go a long ways towards boosting the bass, if you turn the speaker around and face it towards a wall the bass sounds much more prominent, most subwoofers are ported out of the back or towards the ground, the passive radiators serve the same function as a port but the slower bass frequencies (in terms of volume as bass moves at the speed of sound but the lack of volume means you can only hear it so far away) combined with the minimal air being moved means that it is only pushed so far into the room and sounds somewhat flat from a distance, obviously much more powerful subwoofers overcome this by pushing hundreds of cubic inches of air every second, but this little 12 watt sub can't do that so it needs to take better advantage of the acoustic properties of the room it's in when inside, outside there's not much you can do.","timestamp":"Reviewed in the United States April 9, 2022","profile_id":"AFLLBNWW2T34Q2BMPZC6ULUPQP2Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R3FSMTBWP8ZSEA","title":"5.0 out of 5 stars I bought one of this and I have been using for about 2 years so worth the Money!","author":"Yesukal","rating":5,"content":"Clear sound good bass and not expensive","timestamp":"Reviewed in the United States August 26, 2024","profile_id":"AGEHWAZVEWDAJRY2457HWS6CZ75A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2BNWKJHWN6AAT","title":"4.0 out of 5 stars Great bass","author":"Celtic Explorer","rating":4,"content":"This speaker has really great sound for its size. The bass is very deep. Great battery life as well.","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AHZVDIIFXXFJCBVMHWYLZY63YWPQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2SRKDON5T60S0","title":"4.0 out of 5 stars Very good speaker","author":"Willie","rating":4,"content":"Very good speaker","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AH7OYOO6ONK57GNUCXSUG7QVHLIQ","is_verified":true,"product_attributes":"Color: Blue"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:46:59","page":2,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=2","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=3","asin":"B071JN4FW6","page":3,"pages":313,"reviews":[{"id":"R1OKX4I4QBO20Q","title":"4.0 out of 5 stars Well built as a first impression.","author":"Dennis Harris","rating":4,"content":"Easy to set up and connect to devices. Has good volume, have not noticed the booming bass on music that I have played. So far have only used it for about 15 minutes. The initial charge took about 90 minutes.","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AFTGQ2HEZ3EIGH5MF7NYDH5IYUTQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"RLQMNZL8GLN8D","title":"4.0 out of 5 stars Great sound, good price, wish 3.5mm aux cord disabled Bluetooth","author":"Small Biz Owner","rating":4,"content":"UPDATE 11/1/20:I forget exactly when we bought this, but it's been at least 2-3 years. It's holding up well. For the amount of volume it can produce, the battery life is decent, charging is very fast. I *love* that it doesn't have fancy whizbang colored lights on the front, just tiny little LED indicator lights on top. Pairs super fast on Windows 10 compared to Windows 7. Sound quality is bass-heavy, so if that's your thing, then it's good, but of course any sort of EQ or pass filter could remedy that if you want to. I haven't found the need to reduce the bass while watching action movies.In my review Title, I mention \"wish 3.5mm aux cord disabled Bluetooth\". *If* you plug in the 3.5mm cable before powering the DOSS on, the DOSS will enter bluetooth pairing mode by default, but the moment you plug the other end of the 3.5mm cable into your PC or device, it switches to AUX mode. Or you can simply press the \"M\" button once and when you see the indicator light switch from blue (bluetooth mode) to red (AUX), then you're good to go. BUT, if you power on the DOSS, then plug in the cable to the DOSS, then to the PC, it doesn't automatically switch to AUX mode, you'll need to press the M button once.What could be better I think is not the fault of the DOSS, but rather the current Bluetooth standard. Let's say I watch a movie on the PC, paired over BT. Later I want to listen to music on my phone, also over BT. But since the last paired device with the DOSS was the Windows PC, it keeps looking for that device. It won't finally give up and try to pair with the next device in the list, which would be the phone. I notice this is a universal shortcoming of Bluetooth and it drives me nuts. Why wasn't it Apple that designed the BT standard instead of whomever it was? Because if Apple had designed it (I'm not a huge Apple fan, except for their phones), then pairing with Bluetooth would be a thought-free process...it would just WORK and you wouldn't have to futz around with getting it to connect.Original review:This really does have great sound. Lots of reviews of that here that I won't bore you by repeating. The battery life is mediocre, we can get through about 3 hours of tv/movie watching before it needs recharging. I wish it accepted a standard micro-USB plug instead of what it has.My biggest complaint is how to handles source audio input. Bluetooth is a nightmare to deal with...well it pairs with my iphone just fine, but trying to pair with a Windows PC is not intuitive. It's really more of a Windows issue, though. So my workaround is to simply use a 3.5mm aux cable to plug the PC to the DOSS input jack. It works great when I first plug it in. But if I turn DOSS off and later turn it back on and the 3.5mm cord is still plugged in, it does not recognize the cord. DOSS is still flashing a blue light, signaling it is waiting for a Bluetooth connection. I think it should rather recognize that the cord is already plugged in and switch the source input from Bluetooth to aux-in. The fix is to simply unplug the aux cord from the DOSS and then plug it back in. It's a minor inconvenience, but one that -ahem- Apple would not have allowed if they had designed this thing. I'm not an Apple fan-freak, but I do appreciate some of the user interface details they obviously spend a lot of time working out for a smooth experience.It's a screaming deal for the price, even with that minor design flaw.","timestamp":"Reviewed in the United States November 7, 2018","profile_id":"AFEQXMGFMNX6GFAXKBDL43U3RVAQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"R2MXDYCE1RS4OL","title":"3.0 out of 5 stars Not useful if you are looking for USB/Card playback","author":"Janaaaa","rating":3,"content":"I was looking for a speaker which can play songs from USB/Card along with random/shuffle option. There weren't many speakers in the market that supported USB/Card playback. I found 3 that had this feature and reached out to their customer support to see if they also do random/shuffle. Coz without random/shuffle, the USB/Card playback feature is nearly useless as we would end up hearing same list of songs every time. DOSS was the only one who responded positively confirming that they do have a firmware update for XL model which would support random/shuffle. and they did send it to me after purchase. But it didn't work. After a few back and forth mails, they now informed that \"there won't be a firmware available for this version of speaker.\" While they still offered to take the return, I am posting this here for other customers who might be considering this model for the exact same feature (as it is being mentioned in many online forums). It simply won't work and there are no portable speakers currently in the market for the same. PS: There is 1 model from Creative with this feature, but it is pretty outdated.","timestamp":"Reviewed in the United States May 20, 2024","profile_id":"AFPJI5PFEZCDX5WYFIVFMUFM3VTA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2F0IJEIRCGQXR","title":"5.0 out of 5 stars BY GOSH AND BY GOLLY!!!! FINALLY!!!!!!","author":"LynnWied","rating":5,"content":"I received this bluetooth speaker yesterday. I was hoping it would be early in the day as I was set to stream some movies to watch and really didn't want to sit here holding my DOSS sound bar against my chest and next to my ear so I could hear everything. Not really \"conducive\" to pleasant enjoyment of a movie and certainly irritating.IN A NUTSHELL: this speaker is worth the $69.00 and more, I really hesitated to purchase it because of the cost but I want to HEAR when I am watching a movie.The speaker volume and sound is beyond FANTASTIC. I don't think I have even turned the volume all the way up as .... dang, there it goes again, shut itself off. Something needs to be done about that . . . as I was saying before I was so 'rudely interrupted\" by the speaker shutting itself off . . . the volume I have it set at is almost too much and I fear turning it too loud not only because of my eardrums but also I have heard tbat if you turn a speaker up too loud, it will blow the speaker.As I said on my review of the DOSS sound bar, it has delightful sound, it just didn't have the volume I need to hear with my being hard of hearing.I cannot review the bluetooth or the battery life because I just received it. My bluetooth settings on my laptop state that it is paired but I guess that has nothing to do with sound because no sound without the I 3.5 mm audio cable being plugged in. I am not savvy on all the workings of bluetooth connections but it is not important for my main purpose which is to hear the sounds on a movie.I cannot speak to the battery life since I have only used with the power charger. I will most likely keep it plugged in so I do not run out of power.One thing that IS VERY IRRITATING is how this speaker seems to make up its own mind when to just shut off. GRRRRR. So far it hasn't shut off right when I am watching a movie or I might be tossing it out the window, but well ...............I will pair it with my smart phone when I get done with my movie-watching binge.One more thing . . . it is SO NICE not needing to touch the colored wheel to control the volume as was necessary on first DOSS bluetooth speaker, the DOSS SoundBox Touch.","timestamp":"Reviewed in the United States July 27, 2021","profile_id":"AFO6OSFZZVNJJ3FJYV6NPOBADV6Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R28NG73DKUATLC","title":"3.0 out of 5 stars great sound for the price, but after 4 years there are several problems","author":"d2z","rating":3,"content":"This unit for the price is great until things stopped working, which took about 4 years. Now I must throw in the garbage because of 2 things:1 the battery is completely dead, and 2, the on off switch stopped working. I have taken the thing apart to see if it is repairable but it is not. Besides that, the plugin power is a problem. This did work fine for several years. I thought about buying another one, but I won't. I do wan't my gear to last longer so will spend more on a quality brand name. I'll give it 3 stars for 4 years of working.","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AHUH4IXT5WVTWK3S2L7GSV2NSEJA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2YUGBN3YA44YS","title":"4.0 out of 5 stars Spyware? Needs Feet.","author":"Andy Christ","rating":4,"content":"So this DOSS Bluetooth speaker has some interesting features. For one thing, since paired with my iPad, all I have to do is hold down its power button to have it connect and start playing, while which ever other Bluetooth speaker I have on in the house stops. Then once I turn off the DOSS the other last connected speaker starts right back up again. Very convenient, as I don’t have to navigate to Settings/Bluetooth and go through all the rigmarole of manually disconnecting/reconnecting speakers each time I enter or leave the laundry/bathroom, as I’d previously had to do with my wired unit. Another thing, the control buttons on top work a treat. Can actually fast forward through ads on YouTube while listening to music videos, something I can’t do on my iPad proper. (Update: Latest version of YouTube broke this feature, of course. Update 2: Now working again, go figure.) Plus the Volume button functions independently, rather than just controlling the iPad’s setting the way many cheapo BT speakers do. No controls for bass or treble though and tends to distort a bit but that’s to be expected from such a relatively small, inexpensive unit. And while the four other BT speakers scattered throughout my abode (a Harmon Kardon Soundsticks, two Mediabridge Concertos and a Sylvania) all sound noticeably better than the DOSS, they’re also all plug-ins that are larger, heavier and more expensive so no surprise there. (Sorry for the perhaps unfair comparisons but I don’t own any other battery powered BT speakers, have always avoided them due to concerns over charging life span. Only bit the bullet here because the formerly terrific Sylvania I’d had in the bath just lost its BT component and did not want to repurchase because of said failure.)Anyway for the laundry/bath this speaker is fine, despite the complete lack of IPX protection (am keeping away from the sink and shower of course). Plunked down atop the front loading washer where, amazingly, it doesn’t walk around at all, even when maxed out during the spin cycle. Did not remove the metal grill for improved acoustics (as others have suggested) because afraid of eventually damaging the cones with my clumsy fingers; did jerry-rig some temporary feet from Glide dental floss containers and 3M double-stick tape though as the thin rubber pads with which it comes equipped don’t raise the speaker high enough for proper resonance (and unit still doesn’t budge.) Finally replaced with rubber stick-on feet:Self-Stick Square Rubber Bumper Pads for Furniture and Electronics .780\" inches (19.8 mm) x .380\" inches (9.7 mm) - 25 pack - BS04 BlackWill update with new pics once I’ve swapped out the dental floss... Okay they’re on and work great. Super grippy and not so tippy.Incidentally, when initially setting up this device, it asked for access to my Contacts, Mail, FB & Instagram accounts and various other stuff, supposedly for use in a car. This made no sense to me as the DOSS [ostensibly] hasn’t got a mic and thus can’t be used as a speaker phone or such, so am assuming its current bargain price is subsidized through spyware. (Of course I declined and so should you!)","timestamp":"Reviewed in the United States February 18, 2019","profile_id":"AFXELGFCHUONRO6PPJOEALNCJV6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R19HC8Y1LX1H3I","title":"5.0 out of 5 stars Great Sound for this size speaker","author":"MARGARET J SCOTT","rating":5,"content":"I wanted a little bigger speaker to Bluetooth music from my phone, it was a great price on sale, sounds wonderful and looks very nice. I bought the gold color.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AFBOVKBQEU3U5MSAZUCWQGNHRANA","is_verified":true,"product_attributes":"Color: Gold"},{"id":"R4EDYB4ZCUINH","title":"5.0 out of 5 stars It never was that easy to give 6 of 5 possible stars... :-)","author":"Doc Henning","rating":5,"content":"It never was that easy to give 6 of 5 possible stars... :-)The speaker arrived in a small plain box. I unpacked the speaker and the charger and charged the battery, which took only 2 hours.I was very curious about the sound - the only service I am interested in a bluetooth speaker (BS).I had tested a lot of speakers between 90 and 150 euro (the prices are comparable to the ones in Dollars in the US). Noone really satisfied me. Some had absolutely no bass. But they built a realistic stage, I had the impression, the music came from beside the speakers. But the bass was missing and voices somehow sounded a bit too sharp sometimes.Others could make deeper frequencies hearable. But it was not real bass. It was \"a kind a sort a\" synthetic. And almost all speakers which could reproduce lower frequencies, had more or less missing treble.The best speaker in this category up to 100 Euro or Dollars was the Denon Envaya mini. Very transportable! And natural sound charasteristics.But for my home I wanted a better BS which should remind me more to a stereo equipment. And in that category, I found the Marshall Killburn, which is my reference up to 200 Euro.Then I read a few reviews about the DOSS soundbox XL. I had had a small \"DOSS Soundbox\" once, which found it's way as a gift to a friend. And the sound characteristics were almost natural, but not enough lower frequencies. But for 30 bucks? It was really good.The XL was sold out in Europe, so I decided to order one in the US via Amazon.The first impression of sound was quite amazing. The bass is one-of-a-kind and absolutely unreached in plastic BS. Maybe also in general.But the treble... I missed some Hi-Hat and cymbals in \"my music\". I couldn't hear frequencies over about 10.000 Hz. I was absolutely disappointed. Again without exception very good reviews and a castrated sound? Then I saw a review with a hint to the fleece behind the grill. I removed it today. And now I am happy! Very happy! This is the best speaker I've ever heard up to 150 bucks! (Even more, it is not very far from the Killburn, which took me 185.) And it took only 90... And the difference without the fleece is huge in my ears! It's like another speaker!At the moment, the speaker is standing on my bed in the computer room and I am listening to jazz music with a string bass. It sounds absolutely natural. It's awesome!!! I love this speaker! Very close to a stereo equipment.The sixth star I'd love to give is for that reference status in my categories. In my ears, the speaker is a \"grand cru\" (french), a great hit!This review is a picture of my perceptions in the sense of hearing. Nothing more. Nothing less.Meanwhile I reinstalled the fleece between grill and speakers. After 3 more days of listening I found out, that the higher frequencies became stronger and stronger and finally were a bit too much and left the natural sound a bit.Now it is perfect. To me that means: the DOSS Soundbox XL needs a couple of hours and days for it's burn in. As some other reviewers already told us.","timestamp":"Reviewed in the United States February 8, 2018","profile_id":"AGVAELBS4F6HC3XK5KXTQZR7IRSA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1WXU5P2BBHG5N","title":"4.0 out of 5 stars Doss customer service is a joke! / Now they’re AWESOME!","author":"Sue Ellis","rating":4,"content":"UPDATE 1/19/19 I received a call from Lu with DOSS customer service regarding my problems with the two defective XL speakers I received and returned. He reassured me that receiving two defective speakers in a row was VERY strange and asked for the serial number so he could inform the company so other speakers in that production run could be checked for defects. To correct the problem he is personally pulling a speaker from stock and testing it for any flaws or defects and sending it to me at no charge to make up for all the trouble as for sticking with DOSS. I was impressed with Lu and his commitment to providing a quality product and outstanding customer service. The new replacement is on the way. Received my XL late on Thursday afternoon. Unboxed and put on charger to charg completely before using. On Friday morning, 19 hours later, the charge light on the back indicated it was still charging. I called the Doss customer service around 9AM Pacific time at the number listed in the manual only to get music and and finally an answering machine saying to leave a message and they would call me back. They called me back ( after they had already closed for the day ) and left me a message saying to call them back, which would be on Monday. Soooo, I contacted Amazon and reached Diago in customer service and explained the problem to him. He is sending out a replacement next day air at no charge and issued a return for the defective one.So before boxing the XL up to send back I wanted to at least hear what it sounded like. Inserted a micro SD card, turned it on andHOLY CRAP!! It came on at FULL volume. That’s when I found out that neither the down or up volume buttons worked. So I turned it off, took out the card and did a more careful look at the unit. Even tho the unit came wrapped in a protective bag, there were smudges and fingerprints on the speaker that looked suspicious. The front middle bottom of the grill has a slight bow to it like it had been bent or someone had tried to remove it. I’d bet that this unit was sent back to Doss by a previous customer.Hopefully the new one will be without defects and n pristine condition. Then maybe I can update my review and tell you about how it sounds and performs.UPDATE! I received the new DOSS XL early last week. It does have a very good sound ......that is till it quit! After using it twice for a total of 3 hours, it just stopped playing. Lights were still on but none of the buttons would work. I turned it off and it will not come back on even if plugged in to charge. I called Amazon customer service, since DOSS service is a joke, and they are issuing a return and refund. Amazon will only replace an item 1 so I will have to reorder a new one. Maybe the 3rd time will be the charm.","timestamp":"Reviewed in the United States January 5, 2019","profile_id":"AGVTIWIP5JCDNTCWATDRRP2IPNQQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2265NDY0TB3G6","title":"5.0 out of 5 stars best value&performance","author":"tomazon","rating":5,"content":"purchased 1st doss in 17 ... banged it out for 7 years on a reg basis ... internal battery started go lose power till it got down to only one hour with full charge. not my usual 4-5 hour listening period at near full volume. So I went shopping for a replacement. Did research on the current offerings, amazon reviews, you tubes reddit etc. Listened to comps at best buy walmart and friends similar units. many good ones, at this price point had to pull the trigger on my 2nd same unit.","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AEXFJCHVUTKJ32QDKLVAO74UPLYA","is_verified":true,"product_attributes":"Color: Blue"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:46:59","page":3,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=3","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=4","asin":"B071JN4FW6","page":4,"pages":313,"reviews":[{"id":"R1YFZRNA54EHWM","title":"4.0 out of 5 stars Good quality speaker","author":"Alex","rating":4,"content":"I have purchased speakers in this range from different vendors (Bose, Sony, Harmon Kardon, and the like). This item holds its weight it sound comparison. The unit feels solid. My suggestion is to compare prices and purchase the item which fits your budget. Know that this unit is of quality and should stand up to possible handling issues. The price is similar to a use/reconditioned high quality item. So that is a similar range of affordability. In summary, I recommend this item.","timestamp":"Reviewed in the United States March 5, 2024","profile_id":"AF2ZU2W2PXLFNZTGWN2ID3DNEV4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2TJ8JQIMGBMSL","title":"5.0 out of 5 stars Battery life, size and sound","author":"Shane S. Henry","rating":5,"content":"It costs a little more than I wanted it too. However, this speaker is a great buy.Pros: battery life is GREAT, sound is a 7 out of 10 ( good, not amazing), can buy a second and it will pair for twice the sound and stereo!Cons: max volume is not distorted but not as loud as I would like, price is a little high but acceptable for what you get.","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AFY6RY35BFKSVTM7NBNKYVMLARRA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Blue"},{"id":"R2BAQSCNFB4GP3","title":"5.0 out of 5 stars great value great sound","author":"Larry Ensor","rating":5,"content":"Speaker sound quality is subjective. That being said I have been an audiophile for decades. I have not listened to a lot of portable Bluetooth speakers. My ears have been trained listening to old school systems.My review is based on what I wanted to use these speakers for. Mainly outside, pool, patio area. Pool parties.I bought 2 of the smaller speakers that are popular. Which worked, sounded fine in the house, rooms. But did not cut it for my outdoor use.These speakers are plenty loud enough in a party situation. But not for a big loud party. At least not with just 1-2 speakers. They sound great from distance also. Playing from my pool area they sound great 150 away at the patio. They also sound great when listening from behind them.Keep in mind the quality of the sound is Totally based on the quality of source, the digital file recording. I use apple music and not all digital recording are created equally. Some have a lower sound output then others. Some are much more heavy on the bass or high end then others. I have a very large record collection, lots of albums that I have listened to for years. I know their \"sound\". A lot of digital files are very disappointing compared to the original recording. So don't blame the speakers, any speakers.My iphone eq app works pretty good with these. But I don't fool with it that much. The app is mostly presets. Not much of a true eq with lots bands to adjust.These speakers were very easy to to pair with a smart phone, iphone or not. I wanted speakers with a 3.5m output jack to use with a cheap flat screen TV in my kitchen. Big improvement over what it came with. The speakers easily paired with my apple tv box also.Battery life is good enough for my needs. I want to say around 6+ hours of continuous use at a recent party at full volumeI liked the speaker so much after a couple of days I bought another one. They stereo paired easily. Plan on buying at least 2 more. One of the most satisfying products I have bought in a long time.","timestamp":"Reviewed in the United States August 2, 2021","profile_id":"AET6S4NJZL63SZVN6TZNQMVMPISA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3T8LXMUDN4TLO","title":"4.0 out of 5 stars Make sure you got the RIGHT firmware upgrade process for the UPGRADED version","author":"H.C.","rating":4,"content":"The media could not be loaded. Update 10/26/2020:Alicia at DOSS support team took care of my issue very nicely. It turned out the team gave me the wrong how-to guideline for the firmware upgrade, which doesn't work with the UPGRADED speaker. My two cents is that you should carefully examine their how-to-upgrade-firmware email and contact to the customer service if it says \"Turn on the speaker and take the micro SD card out.\" You should NEVER take the micro SD card out before turning on the speaker for the UPGRADED version. Then the video attached will happened to you too.Wonders Tech sent me the the second replacement, and I was able to upgrade the firmware successfully. I'm still removing one star because of my time and extra effort I had to spend for the previous two speakers, but now this is a good boy shouting out good sound.Just one thing I want to add is, this speaker is not for someone who wants to listen to music at night while your roommates sleep. It will shine when you set up the volume more than 50, and its minimum volume is still pretty loud to me.I will update my review again if this speaker dies before the warranty is over.--------------------------------------------------------------------My experience about their customer support is pretty same with ToddInVA's review on July 25, 2020. Long story short, the firmware they emailed me killed this cool speaker.They gave me four options for the firmware: 1. Disable auto-off function; 2. Remove prompt sound; 3. Play music via TF card in random mode; 4. Combination of 1&2.I chose Number 4. Maybe this is my mistake because this firmware didn't work as they described and just shut down my speaker. I reported this to the customer service, but they just told me to charge the speaker while I already told them I was plugging it on all the time.I got a replacement through Amazon but ended up getting the same result (as the video attached.) Now both of the speakers do not power on. The customer service offered me to mail the microSD card with the firmware included, but I really don't think that will make difference. I'm just gonna return them to make my life easier.","timestamp":"Reviewed in the United States October 21, 2020","profile_id":"AGGVFAOEQS3UYRTEBNJEA47O3YLQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RF9O4CGDPM7UX","title":"5.0 out of 5 stars Love Music Then This Doss Will Brighten Your New Year","author":"Greg N.","rating":5,"content":"Thank you Doss Wow so Greatful to Hear. So Greatful for this Blessing of the Awsome sound coming from this Doss speaker just 1 them.Just got finished 🎶👂 to Mariah Carey singing Christmas song and Celine Dion singing Christmas 🎄Songs and others with this Doss 32 Watt Speaker. SO I had to ✍ you Doss for The sound of Stunning Quality. I have many Blessings in the life I was given. One of my favorite Things on this Earth is Sounds. I love Music and am Greatful for it. This Doss Bluetooth is the Best sound in Music I have heard and am saying so. It's Tremendous....One gigantic Advantage I have is a New Samsung Galaxy Note Ultra its called. I have also app inside the Phone that Doubles the Volume Output called SpeakerBoost Pro for Android and I'm sure for Apple Phones...This Boosting creates Unbelievable Joy to my Soul through my ears and Bass 🔊Drums Ect I'm so Happy I was guided by THE GUY UPSTAIRSMerry Christmas 🎅🎄 to me With this Speaker. Today I drove my Motorcycle to a Park on The Large Island of Hawaii in a Town called Hilo Hawaii and Put this speaker in Small backpack 🎒on my back and Had Breakfast at The Ocean...Stunning day ...I set down a Table about 25 ft from the Ocean and Took out this speaker and Sandwich and Played Hawaiian Music ....people who walked by stayed near to hear what I was playing Because it Was Powerful and Clear and Hawaiian music is So Beautiful sounding and I noticed people just hanging around to listen to This Stunningly Clear Music like I. This speaker is not small but I can say this ....I ride on the Big Island of Hawaii so Beautiful it is...and I will never be without this Speaker traveling Around on The Big Island forever on This Special Place With my Music NOW I CAN CARRY MY BIG Awsome Doss with me Always...like my Phone....Brothers and Sisters you could say....I love Big Loud Sound ...Like a Beautiful Voice of Mariah Carey Singing Oh Holy Night.......Brings Her Justice....Thank you Amazon and Doss making Lives Better for gregory here on Hawaii's big island.🎄and The New year Will be Better for Any soul Who loves Music With this Stunning piece of Art Technology from Doss.Merry Christmas 🎅🎄To all from 🌴The Big Island🌴 and The Happiest New Year Ever🕊🎄🎄🎄🎄🎄🎄🎄🎄🎄🎄🎄","timestamp":"Reviewed in the United States December 23, 2020","profile_id":"AGTNKHBWH7TSJSJ5WCQSOU2WGF7A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1XVQCJ4ID7B3Q","title":"5.0 out of 5 stars This speaker has Thunder","author":"Amazon Customer","rating":5,"content":"Amazing Bluetooth speaker, receive my unit 2 days ago I have been testing it out and it is simply amazing I found out about the unit looking at different reviews on YouTube and ran across (clavinejunkie) he did a great review and compared it again some good speakers. I've read other reviews of people talking about the rattling noise or air noise mine's came in perfect working condition the first thing I did was remove the felt that is in between the speaker Grill and the speaker itself as I was lifting up the grill at the bottom I did notice a clear thin rubber strip I believe this is what they did to correct the vibrating problem I didn't lift the grill once I saw it I then got some tweezers and pulled the felt out of the gap that I lift it up on the grill and press the grill back down. A friend of mine brought his JBL Xtreme over and the Doss speaker Bass notes were way deeper, I know the JBL goes down to 70 Hertz but this speaker goes down below 50 hertz even into the 40s with no problem and gave his top portable Bluetooth Bose speaker a run for its money . I tested the speaker out in several locations in my room which is 22 ft by 15 ft and the sound filled the entire room, I have not put it in the corner of my room which from the review says that it sounds even deeper. I have a California king Sealy mattress with a 4-inch cool gel memory foam topper and place the speaker at the foot of my bed and you can feel the bass vibrating the bed. There were some mentioning about the mids and highs could be a little higher however it wasn't a problem with me because the best music player that you can get is the jetaudio premium music player not the regular one the premium have 4 more additional processors that have been developed by some of the top engineers in music business, you can find it in the App Store for Android and Apple, Android users you can find it outside of the App Store buy searching jetaudio plus APK download. You can do so many things with this player that will correct any issues that you're having with mids, highs and there's so many Bass tweets that can be adjust without distortion, look up the features before downloading you won't be disappointed. I only listen to slow jazz music with different low and high tones as well as R&B slow songs the same. I was thinking about getting the Harman Kardon play to go but I am cool with this speaker. Thank you YouTuber reviewers and the ones who have left reviews on Amazon it help me make the right choice thank you have a blessed one. Thanks Doss for working on resolving the vibration issue.","timestamp":"Reviewed in the United States August 4, 2017","profile_id":"AGAT4KQSXA2WTRCSN2MHP4QQDPYA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R12MGMQTRFZLV8","title":"5.0 out of 5 stars Great sound for the price","author":"L Cris","rating":5,"content":"For the price, this is one of the better Bluetooth speakers. It produces great sound with plenty of range between the bass and higher tones. The volume is good for the size. I bought the bronze-ish color, and it looks great.","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AH3HF2P5ZN3PWNPTNZEIBFNNAVFQ","is_verified":true,"product_attributes":"Color: Gold"},{"id":"R3JVIHEPPR1ZQY","title":"5.0 out of 5 stars Absolute powerhouse for $90","author":"Hobie Cat","rating":5,"content":"This moderate-sized speaker far outpunches its weight class. I could not believe the booming bass that came out of this thing. Shakes the table it's on! Spund quality is stellar. Will order another and try the multi- speaker connection. Only downside is it does NOT come with an AC adapter. Otherwise, worth every penny.UPDATE: Got the 2nd speaker on a $59 flash sale. Arrived today and after a brief charging, tested the TWS 2-speaker connection with Aerosmith's 'Sweet Emotion', Beach Boys' 'Add Some Music', and KISS' 'I Was Made for Loving You\".OMG. Stellar. Sound out of this $140 pair of speakers is as fine as my floostanding Klipschs. The bass that comes out of these little things is unbelievable. Doss has hit a grand slam. As word gets out, these will sell out fast. Don't wait- get em' now.","timestamp":"Reviewed in the United States February 23, 2024","profile_id":"AHAWIU57W4OSNZMEDGYAHVZQ3CZA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3GHY1U6CZE1A","title":"2.0 out of 5 stars Wait until DOSS specifically addresses the issues and proves it.","author":"Brian David","rating":2,"content":"First off, I have to say that this is a stunning design. I build speakers myself at home and I picked this up to get some design ideas myself. I love the passive radiators they use on this thing! But overall, I was looking forward to testing it out for myself as I had heard great things about this unit and I'd love to have a great sounding portable speaker. Modeled after the Sony SRS X77 and tuned much better in my opinion, picking this up for $89 was a no-brainer and I tip my hat to DOSS for adopting this design. But... It's not quite there yet. The DOSS Soundbox XL suffers greatly from the enclosure not being totally deadened and dampened against the vibrations of the sub-woofer. The passive radiators in place will do their job thoroughly if the box was to be sealed better and deadened completely. Again, This is a great design, It's just executed somewhat cheaply. These currently available units are not deadened enough stop the buzzing fart noises from the ports in the back and the enclosure as a whole. The grill on these models now seem to have additional dampening to address some original complaints about grill vibrations. My units did not have grill vibrations or rattles. In my testing of this speaker, I decided to actually purchase two units and I've now sadly returned them both. I originally listened to Oluv's YouTube videos on this unit and when compared to other units I thought this was a good choice for my intended application. But they definitely suffered from the same issues you hear about in some of the written reviews as well as in Oluv's commentary. The first one arrived and sounded fine in the beginning. With only the loudest techno tracks being played at max volume causing this buzz like fart that you hear about. This began to get worse though over the course of the past few days and as I listened today, it seems like the Soundbox XL wants to literally vibrate itself apart. The buzzing from the back became very noticeable especially with the unit against a wall. It was not like this when I began using it and that was why I picked up the second unit. I really liked it at first. The second unit I bought though was much louder overall. It also had a much more distorted sound at lower volumes. It also buzzed a lot more from the back ports than the first unit. It also had a noticeably louder Bluetooth hum. I had two very different offerings of the same item. Still, with the second unit purchased, the left driver hissed loudly with a static like harshness when playing music and videos. The right driver operated closer to normal but was muted and less clear. This particular unit was obviously internally setup just a little differently than the first one I bought and the little 2 inch main drivers were possibly improperly sealed within their isolated enclosures. I boxed it up pretty quickly for a return as the sound was just unacceptable. I boxed the first unit up today for a return as well. If DOSS would dampen and deaden the enclosure better to eliminate the vibration issues, double down with some back plane absorption material, seal and deaden that back port better, pay stricter attention during the process in which they lay the foam seals around the drivers, specifically the sub-woofer. Then and only then will the Soundbox XL be a winner. Especially when the overall intended sound stage and presentation is easily on par or better than other portable units costing hundreds of dollars more. They should also probably use lock-tight on their screws too.Honestly, the normal listener might be OK with the shortcomings of this portable speaker. They may not even notice. But as stated, I build high-end bookshelf and tower speakers and based on my own 35 years worth of experience. I would stay away from this portable speaker until DOSS specifically addresses the issues that their production practices have introduced to the unit that should not be present.I was truly excited about it and I still want one. It could be the best in class! It looks amazing and if built just a bit better, it would surely be the one to beat... But in the long run, in its current state, I am a bit disappointed.","timestamp":"Reviewed in the United States October 22, 2017","profile_id":"AEFAPNPBK7JZO6PTCVPSCKU5KSFQ","is_verified":true,"helpful_count":105,"product_attributes":"Color: Black"},{"id":"RR1KSDK2P5I0Z","title":"4.0 out of 5 stars Upgrade from My Smartphone, Easy to Use, Not as Refined as My Bose Computer Speakers","author":"M. JEFFREY MCMAHON","rating":4,"content":"I do 5 workouts a week in the garage for an hour and my Android smartphone can be hard on my ears, thin and tinny, so I wanted to buy a moderately priced speaker to keep in the garage. After doing some research, I decided on the DOSS SoundBox XL 32 watts.Pros:1. Black non-nonsense styling is good for my garage.2. Easy to pair with my Android phone. I just went to my phone settings, toggled the Bluetooth pairing on and pressed the DOSS pairing button.3. Sound is a huge upgrade from my smartphone. I played Led Zeppelin's \"Going to California\" and the song was plenty loud. Podcast voices were much clearer and pleasant to listen to over the long haul.Cons:1. The sound quality is not that refined compared to my modestly priced Bose computer speakers, which only cost $30 more.2. While podcasts are fine, the music doesn't have a lot of separation.3. The sound quality on music doesn't match the effulgent praise I read about on all the reviews.4. As good as this sounds, I doubt I'd get one for the kitchen when my wife and I listen to podcasts. I may splurge and get a Klipsch Heritage The One II speaker.Conclusion: Lower your sound expectations for music, since the DOSS won't have the warmth and refinement of Bose, and get if you're a heavy podcast listener and you're speaker is going to be used outdoors or kept in a dank garage.","timestamp":"Reviewed in the United States December 31, 2020","profile_id":"AHDDBWPMHFWK32QXRZD5JOH257OQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:47:00","page":4,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=4","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=5","asin":"B071JN4FW6","page":5,"pages":313,"reviews":[{"id":"R1ARB5BP67MM3R","title":"4.0 out of 5 stars \"And if you don't expect too much from me, You might not be let down\"","author":"todd","rating":4,"content":"One of my favorite bands has a line in one of their songs that goes: \"And if you don't expect too much from me,You might not be let down\"This line describes this and pretty much any compact Bluetooth speaker ever made.I bought this to replace my tried and true Soundbot speaker that developed problems with the on/off switch and wanted something with a bit more punch. I have purchased at least five of these for family members based on the reviews but never actually heard one until this purchase. I eagerly stole away to my basement lair to open this long awaited package and turned it on expecting sonic pleasure. To my dismay, it sounded flat and lifeless. I almost threw it back in the box for a return, and then remembered that it was intended to go into the bathroom where to old speaker was. Once I did this, I was impressed. Given the smaller demensions and better acoustics of the bathroom it sounded understandingly better. The bass is tremendous, and most songs sound pretty good, however there are many that the vocals or a key passage to a song are very faint. So I tend to listen to what I know will sound good vs what I would like to hear. This is frustrating that most Bluetooth speaker manufacturers just assume you will be listening to urban music and as long as the bass is good, all is well. I would gladly take less bass and a better soundstage. At this price point I realize I am being picky but...... So, for a small room, this would be fine, but to think you are going to push any song in a large room and get a good soundstage you clearly have never had a decent stereo.","timestamp":"Reviewed in the United States May 27, 2021","profile_id":"AFPQJZWQ463BNZQ2HIOQYFIJYIHQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1BEEOZEHOAXMN","title":"4.0 out of 5 stars Pretty good sound","author":"ProAudio","rating":4,"content":"Overall sound quality is pretty good. Lacks high frequencies inn my opinion.Boasts \"32 watts\" of audio. No idea how they come up with a number like that. It can be relatively loud but as an avid audiophile for years I would estimate the audio to be in the watt RMS or lower range. watts of audio pretty loud in an enclosed room .Bluetooth connects rapidly as long as you don't have another device nearby.Also if you are streaming audio from your smartphone then get a call the radio mute and does not pass audio from phone call. No mic in the Doss box. Ok I guess if you don't mind your streaming source going away while you are on a call. This may be an issue with my Samsung S Plus, i don't know..As far as battery life it is far too early for me to say.Overall pretty happy with the sound quality and controls on the unit for volume up and down.I think that if the speaker is going to be disrupted by the phone call it should then be able actually handle the call. I have another bt speaker that does exactly that.Definitely a 4 star product","timestamp":"Reviewed in the United States October 17, 2022","profile_id":"AHRY3COKBMLTN3HVN6KL4WMDIY2Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R32W2J4W07FESF","title":"3.0 out of 5 stars Great sound, poor battery","author":"Tetherguy","rating":3,"content":"Wanted to give this item 5 stars but...I purchased this in November of 2022. It just died on me this past weekend (5/24). Used it about 1 or 2 times a week, typically less than an hour. This weekend it would not power up unless plugged in, then the next day will not power on at all. The sound is loud and great quality. Can hear it throughout the house with little distortion from a high volume. I am disappointed from the battery life, not from how long a charge lasted - that was good. From what little I used it I expected the unit to last longer than 18 months.","timestamp":"Reviewed in the United States May 6, 2024","profile_id":"AGGO77BTLJIWMV4QCCNZ4CYT5GYA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R7SMHKOYPKAXG","title":"5.0 out of 5 stars fantastic speakers!","author":"denise howell","rating":5,"content":"My old wonderboom died last night. I ordered this speaker and am blown away. I can hear all the instruments. I thought I’d lost some hearing, but this speaker brings it all back. I’m playing old songs, rediscovering just how gorgeous the sounds are. If you’re an audiophile, it may not be wat you want. But for about $74, this is the best of the best.","timestamp":"Reviewed in the United States May 9, 2024","profile_id":"AFYGESDMOVRIQYKTFXTQ5UZZ2GLA","is_verified":true,"product_attributes":"Color: Gold"},{"id":"R25WIFDL850EFW","title":"5.0 out of 5 stars Not only good sound but some what waterproof","author":"Amazon Customer","rating":5,"content":"I previously bought a Bose bluetooth speaker used a couple years and the battery took a dump. 36.00 for a new battery plus you have to solder new one in. Purchased the Doss speaker and for 65.00 it's an awesome deal. Buy two and have a great stereo sound! Update! The speaker sat out in a rainstorm plugged in, poured water out of it, still works, amazing","timestamp":"Reviewed in the United States May 9, 2024","profile_id":"AGXEDDLNMNC6GL7FSBO6I4I3CIDQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R19FWVLY29NCTS","title":"5.0 out of 5 stars Boom boom boom","author":"Kyle","rating":5,"content":"The media could not be loaded. This box has quite a bit going for it. I think it fair to focus on the pros and cons of this unit.Pros,Searching for bass from a portable speaker? Search no more, this has more Bass than any of the multitude of portable speakers I've ever heard or owned.Low distortion, even nearing Max volume.No rattles or buzzes except to the objects laying around it, (sincerely, it shakes the entire king size bed I own like a built-in bed massage)Simple to use.Good BT, with decent range.As you increase volume, it digs in its heels and pushes even harder instead of just distorting like most other units.Well constructed, the positive click on the buttons is a nice bonus, very tactile. The entire unit has a solid look and feel.No matter the volume level it produces excellent bass, so you can listen to it on low but still get the feel for the music as the punch is still there.Cons,Heavy on the mid-range, and you will need an equalizer to help tweak that out, a picture of the equalizer settings I use attached.Heavy as a brick, (and larger too)Battery life is short, adding an additional 18650 battery would help here tremendously. But this is to be expected considering the amount of bass and pure volume it produces, you got to put some juice in to get some sound out, and the 2200 milliamp hour battery could really use some help.It needs a little space to sing, it can easily fill a typical room with sound and Bass, it's awfully loud in a more confined space.That being said the unit is designed for bass lovers, it works well across all spectrums of music but is geared more towards Rock/Hip Hop thumping music, but it's still plays all other styles very well.You should buy it, I have paid a heck of a lot more for far more inferior products, it belts out far more bass and volume then even the higher end units.","timestamp":"Reviewed in the United States February 20, 2021","profile_id":"AGOEKUEVP4WJ5X3EQQWIC64GDEXA","is_verified":true,"helpful_count":16,"product_attributes":"Color: Black"},{"id":"R3KXCUNOJG33WP","title":"5.0 out of 5 stars Exceeded my basshead expectations and some","author":"GSAgent","rating":5,"content":"Coming from a Jabra Soulmate, two UE Booms, and a cheap insignia Bluetooth speaker, I am blown away by the Soundbox XL. The build is similar to my insignia bt speaker as i had a feeling this design had potential. It just needed more power inside the box to really shine. Doss has made that happen with the Soundbox XL which was a plus as I think this form factor just works with sound and bass response.I placed this in the center of my living room, sat on my couch and instantly fell in love with the sound produced from this little rectangle box. It really knows how produce lows all the way down to 30Hz and even a little further while high as crisp and clear. They really made great use out of the 12 watt sub which can easily be mistaken for a more powerful sub. Seriously, the lows are just amazing! If you ever heard \"bass I love you\" or \"bass I love you 2\" you must find it on youtube and play it though these speakers. I test all my speakers on this track because of the extreme lows and this speaker can really produce damn near all of the lows while the highs still rock easily. Imagine going to the restroom in a club and you hear nothing but bass. That's what this speakers does in my apartment when I leave it in the living room and go to the bathroom. This speaker is really just amazing.Bottom line is the speaker is affordable, loud, battery life is awesome, and the bass response is exactly what I am looking for. It's perfect for apartment living as it is a powerful speaker that does not annoy your neighbors as much. Actually considering purchasing 2 more for the left and right channel on my home theater using line in as its just that good in my opinion. If I could replace my car speakers with this box I would!Update: I use this thing just about every single day and I just love it. The battery life for what this speaker produces exceeds my expectations. It takes power to make this happen and Doss does a great job at it. I have no desire to purchase a Bose BT speaker just to have the same sound quality for way less. I'd definitely recommend DOSS to anybody. I'll be picking up another DOSS product soon for myself and a few for Christmas gifts this year. I wish I knew about Doss before I wasted money on previous BT speakers, especially the UE Boom.","timestamp":"Reviewed in the United States March 4, 2019","profile_id":"AFDQFLSGIHELX4LTAE5PYXQMNJUA","is_verified":true,"helpful_count":56,"product_attributes":"Color: Black"},{"id":"R2VTI6708QQJTZ","title":"5.0 out of 5 stars Love it!","author":"Alicia","rating":5,"content":"We now have 2 of these speakers and just bought one as a gift for someone else (because they loved ours so much!). It packs a huge punch of sound into such a small unit! We returned a couple other speakers that we had bought to try out because we were curious, but they just didn't compare to this particular Doss. The sound is crisp, deep, and loud. My only complaint would be the two newer versions of this speaker we've recieved don't have the kind of control over the volume like our first one did. You used to be able to turn the volume to a very low level that was perfect for close by background noise when your still trying to chat with friends. Now, sometimes the lowest setting is still just a bit too loud. Other than that, 5 starts all the way!!","timestamp":"Reviewed in the United States December 31, 2023","profile_id":"AEQKQ7QNYXJKU2GA5DKLAKSBJBSQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RWH52J01X7HDV","title":"5.0 out of 5 stars Huge Luxurious Bass, High Quality Sound, Low Price, Must Have","author":"Amazon Customer","rating":5,"content":"Incredible Sound! This Bumps! I would wager biggest bass by far in this price range and up. You can spend more and not come close to the deep Bass (the powered subwoofer punches way above it's weight sounding more like 100 Watts) and detailed sound made by The Doss XL. Where you see the price is maybe in the cabinet material, while solid and handsome it could have more feel, eg. the hard rubber coating on an Anker Soundcore, or the Tribit XGo. Even so, on the shelf it really looks Premium, sharp, piano black with silver accent around buttons which are shiny and glass smooth. Mine has black grill, looks nice anywhere you put it. Sounds fantastic! Huge fat rich bass and it goes Loud. With a little EQ action it's even better though not necessary. Straight YouTube sounds clean with deep bass, makes low frequency bass that other speakers in this size and class do not.I did not have any issues with vibration, loose parts. Front grill seems welded on. The only thing I did notice is at higher volume a bit of bass I venting out the rear ports, making a slight buzz but *only if you put your ear right next to it. The speaker drowns it out easily. A strip of black tape solved the issue. A lot of \"ruggedized\" speakers have rubber flaps to plug the ports, for aux, USB etc. This one could use a flap, or just some sealant inside. Shining a light in the grill shows it is secured and damped at many points, and I did not see a fabric baffle. Defintely not made on a Monday.Giving Five Stars because this speaker sounds Amazing and especially at the current price, nothing comes close. One more thing, I plan to put thicker foam rubber feet on the bottom to prevent it from moving around when really pumping. Mine has so far stayed put, on a grippy surface, but there are videos of this guy dancing across a tile floor because of the killer bass vibrating the case (which is pretty unavoidable with this much bass). Like having a huge sub in the back of a car, there is going to be some shaking going on. Putting it on fabric or some kind of pad would also keep it from wandering off. At reasonable volume it should be fine.My speaker is well damped with a very heavy duty enclosure, everything tight, does a good job of handling all the sound powering through it. Very accurate, full and smooth sound, easily fills a large room. Highly recommended! ⭐⭐⭐⭐⭐","timestamp":"Reviewed in the United States July 30, 2018","profile_id":"AGXAZR2ELUNBJ7FF5XDDEPFCQSKA","is_verified":true,"helpful_count":27,"product_attributes":"Color: Black"},{"id":"R3G7ZAP8K811BH","title":"5.0 out of 5 stars Great Sound! Great Price!!","author":"Guukzilla","rating":5,"content":"I am not an audiophile. I wish I was an audiophile. I own an Anker Soundcore Motion Plus (and several other higher end home audio speakers and systems and headphones) so I'll compare it to that.The Doss is cheaper and has much better out-of-the-box sound. It is hard plastic and has a weight to it that lets you know it is not a cheap wanna-be. The proprietary power cord and bulky design are the only drawbacks I can come up with for this speaker. I love the sound it produces. The separate driver dedicated to the low end makes all the difference. I prefer the the Doss to the Anker when it comes to just plugging it in and using it but the Anker does have a couple more features that make it worth the price. If you do not need USB-C charging or customizable EQ via an app, then buy this speaker right now. In all honesty, it took a lot of tweeking to the Anker Soundcore Motion Plus to get it to sound better to the point where I could notice it. I sleep with my speakers on and the Doss lasts a good 10+ hours on volume a little lower than medium and can last two whole nights on a low volume on one charge. Its heavy but I do not mind the weight.Tldr. Great speaker for the price. No usb-c, but has battery that will last at least a day. No customizable EQ but no need, sounds great and balanced with separate driver dedicated to low end.10/10 Would recommend to my friend's mother's friend's hot niece.","timestamp":"Reviewed in the United States September 19, 2022","profile_id":"AHCVESVY3YQ65WIYGPA74EKFKXEQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:47:02","page":5,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=5","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=6","asin":"B071JN4FW6","page":6,"pages":313,"reviews":[{"id":"R14VNOGUM3J970","title":"5.0 out of 5 stars great value","author":"jesse","rating":5,"content":"for the price I would say this speaker is perfect. it does have some bass too.","timestamp":"Reviewed in the United States June 22, 2024","profile_id":"AFSULWGQ4MVX3XGSVTHOJS5SCHRQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R370J89AJWQVVH","title":"5.0 out of 5 stars Amazing sound and power.","author":"Mike Pacelli","rating":5,"content":"I've owned and enjoyed the smaller Doss Bluetooth speaker for several years and it but it lacked the power that I wanted. This model of Doss is increadible!Not only does it have the power to project and fill a sizable room with perfect music but has resounding Bass with zero percepted distortion. In fact, the entire range of Hz from the highest highs to the amazing base tones are about as perfectly asany speakers that I've ever heard. Would give it six stars if available.","timestamp":"Reviewed in the United States March 28, 2024","profile_id":"AFRYO6EXHOBEZ5Z6SZMCIK3W4E2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RW23Z3V33GN0T","title":"4.0 out of 5 stars Loud, clean, natural sound but left me wishing for more features","author":"Amazon Customer","rating":4,"content":"I agree with the embedded video review on this page so I will try not to duplicate comments. Instead, having received the speaker yesterday, I will focus on my first impressions.It's not clear in the product title but the packaging clearly states this is a home speaker. It is not designed to be thrown in a backpack and taken for a hike or to the beach. The user manual contains the warnings \"Do NOT drop, hit or shake the device\", and \"Do NOT expose the speaker to excessive heat or direct sunlight for a long time\". Also, the speaker uses an AC power adapter that is not compatible with USB chargers used for phones and portable speakers.With that out of way, this speaker sounds amazing! I listen to a variety of music including pop, R&B, funk, hip-hop, early rap, smooth jazz, classic rock, and metal. In every case, the DOSS has a clean, rich, natural sound that I can easily hear throughout my apartment. I especially like that the speaker doesn't rely on a gimmicky bass boost feature to produce exaggerated lows. If sound quality were the only factor, I would easily rate the DOSS at 5 stars. Unfortunately, the speaker's feature set cost the DOSS a star.I bought the DOSS speaker to replace a 20-watt, name-brand, portable speaker that began to buzz and rattle. I primarily used that speaker at home, so a lack of portability is not an issue for me. While comparing the DOSS to rugged portable speakers may be unfair, there are features I consider essential that are lacking. The speaker supports a micro-SD/TF card and buttons on top control playback. However, there is no way to randomize track selection which makes no sense when you can easily have thousands of songs on a card. Also, those playback controls have no effect on Bluetooth devices connected to the speaker so you always have to have your phone, tablet, etc. at arm’s reach.Right now, I am torn on this speaker. My initial experience is one of pure listening joy interrupted by frustration whenever I want the slightest control over what I am listening to.","timestamp":"Reviewed in the United States March 9, 2019","profile_id":"AFKSBNZKOBGBFQAAQXWFGJCEINYA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R15P9J45A7XP1Y","title":"4.0 out of 5 stars Great bass for the size, very fragile speaker","author":"Jonah tiemann","rating":4,"content":"I purchased this speaker longer than 2 years ago for $40. It gave me exactly as I expected. Bass quality was amazing. Mids and highs are just OK. Bass may be too heavy for the speaker’s weight as (when turned almost to max volume) the speaker comes alive and starts dancing until it falls off of whatever surface you are playing it on. The bass is good unless you play it on max volume too much (Like I did) then within 2 months of having it, that room shaking bass diminished into something just average sounding. THE SPEAKER IS VERY FRAGILE!!! Plastic materials and nothing polymer or metal so keep that in mind. If you are not good at maintaining your technology then this speaker is not sturdy enough for you. Once you drop the speaker even lightly, the Bluetooth with no longer work well, the speakers will start buzzing and rattling. So in the end, don’t buy this speaker to impress anyone or to throw a party. The volume gets loud, but not loud like you would expect. The bass is great, until it gets put to the test. The speaker is presentable, until it gets dropped. If you’re looking for something of quality, but a Harmon Kardon Onyx studio 6. You won’t be displeased.","timestamp":"Reviewed in the United States February 15, 2022","profile_id":"AFVDXM4WTIAKDG6LA3JGQJKEWZIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1E10HRVESRFV2","title":"2.0 out of 5 stars Good BUT missing important feature that Soundcore has","author":"Amazon Customer","rating":2,"content":"DOSS bluetooth speaker works fine - but it is missing a key feature that forced me back to my old Soundcore bluetooth speaker.When you stop listening to sound, DOSS goes to sleep and you have to PHYSICALLY press the power to turn it back on.I was reaching over to turn it on dozens of times per day.Other speakers such as the Soundcore simply play sound as soon as you press play on your computer!!After a month of using DOSS the bass sounds really started rattling as if the speaker was shaking against the ground - making a really really awful noise - unbearable.The Soundcore does not have this issue with bass soundsDO NOT BUY THE DOSS when something like the Soundcore exists - better in every way.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AHBU4NBK7TGSJTS36N67DFITF7XA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1RAWK9GM92GCG","title":"2.0 out of 5 stars Pretty good sound, poor battery life","author":"Cthulhu","rating":2,"content":"I really wanted to like this speaker, but it has a couple of major flaws. I'll try to go into the pros/cons so that I can keep this review short(ish).Pros:Sound quality- Pretty good sound quality for the price. It's not quite as clear as some other speakers I've heard and can occasionally get slightly muddy, but it performs well for the price bracket. Some genres really bring out this things sound, like rap and some indie and metal. Occasionally it can get a little buzzy and sound a bit artificial, but it performs pretty well. Not the most natural sound. Maybe it's the chip inside.Good build quality- It's not drop resistant and I'd be scared to drop this from any height with how much it weighs, but the materials look nice and hold together well.Neutral:The bass- The dedicated subwoofer really seems to shine, at least at lower sound levels. But the more you turn it up the more it becomes overcome by the mids and highs. It's like the subwoofer constantly stays at one power whether it's low or high, so when the rest of the speakers get turned up it becomes pretty underwhelming.Sound effects- The sound effects aren't the best. The on/off jingle is a bit louder than they should be, and the pairing/unpairing sound is the device connect/disconnect sound from Windows 10. Didn't really bother me but it might bother some people.Cons:The feet- I'm not sure what you actually call them, but I'm talking about the little plastic parts on the bottom of the device that are supposed to keep it from moving or slipping. They don't work very well, if at all. This device puts out a lot of vibration, and the device will vibrate and fall off of surfaces, unless they are very clingy surfaces to rubber, like wood and stone. Tial, porcelain, plastic, etc., will seemingly throw your device off of them.Proprietary charger: This device uses a 12v dc charger instead of the standard micro-usb or the newer usb-c. The only way that you can charge this thing is by plugging it into the wall, which means no charging on the go. This is a deal breaker for people who like to travel with their speakers, or those who plan on hiking or camping with their speakers. Also, no charging your phone.The battery: Holy hell this is awful. The battery is the deal breaker for me. The advertised 10 hours of battery life is incredibly generous, and I have never gotten that much out of it. At medium volumes, I'm lucky to get even five out of it. Most of the time it seems much closer to three. Most of the time I use this in the morning for about an hour while getting ready. I did this for three days, and today I didn't use it in the shower but brought it in the car with me for music on the way to work. It died after about 10 minutes, putting the overall play time from a full charge to dying at about 3 hours 10 minutes, if that. I doubt I used it for a full hour most of those days. Combine this with the fact that you cannot charge it on the go, this device is worthless unless you only plan on using it at home.Pairing: Pairing can be inconsistent. Sometimes it pairs automatically before I can even make my way to my Bluetooth screen, and other times it takes 1-2 minutes or multiple restarts before it allows me to connect.The problems outweighed the pros for me, so I'm sending mine back. I think I'll stick with Anker (or Soundcore) from now on.","timestamp":"Reviewed in the United States March 12, 2020","profile_id":"AGNTA2B53RVNH2Q4T7LNTI7D7DJQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2TM6QZU12H3CH","title":"4.0 out of 5 stars Good natural bass for such a small package. but...","author":"UnNatural","rating":4,"content":"Update as of Sept 2019: I have purchased 8 of these Doss speakers. I kept 2 (running together using a Y cable) and the other 6 I gave as gifts. Out of the 8 only 1 had with an issue where the battery charging wire inside came undone. One of the speakers had a couple loose screws in front behind the metal screen. Other than that, no issues.This speaker has the potential to be one of the best under $400. The bass is natural and not over inflated by DSP enhanced software like most Bluetooth speakers. Unfortunately because it does not have low volume DSP the bass is lacking at levels below 20%. The sweet spot for this speaker is between 30%-60% volume. Within those levels the sound quality is really good with bass playing down to 30Hz. Turning up the volume past 70% cuts the bass back and makes the speaker sound a little harsh. Using an EQ greatly helps, but not all devices have adjustable EQs. The enclosure looks nice, but the bass is too much for it. The whole speaker vibrates, so do not place this on a shelf while jamming and walk away, it will walk itself off the shelf to the floor. Doss needs to add vibration dampening for the entire enclosure and add bass at lower/higher volumes. I opened up my speaker and added 3 layers of vibration dampening material and glued a rubberized sheet on the bottom, now everything works great and it stays in place! While it has its negatives, it is still a lot better than most others at the same $60 or below price range (the current discount price during the time of this review). If you listen to music at medium volumes all the time, indoor or outdoor, and want exceptional natural bass from an actual subwoofer, this speaker is for you.Pros:Bass frequency range (very impressive for a Bluetooth speaker)Enough sound to fill a roomClassy look and button feelCons:Cheap plastic enclosureMissing bass below 20% and above 70% volume","timestamp":"Reviewed in the United States April 1, 2019","profile_id":"AE6XGXTYD27C22JMVZVCGU43Q56Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R1ES9FIVJOUNGP","title":"5.0 out of 5 stars This speaker is amazing!!! Get yourself one now!","author":"Corey Furmage","rating":5,"content":"The Soundbox XL Speaker has been getting quite the buzz lately. Sure, Doss isn’t as popular as other brands like JBL, Bose, UE or Sony. But, I can see that changing very soon. This speaker is amazing and definitely holds it own. With 2 drivers, 2 passive radiators and 1 subwoofer, this thing sounds so good. Has a 2200mAh li-ion battery which gives about 10 hours of run time, but of course this varies based on volume. Connect your phone with Bluetooth or connect with the provided aux cable. But, wait. There’s more. There is even a slot for a micro SD card, which you can play music that way without even having to mess around with your phone or iPod. Speaker is black with a basic, straight forward design. Not water proof or water resistant, which isn’t a deal breaker for me anyways, since I’m not planning on having this speaker out in the rain, or by the pool, shower, etc. Size is about 12 inches long and 5 inches tall, weighing in at about 4 pounds. I would say it lands in between the mid and large bluetooth speaker category. The sound this thing produces is quite mind blowing. Has a nice balance of lows, mids and highs, and actually gets pretty loud, considering it’s size. All this talk about the speaker, and I didn’t even mention one of the best things about it, which is the price. $90!!! And it’s even on sale at the moment for just $60. Most other speakers in this class are around $150 - $200. But, the Soundbox XL is more than half the price, than it’s competition. This thing is awesome!!! I compared the Soundbox XL to my Sony XB30 Speaker, with a handful of different songs, and the results varied. Certain songs sounded clearer, and more well balanced on the Doss, while other songs had more bass, sounded louder and clearer on the Sony. Overall though, I would say both speakers are pretty comparable. Both have their ups and downs. But, then again, the Sony is usually double the price at $150. So, getting the Doss at more than half the price is a no brainer. In closing, a portable bluetooth speaker of this size and quality such as the Doss Soundbox XL is just way too hard to pass up. Get yourself one now!","timestamp":"Reviewed in the United States September 21, 2018","profile_id":"AFGBMP55N2IBYVSLKB2NDPU5PLBA","is_verified":true,"helpful_count":33,"product_attributes":"Color: Black"},{"id":"R3NLPJHZFTUUMD","title":"4.0 out of 5 stars This little speaker packs a punch!","author":"Jerri","rating":4,"content":"Ok, so this is the 7th Bluetooth speaker I have ordered over the past few months. Based on reviews and price I thought this just had to be the one. It did not disappoint like the others.The positives are: the portability is on point, lightweight, sleek and doesn't look like a speaker. It has the volume and change the tracks forward or backwards on top. No fumbling in the dark when you want to access it. The battery is on point. It came with the battery partially charged. After a full charge, I still have yet to need to recharge it. I have had it 3 days now. With the volume at max on phone and speaker it is a powerful little speaker. Careful it will vibrate off of hard surfaces. It does allow for multiple Bluetooth connections. However most Bluetooth speakers don't allow it. I would recommend buying 2 of these if you truly want a mind blowing experience. 💋Negatives: No LCD screen to know anything about whats going on. The mode button blinks at different speeds based on which mode its on. The light itself is so very tiny. No remote control. A handle on the speaker would be nice. The bass is not like I read in the reviews. For $30 more you can get the JBL pill Bluetooth (that speakers bass is mind blowing). I am a bass whore. I like to feel my music and I get its a portable Bluetooth speaker).All in all its a powerful little speaker at the price range","timestamp":"Reviewed in the United States January 7, 2021","profile_id":"AFBKQ3HSZP66JL5DNDWMJKP35RIA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"RZXHQMUOZMSNO","title":"5.0 out of 5 stars Great Speaker","author":"Chris","rating":5,"content":"I shopped around for a while before I ordered this speaker. I had had a couple smaller speakers that didn't really do it for me in the bass department. The size, volume and woofer were key in my decision to buy the Doss XL. Speaker is big enough to play in the back yard. In a small room it is super loud. I drive a truck without a sound system, and this thing FILLS the cab. Can't even turn it to full volume! Rap and metal sound great on it. Blutooth sync is solid. I see the loose piece flapping issue mentioned in other older reviews, I can confirm that it is not an issue anymore. I have had 2 Doss XLs now and neither has any sound issues. 5 stars for sound!Another key feature of the speaker is its simplicity and clean lines. it is functional and unobtrusive. Do you want to see your speaker or hear it? Tuck this thing in a book shelf and it disappears. It has kind of an 80's vibe. square and solid. Compare it to an old boom box and you will get the idea. I just wish it had a handle like those old boom boxes.Lastly, I have had the most pleasant customer service experience in my life with DOSS. Speaker worked fine for ~9 months. Then, the buttons stopped working. It could power on fine, but play, pause, volume, etc. just didn't work. I went online for a fix, people mentioned a firmware update. So, I emailed DOSS customer service about it. 20 minutes later, they asked for a video of the issue. Did it. 20 minutes after that they asked for a picture of my serial number and my address. The next day they shipped me a replacement speaker! 2 different service reps wrote to me, and they mentioned talking to techs about the problem. It is obvious that they really care about their product and about their customers. Oh, and I think this all went down on the weekend, like they emailed me on a Sunday! great customer service.","timestamp":"Reviewed in the United States June 14, 2019","profile_id":"AGVT6MSFFM7D555Z3GGZC7RHIDUA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:47:05","page":6,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=6","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=7","asin":"B071JN4FW6","page":7,"pages":313,"reviews":[{"id":"R2P56A4CZ62SY9","title":"4.0 out of 5 stars Incredible low frequency response for a Bluetooth speaker","author":"M","rating":4,"content":"I've tested many Bluetooth speakers from Sony, Cambridge soundworks, and anker, and have listened many demos of speakers online recorded with binaural microphones and the only other speaker with comparable sub-bass range is the Harman kardon onyx studio 4,which costs twice as much and is arguably less capable than this speaker. This speaker has been tested to produce audible sub-bass down to 20-ish hz. As for personal taste i prefer a brighter eq tuning that makes midrange and vocals more prominent but i wouldn't say this speaker has suppressed midrange.It has a neutral tuning which should appeal to more people. And in any case one can download an eq app to change the characteristics. I just don't find those apps convenient and i wish Bluetooth speakers would provide the eq functionality in the speakers themselves accessible from a smartphone app. But none do so that's not a criticism of this speaker. The only downside of this speaker is the tradeoff for deeper sub bass, it's bigger and heavier than a truly portable Bluetooth speaker. You can't haveboth ways though and i think most people will prefer err on the side of better audio quality.Highly recommended, but first test the speaker at Oluv's Gadgets (you have to use headphones!). Disclaimer: i have no affiliation with oluv's site, but you absolutely have to know about it if you're looking at Bluetooth speakers (in fact, i don't like his reviews. he's a pseudo-audiophile with imo poor taste in music and a huge bias for bass-boosted speakers, but his speaker comparison tool is just oustanding). Another disclaimer is that I tend to listen to these speakers at low to moderate volume with only one or two people in the room. I haven't tested them for party use or at max volume.In summary, i would recommend this speaker to someonewho misses having an audio system with subwoofer but doesn't have the space or budget for that and is not looking to blast the volume of their music.","timestamp":"Reviewed in the United States September 15, 2018","profile_id":"AG2WOI7LAL57QO4KYU5BNYJKEE3Q","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"RPAO3JX917PZ9","title":"4.0 out of 5 stars Refined sound at a great price, but not a boombox by any means.","author":"C. Thistlethwaite","rating":4,"content":"Pros: Solid feel, 8+ hour battery life, and wide frequency response with good low end sound from the 5\" subwoofer.Cons: Not as loud as you might expect from a speaker of this size and power, with very directional high-end frequency response, no equalizer function and poor stereo separation.The DOSS SoundBox XL has a brushed plastic finish and is heavier and larger than most similar portable tabletop bluetooth speakers. It has a solid feel and appears well made. The speaker's strong bluetooth connection and tactile buttons on top of the unit make it an ideal companion to pair with an Echo Dot for a superior streaming audio experience.This is not a particularly loud speaker with it's 32 (peak) watts of power being divided with two 20W drivers and a 12W subwoofer augmented with two passive radiators all facing forward. As a result the sound is very directional. You will stop hearing a lot of the high end response and all of the stereo separation unless the unit is directly in front of your ears. All that said, the refined sound of the DOSS SoundBox XL sounds much better than my Bose SoundLink II, which sells used here on Amazon for over twice the cost of the XL.Other commentors have noted that at high volumes the speaker can actually move across the surface it is on despite the four rubber feet on the bottom of the unit and that the speaker grill can rattle. It is fairly easy to overdrive this speaker, but at normal to moderately loud listening volumes you will not experience any of these issues.DOSS calls this speaker the \"best party companion\", but I would disagree. Instead, check out louder (mono) Rockville ROCKBOX 6.5\" 100 Watt Portable Rechargable Bluetooth Speaker w USB/SD if this is what you are looking for. Otherwise, the DOSS is a great buy.","timestamp":"Reviewed in the United States July 1, 2018","profile_id":"AHJQUCZMF4NADLHXZN77MJSST7RQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R2YC965Q4D2BJX","title":"5.0 out of 5 stars Coming from a serious sound snob.....","author":"SarahX","rating":5,"content":"Update March 2020: I ordered the \"Newer version\" of the SoundBox XL... (the SoundBox Pro)....... and immediately sent it back. The numbers and description made it look like that one was better............ but, hearing it first hand.... I sent it back. So I ordered this one again (the SoundBox XL).... and I can't wait to get it.*********Update... Feb 2020 - I just need to say........ 2 days ago, my beautiful speaker that I loved so much (yes, this Doss one...) fell off my desk and the quality immediately dropped to a fraction of what it was.............So I re-ordered, got it today, and I noticed that the amazon box was a bit banged up........ and my first thought was.... if my first speaker took one dive onto the ground and then wasn't usable anymore for me................. WHY WASN'T THIS AMAZON BOX LABELED \"FRAGILE\"??....So.... I opened it up........ turned it on........ and immediately knew I needed to send it back.Moral of the story........If your Doss speaker doesn't sound incredible right out of the box.......... I'm willing to bet it hit the ground too hard at some point on it's delivery to you............... because my first one..... lol I can't even believe how much I appreciated the sound quality from it...........Maybe needless to say, I have to return this one.*********************July 2019I love this speaker. I've been through so many speakers and headphones, it really is ridiculous........ but high quality, bass bumping, crystal clear sound is one of the most important things in the world to me.......And I'm very happy with this speaker.I also bought the DOSS Traveler....... and though that one is radically different (I mean... it's a LOT smaller...).... I use my big one to play music, and my baby one to play podcasts....... at the same time........ so I get the best of both worlds. I'm learning while listening to music that makes me happy.If you're really picky about high-quality sound that will make you MOVE though...... definitely get the big one instead of the travel version.I'm very happy with this brand, and both speakers.","timestamp":"Reviewed in the United States December 3, 2019","profile_id":"AHBTIGDJWHQ5XODX34YCIRFHYWVA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2YW6MJOS97KG4","title":"2.0 out of 5 stars Muddy and boomy sound","author":"dp988","rating":2,"content":"I did a lot of research on this little speaker and after all the great reviews, I ordered it. Now i'm not a stingy audiophile but I do have a lot of A/V equipment in my home and wanted something simple and cost-effective for my work office. When I got this speaker, I was impressed with its design. Seems well built. But then I connected it to bluetooth and the sound was horrible. muddy and boomy. No clear vocals or highs. Simply terrible! I kept playing it, hoping it would \"break in.\" It never did. I also tried using a dac from my computer using the 3.5 input and played lossless files. No improvements in sound quality. Back to Amazon it goes!","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AFBKQALHUAWHZRYJCOWCG7FY45LQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Gold"},{"id":"R3BX4KFSROT5MI","title":"5.0 out of 5 stars One of the best value for your buck BT speakers available!","author":"G.D. Campbell","rating":5,"content":"Despite my first impressions, this is a fantastic speaker.I was made aware of this speaker by Oluv, of Oluv's Gadgets aka ClavinetJunkie on YouTube. He is a true audiophile.Oluv typically reviews bluetooth speakers that are much more expensive than this one. He spends his own money and typically reviews speakers that cost several hundred dollars, in contrast to this one which cost me $90.When I first listened to this speaker, it was in a large room, and I was basically testing it against the distance I usually use for much larger speakers like the Aiwa Exos9, etc. At first I was disappointed. Later on, I moved the speaker into my kitchen while I was cooking dinner, and the speaker really came into it's own. The bass response is remarkable and the sound staging (for a speaker of this size) was quite impressive.Two caveats: It is not tremendously loud in comparison to many BT speakers, even at full volume. Also, as detailed in Oluv's video it is best to pull the front grill off and remove the fabric liner inside for the best sound. Otherwise the bass will contribute to rattling. With the fabric liner removed it has not been an issue for me thus far. The front grill does not immediately appear to be easily removable, I thought mine wouldn't come off. Just push your fingertips into the recess around the grill and methodically pry. It will come off.Due to the fairly impressive bass response of this speaker, it definitely has the potential to vibrate itself right off of whatever elevated surface you might have it on. So keep that in mind if you don't want it to take a several foot tumble onto the floor.This speaker is apparently a copy/clone of the Sony SRSX77 which costs nearly $300. The difference being that this speaker supposedly has superior tuning to the Sony unit. (I haven't tested the Sony speaker, so this is merely hearsay)Next to the $20 Monster Hotshot, this might be the very best value for your buck bluetooth speaker currently available. If you want to put some smiles on your loved ones faces, buy a few of these to give as Christmas gifts this year.","timestamp":"Reviewed in the United States August 5, 2017","profile_id":"AH7HGRKII63JOKQXYOWH3FIPKCEA","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R2OIU4X66IJEAM","title":"4.0 out of 5 stars Glitchy after 8 months","author":"Cassaundra B.","rating":4,"content":"The media could not be loaded. When I got this speaker I was SO HAPPY. Lemme tell you the quality of the sound is what I've been searching for in a speaker for YEARS. I'm giving this a 4 star review because after about 8 months of having the speakers it started skipping songs. I tried to see if it was the music app I was using or maybe the device, but it happened with every single music app and device (even friend's devices). I tried to look into this with no luck as to what the source is. I've had this speaker in the same spot in my living room. I keep it plugged in and I dust it so I know for fact there is no water or dust damage or even low battery issues. After the skipping started happening it started turning on and off by its self. Or I would turn it off and it would turn itself on and connect to a device and start blaring music-which wasn't pleasant for my neighbors while I was at work (the sound quality is still beast). Now the speaker only skips on occasion, but the speaker is controlling the sound on my computer. I'm like fighting with a 4-year-old to turn the sound down on my computer while it keeps turning it up or vice versa. It also recognizes that I'm pushing the buttons on it (i know because if I push two at once it makes a computer error sound), but the buttons don't do what they are supposed to do.Long story short I love this speaker and I want a new one, but the technical issues I've been experiencing make me hesitant to buy this same speaker again.","timestamp":"Reviewed in the United States December 8, 2019","profile_id":"AEVLEXKJHF35IJMHB5KYBCE5LJ2A","is_verified":true,"helpful_count":16,"product_attributes":"Color: Black"},{"id":"R20WU4WXGDFQAA","title":"3.0 out of 5 stars Beautiful sound & customer-focused customer service","author":"Gadget Boy","rating":3,"content":"After viewing clavinetjunkie's glowing Youtube review of the DOSS Soundbox XL, I decided to purchase the speaker. After charging the speaker, I linked it to my Samsung Galaxy S6 Edge phone. On the initial 2 attempts the speaker would not connect to my Galaxy phone. On my 3rd attempt I followed troubleshooting steps in the tiny printed use manual - - hold the Play/Pause button 5 seconds - - and it worked!I played 3 songs: Hallelujah by Jeff Buckley, Now We Are Free (Maximus Mix) by Hans Zimmer and Lisa Gerrard and Trickle Trickle by the Manhattan Transfer. I was really pleased with the crisp, clean highs, the full mid-tones and the deep, punchy bass.The battery appears to be DOA. I read the user manual and read through the Doss website and saw references to a 30-day policy and a one-year policy but wasn't sure what I needed to do to get these issues fixed. If the Doss customer service reps monitor these reviews, please let me know what I should do to get my speaker repaired.Because the portability of the speaker was very important to me I can only give a two star rating until the battery issue and the other power button issue is resolved. I hope you found this review helpful and I'll update it if anything changes.***************Update 10/25/17DOSS customer service came through for me, sending me a speaker that they tested before shipping it to me. I've been using it for a little while and the speaker sounds great. The battery is functioning normally allowing me to move it around the house to my heart's content. Consequently I've revised my rating to five stars.And here's an exciting piece of news; the customer service rep included a handwritten note to me (extraordinary) and said DOSS was preparing for the release of a new version of the speaker that will address the deficiencies and who knows may deliver a while lot more!***************Update 4/27/18I bought a third speaker but unfortunately I cannot connect to the speaker via bluetooth. I tried following the troubleshooting instructions but no luck. I also tried using a second cell phone to connect via bluetooth and no connection. Help! Two defective units out of three. That's crazy!***************Update 9/18/18The bluetooth on my third speaker failed. With quality issues on two of three speakers I've reduced my rating to three stars. I can still use the speaker using the aux input but it's no longer a \"bluetooth\" speaker. Disappointed with the quality control on these speakers.","timestamp":"Reviewed in the United States October 14, 2017","profile_id":"AFM33QVZ3DI6C5ZUOA27VJJMZJCA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RY1C16I8KMWT4","title":"5.0 out of 5 stars Revised Review after help from DOSS!","author":"Jerry","rating":5,"content":"Revised Review:Did not Know this, DOSS emailed me:1) For Mode button, this particular speaker has three different audio input modes: Bluetooth, 3.5mm aux cable, or a micro SD card.The mode is only needed when two or more audio sources are present at the same time, so the user can toggle between different input sources.If you are only using one input source at a time, there's no need to adjust the Mode, as the speaker should recognize the correct input mode automatically.2) For Bluetooth connection, you have paired your phones to the speaker already, so as soon as your speaker turn on, the speaker have a memeroy connection and will reconnect the latest bluetooth device.Hold down the Play button for 5 second. This should delete all the paired devices in the speaker, so it won't automatically connect to previously paired devices again.3) Connected to my Mac, IPAD, and Phone and listened to my favorite songs. The Bass is very deep. One thing I would like is ability to adjust treble and bass.4) I talked to my Son about TF cards. My Son says he records his piano sessions on TF cards and carry them to play . That's cool!Sound is as advertised. I'm enjoying the speaker very much. I ordered the carrying case to make travel convenient.Thank you DOSS for the quick reply Information.Old review:First, I know I will never find use to insert a TF card. My unit arrived 12/14/18 and I discovered the mode button is useless. Pressing the mode button does nothing. The mode changes only when a TF card is inserted or an aux cable is used. The volume buttons work after several presses. The sound isn’t all that great. I’ve heard Jbl speakers and they are much clearer. I purchased this and unit because of the great reviews , therefore, the reviewers may be company beneficiaries. I’ve noticed that when I change Bluetooth connections, it’s difficult to connect another Bluetooth device after disconnect. I have to turn off the unit then connect Bluetooth to another device. You live and learn!","timestamp":"Reviewed in the United States December 15, 2018","profile_id":"AFXXE2MMLVFSSWKWV3FIQAOMKTUA","is_verified":true,"helpful_count":8,"product_attributes":"Color: Black"},{"id":"R30NWHYLGAEKE0","title":"5.0 out of 5 stars I'm hard of hearing and it is good enough for me!","author":"jawspaws","rating":5,"content":"The DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound is loud enough for me to use in my shop. My shop has about 45 to 50 decibels sound all of the time. I have a 60/40 hearing loss and this speaker plays loud enough for me to hear without playing at full volume. As far as charging the battery, I use an Arlo 5v 2.5-amp charger that chargers it in about 4 hours. The speaker has a nice sound quality and lots of bass. One feature I really like is, once it has connected to my Samsung TV, I can use the Samsung remote to control the volume of the speaker. I would recommend this speaker to anyone.","timestamp":"Reviewed in the United States November 3, 2023","profile_id":"AHWH7UIY5UCDUXM2QNSF7NAGNCHA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2FOMP467ZNUUF","title":"4.0 out of 5 stars BUYER BEWARE WAS SOLD USED SPEAKER OR RETURN UPDATE!","author":"Robert Clark","rating":4,"content":"First let me start by saying that i really like this Bluetooth speaker, it has a good build quality and pretty good sound for the price.The reason why i gave it a 2 star rating is because when i received the speaker i didn't noticed anything wrong at the time but the next day i was in my kitchen cooking my daughter breakfast and i was playing music on the speaker and i picked it up to move it and noticed at top my speaker grill there were 2 pry marks like as if the speaker grill has been removed so i decided to remove the grill and first thing i noticed is that there is suppose to be a fabric under the grill so that you cant see the drivers through the grill,that was missing and to make things worse, all of the drivers was coated in dust and lint so common sense told me that this is not a brand new item.I don't know if they sent it by mistake or they removed the fabric to stop the rattling noise before shipping it out to me, who knows all i think this is a good speaker for the price you pay but just make sure you are getting what you are paying for.I am a eBay seller as well and i know this is bad business practice. UPDATE: THE DOSS COMPANY REACHED OUT TO ME TO TAKE CARE OF THE PROBLEM AND GAVE ME A $20 DOLLAR REFUND OFF OF THE SPEAKER. ALL IN ALL A GREAT SOUNDING SPEAKER FOR THE PRICE AND THAT'S HOW YOU CONDUCT GOOD BUSINESS.","timestamp":"Reviewed in the United States March 7, 2019","profile_id":"AGTDID6O4XMTTUYYCKK2UIW4QNVQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:47:06","page":7,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=7","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=8","asin":"B071JN4FW6","page":8,"pages":313,"reviews":[{"id":"RI2YX1X6F898C","title":"5.0 out of 5 stars Best bang for the buck Bluetooth speaker of 2017","author":"chromedream","rating":5,"content":"For the price, this speaker is extremely good. It's probably setting the benchmark (at the time of this review) in the sub-$100 class of bluetooth speaker -- and honestly maybe even above that. The sound is full and lively; from a casual listener's perspective, the DSP is tuned really well. For comparison, I have the Bose Companion 2 Series III computer speakers hooked up to my Mac via 3.5mm jack, and using the same track in iTunes, with no EQ on either source, switching back and forth between the Doss SoundBox XL connected to my iPhone via Bluetooth and the Bose connected to my Mac via 3.5mm jack, the Doss sounds noticeably better, even with virtually no stereo separation as compared to the separate Bose speakers (for fairness, I also tested using the 3.5mm jack on the Doss hooked up to my Mac, and the results were the same -- the Doss sounded better). Sound can be pretty subjective between different sets of ears, but I think you'd be pretty hard-pressed to find someone who isn't blown away by the sound coming from this speaker, especially for the price. As an added bonus, it has what looks to be a micro-SD card slot to play music from (it's labeled as \"TF Card\" in the instructions) and the aforementioned 3.5mm Aux jack to hook up an external source, like an Echo Dot.The only real drawbacks I can mention are that it doesn't charge from a standard micro-USB (which may be because it requires a higher power draw than that can provide) and that it doesn't get super loud, although I think the vast majority of people would find that it gets plenty loud enough for indoor and most outdoor usage. It's also not the most polished consumer experience around; it's what I call a \"Shenzhen special\" -- the packaging and instructions are bare-bones and the functionality is basic. That said, pairing with bluetooth and understanding the function modes and buttons is straightforward. I definitely would not consider taking a star away for those minor drawbacks.I first heard of this speaker through Oluv's (clavinetjunkie) YouTube channel, so if you get a chance, check it out because it is a great resource for Bluetooth speaker reviews.","timestamp":"Reviewed in the United States July 14, 2017","profile_id":"AH5CP5CYMTZFKOREZMLCEGZTJF5A","is_verified":true,"helpful_count":70,"product_attributes":"Color: Black"},{"id":"R3DFDEY2MDNP7I","title":"4.0 out of 5 stars Amazing sound but my first one failed within weeks","author":"Anonymouse","rating":4,"content":"I love these and they’re great in stereo multi mode but, like many others, the first one started clicking. Praying the replacement doesn’t share the same fate because they are frankly amazing speakers for their price, build quality, etc. If the replacement holds up more than a month, I might consider getting it a sister because they sound almost as good as my sennheiser headphones and Kali studio monitors in stereo minus the blown tweeter in the defective one.","timestamp":"Reviewed in the United States August 21, 2023","profile_id":"AFT3N46X7TE7SDTLIUFC23VZB6XA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3LLBCP9SCEFY3","title":"5.0 out of 5 stars Wow! What a great sounding speaker!","author":"Jim M","rating":5,"content":"Hello people I can see by the other great reviews that I really don't need to add much! I will tell you I compared the Doss soundbox XL with the Bose Sound-link and Sound-link 2. The sound is a no brainier this speaker produces superior sound for the price! The Bose did sound great but is in a smaller enclosure and couldn't produce the lows that the Dose Soundbox XL produces. As for size I wouldn't exactly consider this speaker as compact as far as throwing it in your backpack compact. But for your backyard or room WOW! For 86 bucks this speaker beats anything I have heard in its class! Are there better sound speakers? Probably for a lot more money. One other thing I have read some people complaining about volume. I think it has plenty of volume for its size and it is louder than both Bose I compared it with. Remember this is still a small speaker and if you're expecting a wall shaking experience that one would get from a home surround system it's not happening! I use it primarily in my backyard when I am in my Jacuzzi or having dinner outside and I must tell you I look over at it and just go WOW!!!!Now in 2024 I purchased another Doss soundbox XL to pair in True Wireless Stereo. This is a game changer! The sound is incredible for an already great sounding Bluetooth speaker. Advice to you is make sure your soundbox XL is a version that is compatible with the current version of soundbox XL. Call Doss support if you need help. Speaking of Doss Support, I would like to tell you about my experience with Doss support. Lizzie from Doss addressed my situation and went above and beyond. I had purchased a Doss soundbox XL in Dec,2022 it was TWS but the new soundbox XL I ordered was not a compatible version. I called Lizzie at Doss and their decision was to send me a new compatible speaker and they also gave me a Doss soundbox pro for my trouble.Superior speaker, and superior support!","timestamp":"Reviewed in the United States September 8, 2017","profile_id":"AGCLCTASWXBLLYRFTZHABIFM5C2A","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R18AZ4HPUNI1SZ","title":"5.0 out of 5 stars BASS IS INCREDIBLE","author":"Vilhelm","rating":5,"content":"Update! 7/16/2023After a week of 70% to 80% volume levels both doss soundbox xls now have a loud popping sound during any heavy bass songs. The speakers themselves sound like they are going to pop like a balloon. I was incredibly impressed with these speakers until this happened. I believe it's gotta be due to cheap parts and I'm not convinced replacements will solve the issue. These could of been great, but far too cheap on the build quality.For the price this BT speaker punches wayyyyyy above its weight class. If you love bass, please do yourself a favor and buy this, better yet buy two and pair them together. I mainly listen to rap and bass heavy music so bass was a must. So before you spend hundreds of dollars on a bigger jbl speaker please give this a try. You won't be disappointed. Oh and I love it so much I ordered a second one, minutes after testing the first one out.","timestamp":"Reviewed in the United States July 8, 2023","profile_id":"AGFMUEEUZJHZGJPQSEP25X2465EA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RA7AA4FSUX5LP","title":"5.0 out of 5 stars Great sounding and value for money speaker - and even though 1st unit was defective - DOSS after sales service was excellent.","author":"ed reid","rating":5,"content":"The 1st speaker I got was defective i.e. it sounded terrible due to a damaged sub and rh speaker.I contacted the manufacturer and sent a couple of photos and video setting out the problem - and asked for a replacement to be sent directly as shipping the defective unit back to Amazon from New Zealand would have been very expensive..They agreed straightaway and 8 days later I had the replacement unit.I am stoked with the replacement speaker - it has a very clean sound - with a great amount of bass - esp for its size. The soundstage is decent as well and it has more than met my expectations - and fully measures up as per the numerous reviews out there. It paired quickly and the controls work as expected.The sole negative I could find is that it does have a small rattle at some frequencies - but as per the various online reviews - removing the the fabric mesh behind the metal grille fixed this.Note: The volume was bit low for me with my S8 - but this was more a function of my ph's output volume - as I tested it/connected it via BT to my pc and it goes much louder and it still provides a loud - but tight sound.Value for money it is outstanding and I would definitely recommend it.I also want to make mention of DOSS's after sales service given the issue I had with the first unit. They were professional, quickly accepted that the first unit was defective and sent the replacement extremely quickly. They also didn't require me to send the defective unit back - even though the return policy said I did need to - and I am very thankful for this.Highly recommended speaker and seller. DOSS SoundBox XL 32W Bluetooth Speakers, Dual-Driver Wireless Bluetooth Home Stereo Speaker with 20W HD Sound, 12W Subwoofer, Bold Bass, Long Playtime for Echo Dot, iPhone, Samsung, iPad, Gift Ideas","timestamp":"Reviewed in the United States January 29, 2018","profile_id":"AEUSMAZRBGBITVSKLL464ADSGD7Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R3CJ6C4RHFMTP8","title":"5.0 out of 5 stars Big, Accurate Sound","author":"DukeFan","rating":5,"content":"This speaker sounds as good as similar Bose Bluetooth speakers wish they could, for a fraction of the price! I was initially blown away by the power it produces in the lower octaves - at all volume levels - and the more I listened to it, the more I realized how accurate it is in the midrange and treble tones. Pairing with both my iPad and iPhone was effortless to the point of being instantaneous.My immediate impression of the speaker cabinet was that the materials and controls were substantial, and it was heavier than I expected it would be. The controls are large and plainly marked and have a very positive feel to them. I put the box through its paces initially before attempting to charge it, and it performed flawlessly for the two to three hours I listened. As soon as I found out it is possible to connect two of these beauties in a stereo pair, I ordered a second one so I can astonish my family and friends at our next backyard cookout.Update:I discovered that in order to pair two of these speakers in True Wireless Stereo (TWS) mode they have to be the same model and version. I had to return the second one I purchased from another vendor at a lower price because it was apparently not the same version. I then ordered another one from Amazon and when it arrived I was able to pair the two properly and enjoy true stereo separation from the the pair. Big Beautiful Accurate Sound!","timestamp":"Reviewed in the United States June 13, 2021","profile_id":"AHOWKLL657MMDNBAB7QLVDT4Z6UQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2ABX9F8PB0KAQ","title":"5.0 out of 5 stars Good sound. Better value than Sony XB40. Really impressed","author":"Raul Lopez","rating":5,"content":"I gave this speaker a try after watching clavinetjunkie youtube comparison and the great reviews.Right away I heard the rattling sound and I removed the loose felt between the speakers and the front grille that people suggested taking off. It definitely helped the rattling sound but you can still hear it with bass heavy music. I listen to a lot of EDM/bass music and the rattle was very noticeable. The speaker sounds great only if it didn't have that rattle when the bass hits.I was willing to give it a \"burn in\" period to fix the rattling but the charging port broke! Theres no way to even test the speaker for an extended amount of time now. I dont know if I received a defective speaker but I will be returning it and maybe try a more reliable speaker.***************Update 11/3/17Excellent customer service from DOSS. I received my replacement extremely fast. Right out of the box the sound was incredible. I didn't have to remove or tweak anything to get the sound I wanted. Music is very clear and has a really punchy bass for its size.I compared it to a Sony XB40 and DOSS Soundbox XL had a clearly better sound signature. If you want pure loudness and flashy lights then the Sony is the way to go. Sony you have to mess with a bunch of settings to get the sound you want. The Soundbox already comes with a very fine tuned sound right out of the box. Comparing the two, to me the Soundbox was the clear choice.I've been testing this speaker over the last month and the battery has been great. Festivals, pool parties, on the road, at home, it hasnt completely died on me once from a full charge. The sound and build quality has also held up. Im really impressed with this speaker and overall for the price paid you're probably not going to find better sound.","timestamp":"Reviewed in the United States September 28, 2017","profile_id":"AEAWYD76AGGPRC6WX3YWVLZWPEDA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3G9Z546V181DM","title":"4.0 out of 5 stars Big speaker with big sound","author":"M. S.","rating":4,"content":"This BT speaker is surprisingly good. I've been using 2 of them in my shower for several months, but I really only need one as these get really loud. These are also pretty big, so make sure you have enough space wherever you need to put it. This speaker is pretty neutral focused becoming very bright at higher volumes. Bass is very impressive for the size and I'd estimate it hits 35Hz-40Hz with relative ease in a small space like a bathroom. Bluetooth is okay, but I do experience some dropout and weird connectivity issues occasionally. If the people who made this speaker made a revision, I'd say they should get a better BT chip and maybe tone down the highs. They could also benefit from using better build materials and bracing the inner cabinet. There is a lot of rattling and vibrating with high volumes of bass which causes it to sound a bit muddy. At $60-$80 this thing smokes any and all competition.","timestamp":"Reviewed in the United States May 8, 2022","profile_id":"AHBZEAB6GQQOAGMC7EIROJOKLJKQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RHLLLGHDUNBE8","title":"5.0 out of 5 stars Awesome speaker!!! Get rid of the on/off sounds","author":"Navigatro","rating":5,"content":"I read the reviews on this speaker and watched YouTube video reviews and I got really interested. I got the speaker a week ago and it is awesome. It beats my bose soundlink 3 hands down.There is one thing I do not like about it however. The on and off sound are loud and annoying. I am using the speaker in my office in a professional environment just to keep a nice mood in my office and I play it at low volume. Whenever, you press that on button, the on sound come on at high volume and they are followed by the bt connection sound. I do not understand why it was necessary to have such sounds on the speaker. They disturb people and I have been asked “ what was that?”. I wish there a way to turn off these sounds or at least lower their volume. They have the same loudness regardless of the pre-existing volume level. DOSS, please address this. It is an annoyance on a great speaker. I have had to turn the speaker on in my car before I enter the office or close my door to the office just to turn on without disturbing people. Please get rid of them or show me how to disable them or lower their volume. Other than that, the sound is great! I find nothing else negative about this speaker. If you want a great sounding speaker for less than $100, this is it! Just prepare to put up with on/off ridiculous sounds especially if you use it in a professional environment.Update: 11/4/2018 I came back to. Increase my stars on this speaker from 4 to 5 dispite the few cons I had stated. This is just an awesome speaker. I do not understand why the bose units cost so much more when you can get such a speaker for less than $100.","timestamp":"Reviewed in the United States October 17, 2018","profile_id":"AGR6364JEHUWHJAB3ZZP4Y6XSSTQ","is_verified":true,"helpful_count":17,"product_attributes":"Color: Black"},{"id":"R2V3CYDCZZ3IFJ","title":"5.0 out of 5 stars What a steal!","author":"iEspresso","rating":5,"content":"I got this during some sort of Amazon flash sale for $46, and at that price it’s a total steal. At the regular Amazon price of $70, I would still be very happy with it though as there are inferior units out there selling for much more. The overall sound quality doesn’t really compare to a standard bookshelf system, but that’s not what this is, so it’s not really a fair comparison. What this does compare to is something like the Bose Wave Radio, and if you’re considering one of those, stop and buy this instead. The amount of bass this thing is capable of for its size is pretty astonishing, and in that respect actually surpasses the Bose, and the overall fidelity is (like the Bose the first time you hear it) very impressive. The only place where I believe the Bose is slightly superior is in stereo imaging. Due to the close proximity and orientation of the internal speakers this unit has very little (if any) stereo imaging.In response to what some of the other reviews have said regarding distortions or the box not being sound dampened enough, I’ve been using this thing daily for about 6 weeks now and have heard no rattling, or muffled airflow sounds, or anything of the sort. Then again, I don’t listen to it at max volume pretty much ever. Perhaps such problems show up when listening to loud music at maximum volume, but I’ve had no issues with it playing for extended periods at a reasonable room-filling volume.Granted, if you’re an audiophile who is looking to replace your Pathos tube amplifier and Focal speakers on the cheap, you’ll be sorely disappointed. On the other hand, if you’re just looking for something similar to an old-school portable boom-box but with better fidelity I think you’ll be very happy with this.","timestamp":"Reviewed in the United States December 27, 2018","profile_id":"AFO3W4R44JUVWMWFI2YCBWCHDYYA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:47:11","page":8,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=8","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=9","asin":"B071JN4FW6","page":9,"pages":313,"reviews":[{"id":"R7RKK271CUXV3","title":"4.0 out of 5 stars Best settings for Samsung users...","author":"Kingston","rating":4,"content":"If you're a Samsung phone user like Galaxy S21/S22 series, then these simple settings are the best. Forget any bass boosting app, sound clarity and volume will suffer!Got this speaker back in the days (about 4 years) and still rocking this weekly. Not the best sound quality to amaze friends or satisfy audiophiles, but for the price - BEST in its class!Bass is there. But you must tweak your EQ settings to gain bass or else will blame the speaker and be disappointed. Give it ta chance and play around. Don't use bass boosting app!Pretty loud that can fill a whole kitchen while I'm cooking or working inside a typical 2-car garage. The louder you go, the more distorted the clarity and weaker bass will be.Battery life is awesome! 2 days worth of listening before alerting me to consider recharging. BEST BANG FOR THE DOLLAR...INFLATED DOLLAR!","timestamp":"Reviewed in the United States June 17, 2022","profile_id":"AGBCGX6DOEBZXPL6II2MI5DVOB5Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2OYT4Q3B8WMDD","title":"5.0 out of 5 stars Give it some time","author":"Thomas Nguyen","rating":5,"content":"As of this moment, I feel this is a very impressive speaker especially for the price. It has nice deep/strong bass and clear mids/highs. Battery life is excellent and I would highly recommend everyone buy one! However, I definitely would not have said these things when I first received the speaker. I was completely disappointed in the sound quality - it had minimal bass and it honestly sounded broken. Like others have mentioned, mine had rattles and made weird farting noises. I decided to keep it anyway and glad that I did. I've put many hours on it and found that (in my case at least) sound performance definitely improves with more hours of play. It's as if you have to get past a break in period. Oddly enough, all the rattles and farting noises went away too. Keep in mind I like playing EDM and other bass heavy types of music.Something that I've noticed with this speaker is that the room you're in and the surface that you place the speaker on affects the sound quality. For instance, place the speaker in the corner of a room and the bass becomes enhanced. If I place it on the coffee table in my living room, it sounds terrible. Outdoor performance is underwhelming. I think it sounds best in small enclosed rooms. My favorite way to enjoy this speaker is to place it on my bed and lay down next to it - it's an amazing way to experience music with your ears and from the vibrations through your body. Yes, the bass performance is that great, try it!In conclusion, if you find that this speaker doesn't live up to the high ratings and praises everyone has given it, give it some time and try changing where you place the speaker. Plus, you can't go wrong for $90!","timestamp":"Reviewed in the United States August 17, 2017","profile_id":"AF45EWNZ2AUJ4OPU3NM2Z2I4CJBA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R2OI3PUYLYWGO1","title":"4.0 out of 5 stars Came with a rattle, Woofer eventually started clicking. Still Overall a great sounding speaker.","author":"Joe Blow","rating":4,"content":"First I need to say that this is one of the best sounding bluetooth speakers I've ever owned. The bass is definitely plentiful, but can sound a bit muddy depending on the song. Still, the bass is very impressive and more than adequate for a woofer this size, with 2 passive radiators.Mids, and highs are very clean, and smooth, especially after noting that it's coming from 2 very small full range drivers. Most (even expensive) bluetooth speakers, to me have a bit of breakup in the midrange, that makes them sound honky/shouty. Not this speaker. Mids are smooth as butter, and maybe a tiny bit forward. Highs will confuse you that they're coming from the same small driver as the mids, rather than from a separate tweeter.Immediately after receiving it, though, I noticed there was a metallic rattle coming from the front cover. After reading other reviews, I pulled out the front cover slightly, and reseated it (pushed it back down harder). It takes quite a bit of force, to move the cover but it seemed to have worked. The metallic rattle went away. After having it for a few months though, I started hearing clicking coming from the speaker along with the bass. It appears to be coming from the woofer itself, or possibly one of the radiators. My return window has ended, so I'm hoping DOSS can still warranty this item.","timestamp":"Reviewed in the United States April 7, 2019","profile_id":"AEKJQ64UPSYZDCBI2WGQT6XOBU3Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1CV0SWVUGIVNU","title":"5.0 out of 5 stars For the money, Very Impressed!","author":"MH","rating":5,"content":"I have to say, I was a bit skeptical on ordering this, but it was for my teenage daughter (not myself), and considering her desk and room look like a cat 5 hurricane went through it, I didn't want to purchase anything that was over the top expensive or one that took up much space. So it seemed appropriate, considering many of the electronic items we've purchased for her over the years tend to just be living in a scrap yard somewhere, in some far away land.I have to say, I fired it up and I was very impressed with the sound quality, it is actually very good, and I consider myself an amateur audiophile, coming from the days when you had full systems, EQ's, amps, Klipsch, Sennheiser, and so on.When I pulled it out of the box it struck me as very solid (Probably due to battery weight), but it's a pretty beefy little box. It has no frills, limited ports and is easy to use. I verified you can use the box with the included power cord plugged in. So that's a plus.The bass is excellent and boomy, the treble is fine and not too much or too tinny, and with the three combined (Bass, Midrange, Treble) it seems very balanced. It can go quite loud as well and not flutter, clip or distort.It was easy to setup and get it paired to my iphone for testing. No problems there.Of course, I played it for my daughter and she was mystified as to my selection of music (Van Halen (fair warning) and some Genesis, (Abacab, Dodo-Lurker)).Sadly enough, the DOSS box has now been commissioned to play Declan McKenna and Troye Sivan songs, here on out.. (eye roll).","timestamp":"Reviewed in the United States February 12, 2019","profile_id":"AGLHWRTDYDZTW2FXA2NQ6UAVQMSQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R3G9ARTIZE7P2T","title":"4.0 out of 5 stars Look no further (but unfortunately, not Alexa-enabled)","author":"\"Reviewer\"","rating":4,"content":"I've owned many portable speakers in the past few years. This Doss speaker sounds 100 times better than my old Sony SRS-X55 which was 3 times the price of this when it first came out. The bass is great, it's not distorted or thumpy, the mid-ranges are perfect and the highs are crisp and clean. Build quality is excellent and I was surprised how heavy this speaker is. I've had no rattling issues as others. The price is excellent for what you get. I compared this to a new Bose Soundlink and there's no comparison. This is better.*******************************************************************************************NOTE: I was hoping this would be Alexa-enabled. Sure, it works with the Echo Dot, but you still have to tell Alexa to \"connect speaker\". You can also use a 3.5mm cable to connect the Echo/Dot and the speaker, but even then the speaker will not come on when you speak to Alexa. You have to turn the speaker on manually. I wish there'd be some kind of software update to enable Alexa the way it's meant to be.","timestamp":"Reviewed in the United States April 5, 2019","profile_id":"AGHHP522VKUCNOSMVLRXN3YRXV6A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R397PJ0XTA3STM","title":"4.0 out of 5 stars Shipping was faster than expected.","author":"Charles","rating":4,"content":"You can’t adjust the bass or treble other than that it’s awesome.","timestamp":"Reviewed in the United States January 1, 2024","profile_id":"AF6B2LFCQ3PXBYLIRTJZKGRPVOZQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2EP609TYRKUGK","title":"5.0 out of 5 stars Superb!!!!!!!!!","author":"Kurt","rating":5,"content":"Its hard to believe the sound comes out from a speaker the size of a transistor radio. It was not that long ago each speaker left and right weighed 50 lb and the sound of this speaker is the same. The priceis not bad either $50 today versus $150 in the '70, You can't go wrong.","timestamp":"Reviewed in the United States January 31, 2024","profile_id":"AG5XLRYATJPYE5F33VB5XOFINJDA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3DIIDD6QOB48X","title":"5.0 out of 5 stars Great Small Bluetooth Speaker - Exceptional Low Frequency Response.","author":"Patrick McKeone","rating":5,"content":"I spent a few weeks looking at Bluetooth speaker reviews and trying to gauge what speaker would produce a clear sound with tight, low bass for an office or home office setting. I didn't plan on having this speaker at very high levels but still wanted a full sound. I use an old Sony SRS BTX300 at home that I really enjoy, but I am not impressed with the new Sony offerings.I originally landed on the Riva Turbo X and was completely underwhelmed by its performance, particularly in the low frequency response. The audio did sound best at nearly maximum output (which was not as loud as the reviews lead me to believe) but still lacked in overall low frequency output. There is also a mobile app to use with the Riva that could not be more useless. I quickly decided to return this speaker.I started my research over and found this DOSS speaker at less than half the price of most speakers I was looking at and thought I'd give it a try based on a few very favorable reviews. I am extremely happy with the audio quality and particularly impressed with the low frequencies this speaker can produce. After 12+ hours of breaking in the cones, the frequency response seems to have expanded even just a little lower - roughly sub 40Hz. I do use an equalizer on most playback devices and this speaker accepts the adjustments really well. I am actually planning to buy a second as one to have around the house and for outside. For the price, I'm not sure this speaker can be beat and I'd say it sounds better than any $200 Bluetooth speakers I've heard recently.My background: Degrees in Audio Engineering and Electrical Engineering.","timestamp":"Reviewed in the United States September 8, 2018","profile_id":"AH2F55Y5LVWF4YJOIXVMEWL4IE5A","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"RYANW66B0WGDI","title":"5.0 out of 5 stars Much better build quality and sound than expected and with great customer support from manufacturer","author":"fhudg","rating":5,"content":"I use this speaker mostly for outside music listening. I'm a smooth jazz music fan and this speaker fills that niche quite well. My highest compliment goes to the manufacturer's customer support team as I had requested the firmware upgrade file to turn off the auto-off feature, however, when I installed the file, for some reason, the initial speaker would not power on any more. I promptly sent an email to Doss customer support who responded in a surprisingly prompt time-frame. I was asked to send the purchase invoice and a short video demonstrating the issue, which I did. They, again, responded promptly stating that they were sending me a replacement speaker via Amazon shipping and I received the new replacement speaker within a few days. At this point, I am still quite pleased with the speaker, but mostly, with the great response from Doss customer support.","timestamp":"Reviewed in the United States January 28, 2023","profile_id":"AFDZRXNXXH3ELILSYXIVTZ6MM4YA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RDYRO4BHZPP4W","title":"4.0 out of 5 stars Good but overhyped","author":"gate","rating":4,"content":"I purchased this to replace an older boom box type stereo that didn’t have built in Bluetooth. The Soundbox XL sounds very good for the price. I find some of the reviews to be overhyping it though. Based on reviews, I think my expectations were too high. Don’t get me wrong, it sounds good; especially for the price but it doesn’t sound great. I had computer speakers with a subwoofer in college that sounded as good or better.What I like about the speaker is the comparatively good sound to the low profile package and price. The bass is excellent. The sound is on par with more expensive speakers.I dislike some of the lack of clarity in the mid range. The bass is good for hip hop but is over powering and imbalanced on classic rock type songs. The stability pads are not sticky/sturdy enough to hold this in place when turned up. You can only leave one device paired at a time. Example: when I’m done listening to music, I typically just turn of the music on my phone. If my wife later wants to listen to music, I have to disconnect for her to be able to connect. I expected a more modern speaker to allow for multiple connections.","timestamp":"Reviewed in the United States August 19, 2020","profile_id":"AG2BAHEJC6X4VIOGBYFUY2VDGFOA","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:47:12","page":9,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=9","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=10","asin":"B071JN4FW6","page":10,"pages":1,"reviews":[{"id":"R1BK1LNXHAUYS4","title":"2.0 out of 5 stars Amazing sound in a cheap chassis","author":"Darius S.","rating":2,"content":"PLEASE READ BEFORE PURCHASING!This is the second Doss XL soundbox I've purchased. Both have had the same flaw/fate.Box #1 lasted 2 months. Box #2 lasted 10.First off, the sound quality is absolutely superb. LOUD bass, crisp mids, and a very large projection of sound. We routinely used this speaker to entertain guests by the pool, connect to the projector while camping, and in the garage when working on our race rigs.The battery life is fantastic. At full blast, we averaged over 6-8 hours, medium yielded 10-12. Connectivity to Bluetooth devices are effortless. Being able to bridge a set of 2 for more sound is an added bonus.To the bad :( The chassis the speakers are enclosed in just plain sucks. The amount of bass this thing puts out causes it to shimmy and shake around. The foam feet on the bottom do not keep it in place on most smooth surfaces. If you don't keep an eye on it, it will eventually vibrate across the surface and butt up to an object or worse, fall off an edge.This is exactly what happened to both of mine. After an hour or so of use, the speaker would work its way across my work bench and fall on to the ground. The speaker still plays but the mini subwoofer is toasted. They separate from the cone and rattle worser than a square body jeep on a gravel road.Being the DIYer I am, I opened it up to replace the subwoofer. Unfortunately it's an odd size that cannot be sourced, even from China. There are similar offerings but the screw pattern is different.I hated seeing such a good product literally kill itself from such powerful performance.Sound rating +10. Durability +2. Satisfaction...not satisfied. DOSS, please fix your product. This could be the best JBL killer on the market if they would beef up the durability.","timestamp":"Reviewed in the United States April 16, 2022","profile_id":"AFOWG6BSTCZTMOM6GQCNMMYZIMIQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R2GZJ9W5W0EZCT","title":"4.0 out of 5 stars Nice sound in a small package","author":"80s dude","rating":4,"content":"This is NOT going to rock the house. In fact its bass response leaves a little to be desired but given the speaker size and battery life its an excellent buy. Clean sound with better than expected channel separation. Good for a workshop, deck or garage. You'll find it lacking for beach or pool party use. I use mine in my classic cars. Set it in the back seat and you'll have car filling sound without installing a modern stereo and for mush less money. If you want good tunes in your muscle car I recommend giving this one a try. You can always go for the next model up if you need more bass.","timestamp":"Reviewed in the United States February 25, 2022","profile_id":"AFRVKAYCNHEPJW463AMHYNRH5LJQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2NVB4AL6P30J8","title":"4.0 out of 5 stars Punchy bass but not overpowering","author":"Steven","rating":4,"content":"This is my 3rd purchase. The 2023 version includes standard usb-c charging, which is really great! Bass is punchy but not overpowering. My only complaint is that any drop from height greater than 1 foot will damage the diaphragm and ruin the sound. But again, its sound quality and bass power is unmatached at this price range ($80)","timestamp":"Reviewed in the United States July 17, 2023","profile_id":"AHV3BDMKKYV7XMRBWN2D22XGKB7Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RCVLUUGRS6CD8","title":"3.0 out of 5 stars Worth it for a mid tier speaker you don't have to worry much about","author":"Russ","rating":3,"content":"Some of my BT speakers are upwards of $300 and that's not great for travel/letting people borrow/outdoor use/etc. It's nice to have a speaker this size w pretty good sound that only cost me $60 (not sure how much now). It lives outside in the screened in porch and I've never had a problem with it. I will say, it is a nightmare to switch between BT users. I have had to get my wife's phone and disconnect every time I want to connect. Sometimes I have to select the \"Forget device\" too","timestamp":"Reviewed in the United States September 30, 2023","profile_id":"AECQQNAD44KB7M2NHH2BU6JCUMCA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2OZK6Y4DCQRX1","title":"4.0 out of 5 stars Does what I need it to do.","author":"Björn Arvidsson","rating":4,"content":"Music has been my profession all my life, and I've been interested in sound-reproduction for most of that life. In that context, this is not in any way shape or form \"audiophile\" but that's not what this cheap little speaker's about; I don't use it to listen to music; fo that I have dedicated systems which blow this speaker out of the water. This was bought as my wife and I scrambled to work online (we both teach voice) so that we could hear more of the sounds our students make as we work with them. And for that, the DOSS SoundBox XL works very well. I'm sure you can do better, but I highly doubt you could do better for the money, or under $100. It has clarity, some bass, and a not too etched or over-boosted top end, which often plagues cheap speakers. If you think I'm damning with faint praise; not so! For the money this little speaker punches above its weight, and I'm sure that for listening casually in the bedroom at night it'll work admirably. if you're looking for a small, easily moved bluetooth speaker. look no further! It connects to Bluetooth quickly every time, and it charges with ease. What more needs to be said? It's great!","timestamp":"Reviewed in the United States May 10, 2020","profile_id":"AHIWTLKK72KXOVYNSEZO4ZF2MGLQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2Q1VN03SEMVZI","title":"4.0 out of 5 stars Amazing sound at a bargain price!","author":"W. Patten","rating":4,"content":"The pleasantly surprising thing about the DOSS SoundBox XL 32W Bluetooth Home Speaker is that it does what is says it does. The sound you get from this simple looking box is easily equal to the 2 yearl old JBL Flip that I have. The subwoofer definately makes the difference, though it dominates just a little to much. A little better frequency balance would be nice, but that is a suggestion and not a complaint. The true thrill for me is that it actually lasts for hours with it's rechargable battery. Around the same time I purchased this unit, I got a larger all-weather \"party\" blue tooth speaker that cost 3x more than this one. That box could not hold a charge or work while plugged in, and its replacement worked while plugged in, but would not hold a charge. I am a big believer in backing up your words, and this little Doss speaker does just that.","timestamp":"Reviewed in the United States August 30, 2021","profile_id":"AHQBKCN5RGO37KLPPZGY2VFLH6AQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3RK56JEM4IYRC","title":"5.0 out of 5 stars Doss Soundbox xl","author":"mort","rating":5,"content":"Bought this speaker about 2 weeks ago from Amazon. $59.95. Great deal, free one day shipping. The speaker sounds great. No rattling noises like some complain about. Seems Doss has removed the fabric behind front grill in the new models. Some have said that the highs and mids lack, but not the case with mine. They sound very clear and the highs are not tinny. The bass is very good for such a small speaker, but seems to lessen above 75% volume. Vocals are sharp. This speakers bluetooth pairs effortlessly with my phone. It sounds awesome but is not very loud. It will fill a small to medium sized room though. Sound is very directional.The Soundbox XL will not pair with another XL. BUT, I bought another and received it today. Let me tell you why?I have a Samsung Galaxy Note 8, which has dual audio bluetooth ability. So, you can pair these 2 speakers. Let me tell you. Having 2 of these in stereo is AMAZING! They sync perfect. If your phone has dual audio capabilities, buy two of these speakers! For $120 for two, I do not know of any single bluetooth speaker in that price range that can come even remotely close to the sound that these babies can produce in stereo! As far as long term durability I can not comment at the time. So again, if your phone has dual bluetooth audio, BUY 2 for $120 on Amazon. There is NO $120 single speaker that even comes close.","timestamp":"Reviewed in the United States March 3, 2019","profile_id":"AEJ5L22GIUTINW5ZXPIPLIZNN45A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RJGQBR4VR1YQP","title":"4.0 out of 5 stars In the words of Decepticon SoundWave...","author":"A. Amat","rating":4,"content":"DOSS superior Aukey inferior?I bought this (Aukey SK-M33-US) to compare it to the DOSS Soundbox XL for the exact same price.The Aukey wins in build quality and aesthetics. It's smaller than the DOSS sleeker and just overall better looking.It even has a larger bottom pad for keeping it in place.Battery wise it also beats the DOSS claiming a 4K milliamps batt. That can also be used as a power bank for other devices.But the DOSS beats it in the BASS...The Aukey has great sound, sharp and balanced with great mids. The DOSS XL suffers in mids with even worse highs BUT it can hit those lows that the Aukey just can't.But for it's size the Aukey is probably better than 90% of other Bluetooth speakers of the same size. Great portability.The Aukey also has a plain micro USB charging port. Unlike the crummy proprietary one of the DOSS XL.The Aukey also has auto shutoff if it sits idle for longer than 5 min.Overall if sound quality is more important to you then the Aukey won't disappoint.Also if versatility is your thing then the Aukey is the better choice.But be aware that the DOSS XL's ability to mini quad...is quite amazing...I mean nobody really quads anymore...","timestamp":"Reviewed in the United States February 12, 2019","profile_id":"AFQG7FWVMQU4XZ64SQXYA4X4RHQQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R12LARGDZYFSXI","title":"3.0 out of 5 stars 3rd EDIT: Got sent a 3rd one, opened the box to it broken","author":"Josh Steinberg","rating":3,"content":"3rd EDIT: To DOSS' credit, their customer service is top notch. Without asking, once again, they sent me another speaker. That is beyond impressive in my opinion. Sadly, when I opened the box, the same button was broken as last time (see the 4th picture). This time, the button still works, it just is crooked and feels like it's ready to fall in the speaker. They wrote me a kind letter explaining how they talked to manufacturing and hope quality will improve so I am optimistic for their future products. The speakers that work still sound great and are still a deal for the money. If quality issues were resolved, it would easily get 5 stars.EDIT OF EDIT: had it for all of 30 minutes and the forward track button fell into the device. See pictures. Still sounds great and is usable because I just use my Echo for voice commands, just disappointing build quality. This is the second speaker theyve sent me (first one blew the sub). Still sounds great and works, just wish it stayed together!!!EDIT: They sent a new one and this thing one again sounds awesome. I'm impressed with the customer service and once again, the sound quality. Especially for the price. My friend has some high end Harmon/Kardon speaker and this thing gets just as loud and has more bass. Not to mention, it's way cheaper!Original review:This thing is great for the price! When I first got it, I was really impressed with the sound quality. The volume gets pretty loud too! This would be 5 stars except for the fact that after a couple weeks of being connected to my Alexa Dot, it's started to rattle and have no bass. It sounds like the subwoofer is broken. Other than this issue, I would recommend the speaker for the price. Hopefully this doesn't happen to others!","timestamp":"Reviewed in the United States September 6, 2017","profile_id":"AHH4NI3QCN766T2SP7WJ3M7UDR5Q","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R29KP08ZCF4NJ6","title":"5.0 out of 5 stars Works good","author":"David","rating":5,"content":"Not as loud as I thought it would be but it’s ok","timestamp":"Reviewed in the United States April 24, 2024","profile_id":"AGWD6ZH66GXJDVRNQEGY77HOYEJQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B071JN4FW6","product_name":"DOSS SoundBox XL Bluetooth Speaker with Subwoofer, 32W Loud Sound with Booming Bass, Dual DSP Technologies, 10H Playtime, USB-C, TWS, 2.1 Sound Channel Home Speaker for Indoor, and Office-Upgraded","parse_status_code":12000},"created_at":"2024-09-09 10:46:55","updated_at":"2024-09-09 10:47:13","page":10,"url":"https://www.amazon.com/product-reviews/B071JN4FW6?reviewerType=all_reviews&pageNumber=10","job_id":"7238860421094978561","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-09 10:46:55","domain":"com","geo_location":null,"id":"7238860421094978561","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B071JN4FW6","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-09 10:47:13","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7238860421094978561","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7238860421094978561/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7238860421094978561/results/1/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/2/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/3/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/4/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/5/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/6/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/7/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/8/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/9/content","http://data.oxylabs.io/v1/queries/7238860421094978561/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7238860421094978561/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7238860421094978561/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7238860421094978561/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7238860421094978561/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7238860421094978561/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7238860421094978561/results/10/content?type=parsed"],"method":"GET"}]}}