{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=1","asin":"B0B43Y8GHZ","page":1,"pages":43,"reviews":[{"id":"R22P9TAALZTP3X","title":"5.0 out of 5 stars Awesome speaker.","author":"Stephen M.","rating":5,"content":"The sound of this speaker is incredible. Good highs and great bass. It was very easy to set up.It's not super heavy, but feels very solid. So far, the battery lasts a long time in between charges. It comes with wall charger. I would definitely recommend this speaker. I also got it on sale at a great price. The light is pretty cool too. You also have more control with the Sony Music center app.","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AF7LYPOQCT7STDHZITCSNE24VFIQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1DAHK2RQS1SII","title":"5.0 out of 5 stars This is the IT speaker","author":"Noah","rating":5,"content":"Firstly, I must say that the sound quality is absolutely incredible. These speakers provide an immersive audio experience, allowing you to truly feel the music and get lost in its rhythm. Whether you're enjoying your tunes or cranking up the volume for a dance party, this speaker is guaranteed to impress. The bass is deep and punchy, adding that extra kick to your music.One aspect that really stood out to me is its portability. Despite its powerful sound output, this speaker is surprisingly compact and lightweight. You can effortlessly carry it with you wherever you go, be it a picnic or a fun beach gathering. Moreover, with its IP67 rating, it's designed to withstand dust and water, making it ideal for all kinds of escapades.Connecting to this speaker couldn't be easier thanks to its Bluetooth functionality. Pairing it with my phone was a breeze, and I experienced no issues with the connection throughout my usage. Furthermore, the speaker offers a range that grants me freedom of movement without any concerns about losing connectivity.Battery life is always a concern when using speakers; however, the Sony SRS-XG300 has got you covered in that department. With a 24-hour battery life, you can enjoy music all day and night without needing to worry about recharging. It even comes with a USB port, allowing you to conveniently charge your devices while on the move.Finally, the design is sleek and contemporary. It's evident that Sony has meticulously considered every aspect, from the construction to the user controls. The LED lights bring an element that enhances the atmosphere and perfectly complements the music.If you're looking for a great speaker for a little more price this is the one. Its the perfect speaker to use everyday whether its inside or out.","timestamp":"Reviewed in the United States July 23, 2023","profile_id":"AEIKMFWY3SV4YRDCG2KL6OTUP4TQ","is_verified":true,"helpful_count":31,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R123BOARGUG1WM","title":"5.0 out of 5 stars All around great speaker","author":"A like minded person","rating":5,"content":"I bought the bigger 500 series and thought to get the 300 series. While the 300 series is smaller and doesn’t offer some of the features that the 500 series offers, it’s a great smaller alternative that provides plenty of volume and bass. The speaker is waterproof and dust proof to a certain extent. I like the C drive charger which is very convenient. Saltwater and sand got on this speaker and it still performs flawlessly. Very happy with it considering its size.","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AEIXT4EMUTOBCXAIK4QDHTA3VPYQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R2T2U63981MT2C","title":"4.0 out of 5 stars Sounds Great When Dialed In","author":"Mike Blumenberg","rating":4,"content":"Out of the box, this speaker sounds pretty mediocre. But just tinker with the EQ, and it comes to life. It's a little big, and kinda heavy, but the built in handle makes transport a breeze - and it lays flat when not in use. The speaker is very well designed, and looks great. It gets fairly loud, but nothing too crazy. The JBLs definitely get louder, but I like the sound quality of the Sony better. At low to mid volumes, you can get over 12 hours of constant playing from the speaker. At near full volume, it's more like 6-8. If you like how it looks, and are in the market for this style speaker, give it a shot. I think you'll like it.","timestamp":"Reviewed in the United States March 20, 2024","profile_id":"AHHXAFJW5QRATN2RFEG5TFFQHOXQ","is_verified":true,"helpful_count":11,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1NBOJS21O8D3K","title":"5.0 out of 5 stars Absolutely incredible battery","author":"Rodney Molidor","rating":5,"content":"This Sony XG500 boombox sounds good and has absolutely world-class battery life, and fast charging. However there are better sounding speakers for the money, and some that cost far less that sound just as good(Skullcandy barrel xt for example). This boombox has great features, including TWO USB-A ports so you can use one to play music from a USB stick, and another to charge your phone, plus a mic/guitar input! For me, the battery life is hugely important, and I can not overstate how long this battery lasts and how quickly it charges back up. FAR superior to all the others I have owned. And it sounds good, not the best, but plenty good enough. I absolutely love it.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AGCI7M4EX5GHPCKJUSXWLKXVMADA","is_verified":true,"helpful_count":6,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R178FXIZIZC5U8","title":"5.0 out of 5 stars A speaker worthy of the Sony name","author":"Efrem Alexander","rating":5,"content":"This is a outstanding speaker, once you tune it with some EQ adjustments, out of the box the sound signature is warm and could be off-putting if you're expecting more clarity, but it is there you just have to know how to set it up. First make sure the LDAC is engaged and I also found the live setting to get more clarity and sparkle than the megebass setting and last but not least use a third party music app (I recommend Musicolet) it has multiple EQ band settings and also preamp to boost the volume of your music.With these 3 factors addressed this speaker produces some of the most well-balanced sound of all my Bluetooth speakers especially for its size, just like a fine instrument, it has to be tuned to get the best sound quality from it!!","timestamp":"Reviewed in the United States July 15, 2024","profile_id":"AEBN67HUWEPFLVQN4KCYKDGAWVRQ","is_verified":true,"helpful_count":8,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R37FPLXWW406X4","title":"5.0 out of 5 stars The best loudest clearest sounding speaker like it","author":"James Alward","rating":5,"content":"It’s pretty loud, it depends on the music or input . The sound is bose like. The unit pairs to add multiple Sony speakers. Most impressed with zero to 3/4 volume clarity with the right music it is otherworldly lol . Speaker is way too expensive but it really sounds good!","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AHTM6QNL3W4UP2HFOUUSLD2GG4UA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R35AIMWYE6RUG1","title":"1.0 out of 5 stars Wretched Device Connectivity","author":"daniascrewedme","rating":1,"content":"Once the speaker is turned on, any device that is connected to it can interrupt whatever is being currently being played through a speaker. For example, I'm playing a podcast through my speaker and then I receive a phone call on my phone. As soon as I answer the phone call, it's now playing through my speaker. In other words, it changed devices on me without any prompting, and this cannot be controlled.There isn't a way to remove devices that are connected to the speaker, and the app that \"controls\" the speaker is equally unhelpful. Poor design, decent sound, and an awful experience. I love Sony, but I will never buy another speaker from them again.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AEHVRZE27YEKLPS6CLHF4IL7EDZA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R2VC7O95ZQHVLB","title":"5.0 out of 5 stars Get 2 for good stereo experience","author":"Amazon Customer","rating":5,"content":"Love my speakers. I purchased one, but wasn't satisfied with the sound.To use them as a pair you must download an app from Sony. You pair the speakers there. The app shows you the music programs on your device and you click there.However, I can't use both speakers for my iPod, as the iPod won't show up in the list on my phone (in the Sony app) it's ok though. I am loving the stereo sound I get from the 2 Sony speakers, and I carry them into the kitchen when I cook, back to the home gym. Evidently they are ok to go out doors.Recommended!","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AEPSTN56C352YUJGRMNKBNL7VVKQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R2CT0E5LRRDTQD","title":"4.0 out of 5 stars Connectivity issue","author":"Suraj","rating":4,"content":"Has some connectivity issues at times other then that it’s great","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AFOH6SD4O7WFF2RHMBQR5KPAJ7WA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:42","page":1,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=1","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=2","asin":"B0B43Y8GHZ","page":2,"pages":43,"reviews":[{"id":"R1J95UT8KNK4A7","title":"5.0 out of 5 stars Killer Sound","author":"Jonathan W.","rating":5,"content":"I was skeptical about this product and any reviews. I just received my speaker and it sounds so good. If any of you are on the fence about this product, order it. It sounds that good.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AGV6NKZ5IQZDVC74I2UKKUJBPEVA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R19J13A543VZMK","title":"5.0 out of 5 stars Impressive","author":"Amazon Customer","rating":5,"content":"Great sound, great depth. Would recommend to a friend.","timestamp":"Reviewed in the United States August 28, 2024","profile_id":"AHZ32MLUU5PYW3VMEE3HPD2JG3AQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R3GLIWDFDEK5IL","title":"5.0 out of 5 stars Speaker With Feature and Skill! (Bow Hunting Skills, Numchuck skills, you know the rest....)","author":"Natascha","rating":5,"content":"+The sound is amazing,+the battery life seems to last forever (especially if you turn off lights and bass boost, but even leaving them on...I'm still so impressed)+It looks super nice. I use this primarily as a home speaker actually that I move around at times, and I think it's a great speaker serving that role, too. I find it impressive truly as an ALL IN ONE product, you know? I must say, even after reviews, this speaker is better experienced in person than the reviews can even show. It's truly impressive. I think when asking if you should buy this or not, the answer is definitely YES if you want the extra features. For example,++ being able to turn this into a guitar amp is gonna make me feel especially cool when I very poorly sing and play guitar. I don't know how often I'll use this, but to have that as an option as actually pretty freaking sweet.++ Being able to charge things from my speaker, even if pretty slowly, is cool and useful.++ Being able to plug in an amazon echo into this speaker and have Alexa voice activated assistance is also freaking sweet. Having such a long battery life is a convenience even just using this mostly as a home speaker.This speaker really does rock! ;) It has numchuck skills, bow hunting skills, it just has skillz. It's NOICE!(I hope this review helps someone in some way. Remember to embrace your inner Napoleon.)which one, you say?You decide!Do you want this even at all AND you have the money? If so, go for it! If you want to spend less and don't mind lacking a few features, (features lik a guitar amp plug, an aux plug, two usb a charging ports, and a super long battery life), consider other options like the Soundcore Motion Boom Plus. You can spend half the price and get something that sounds really, really good still if just having something that plays good sounding music is your primary concern. It will lack some features, but they may be things you wouldn't really prioritize or use often anyway on a more feautre ridden speaker. Being poor, sometimes spending more really pays off, but it doesn't always. Sometimes I'm just as satisfied with a product at a lower price that still has 98% of the other features in common with higher priced items. Does paying more pay off here? Well, I think for the most part yes. I think the features really are fun.","timestamp":"Reviewed in the United States December 9, 2023","profile_id":"AECHBLEF5TE4MITCQKBMC4TNVGWQ","is_verified":true,"helpful_count":19,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R3KA1FA9C6XXIY","title":"5.0 out of 5 stars Great speaker","author":"justin wilson","rating":5,"content":"We used this speaker on a float trip. It is battle tested for sure. We flipped the canoe 5 times and the speaker kept on going. It lasted all weekend on one charge. Great sound and quality. Easy to sinc with Bluetooth. I would purchase this again.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AF4T4NLMNLYZZPTBPYTR75G7EMEQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R1NKOI3APEQ33F","title":"5.0 out of 5 stars Great","author":"Ray Clem","rating":5,"content":"My little mobile club! Bass is nice!","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AFQ3G3NWKPARI5B3DTHUK5T3SEOA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RYYTH07CSA3PI","title":"4.0 out of 5 stars Sound quality is good","author":"William Yates","rating":4,"content":"But doesn’t get very loud. Good enough for a small area but it’s not good for large areas or parties.","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AFFQZWD3EEBO3WFHUGOZVYAVD6HQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RLUJN1Y0XAJI3","title":"5.0 out of 5 stars Outstanding quality","author":"~Tony Boyle","rating":5,"content":"Exactly what you would expect from Sony. Superior sound and quality","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AGBBVAJ6TTSEABM4FA7JOR6WHI7A","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R34GTW8NFCSPKK","title":"5.0 out of 5 stars Sound great 👍","author":"Porfirio Iglesia","rating":5,"content":"What to expect from Sony never disappoint good product. Outdoor & indoor.","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AHTX5XH5K7QPJXLZL44GGDNS2ZZA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R160VXEKI544U8","title":"4.0 out of 5 stars Suena muy bien!","author":"Está genial el parlante, suena muy bien y duro apresar de lo pequeño","rating":4,"content":"El parlante superó mis expectativa, pensé que iba a sonar más suave pero no fué así, ya le hice una pequeña prueba de agua en la ducha y funciona correctamente, lo recomiendo, la calidad en el sonido es muy buena.No me gustó que la caja del envío era muy grande con respecto a la caja del parlante, es un largo viaje hasta mi país y la caja del parlante venía un poco maltratada, eso podría afectar al parlante, la estructura de cartón mantiene quieto al parlante así que no tuvo ningún daño.Es algo para mejorar, por eso mi calificación, pero como tal el producto es exelente.","timestamp":"Reviewed in the United States April 19, 2024","profile_id":"AEYHU5X7CFMUJBGRL7326H7E3SAQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R15E699K2OS06N","title":"5.0 out of 5 stars Great","author":"Cliente de Amazon","rating":5,"content":"Good product excelent price","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AHUGEJ4NP4P7DJ5NBTPQML4MOSUA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:40","page":2,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=2","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=3","asin":"B0B43Y8GHZ","page":3,"pages":43,"reviews":[{"id":"R4WLQK8C1YW5P","title":"4.0 out of 5 stars Great buy at the sale price","author":"Easton","rating":4,"content":"I bought this on sale at $199 and it is worth that, very clear sound and good base for what it is but I will say it is as loud with better sound quality than the 3 UTV sound bars I tried. It doesnt get as loud as I hoped for use in the side by side but it makes up for that in its versitility and portability.","timestamp":"Reviewed in the United States May 6, 2024","profile_id":"AFCG73EDQJNDQLKR64B6RQHTKKWQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R1539EIKJSO5TW","title":"5.0 out of 5 stars Excelente bocina aunque la potencia puede mejorar","author":"javier","rating":5,"content":"Me encanto esta bocina aunque por el tama;o esperaba una bocina con una potencia un poco mayor, sin embargo el sonido es muy claro y con unos buenos bajos y graves justos para el tama;o, es bastante portable y la carga de bateria se me hizo excelente.","timestamp":"Reviewed in the United States July 3, 2024","profile_id":"AHTI74H3OVQWEG3OZD3CNG4NOTGA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3J4U3SOEUHAU4","title":"5.0 out of 5 stars Freakin’ Awesome","author":"R. Ruppert","rating":5,"content":"Excellent design and operation. Sony thru n thru. I have had two dozen Bluetooth speakers. Obsession? This one is my favorite. Closest comp is my JBL Xtreme 2. The Sony is better quality materials. Better sound (including volume). Better design. Yes, it’s my opinion. . . But I have them side by side.","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AHX7GL7ZKLYM46ZUNXR74IIMW5MQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R1RTAZ9C0V28ZX","title":"5.0 out of 5 stars Excelente","author":"Alveiro","rating":5,"content":"Excelente","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AFL5MUQJN72GCUR64XGWECOHUFZA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1WXFJO25KJ87Y","title":"2.0 out of 5 stars Worse sound than expected","author":"Strikeout321","rating":2,"content":"We have a large family that likes to listen to music. In my house, we own every JBL Bluetooth speaker (Clip, Flip, Charge, Extreme, Boombox, etc…and the different versions of them), we also have multiple UE speakers (Wonderboom, Boom, and MegaBoom), multiple Sonos speakers (Arc, Mini Sub, One SL, etc.), and one Bose speaker (it’s older, I forget what). Needless to say, I have a lot personal experience with these devices.In my opinion, this Sony SRS-XG300 is about as good as the JBL Charge 3 or 4 (not 5). I was actually surprised at how bad the low end sound is for this speaker considering its size, the bass is just not there no matter how you try and tune it. Using the Mega Bass button is almost laughable because all it does is add bass, without it, there’s virtually zero bass. The speaker is not room filling at all and can even sound kind of “tinny” during certain sounds with higher pitches. It might be great in a lab with specific sound measuring equipment, but in a real world setting, it doesn’t sound any better than a medium mid-level speaker that’s half its size.I paid $148 when it was on sale and would say that’s about the most I would ever pay for it…but honestly I would just avoid it altogether because even if you got it cheap, you’ll be disappointed once you use it. Go with a JBL Extreme or UE MegaBoom (if you want that larger size speaker), you will be much happier with your purchase. The JBL Boombox is my favorite Bluetooth speaker by far, but it’s stupid expensive and way overkill for most people.","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AGNGXFTNXGOGLV6JO4MVPOM5CUUQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3HESAR0LOHDRF","title":"4.0 out of 5 stars Still deciding if I love it","author":"Fawn","rating":4,"content":"I'm not crazy about the fact that you cannot disable the microphone because it prevents me from dictating on my phone if I have it connected, and I also think it tends to be a little bass heavy without adjusting the equalizer in the app, and the app is kind of outdated in my opinion. That being said, I do love having a large portable speaker that I can put in any room of the house and fill it with music or whatever. It's a bit heavy at 5 pounds and should definitely have had a better base for stability because I'm not sure how well it would survive a fall. It also doesn't seem to ever power off despite the settings I chose for that very reason. That being said, the battery life is ridiculously long and I can leave it on all day without any issues. I do love Sony products but I'm also glad I got this on a promotional sale ($100 off) because I likely wouldn't have paid the normal price. I also love that it has USB-C charging, as well an extra USB port to charge my phone.","timestamp":"Reviewed in the United States November 10, 2023","profile_id":"AFWNZK4LRKC6XEYUANWC7Z3MLDWA","is_verified":true,"helpful_count":3,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RUDUDLTYSKITE","title":"5.0 out of 5 stars Very satisfied","author":"Brodie E","rating":5,"content":"First time purchasing some labeled as Used/Like New from Amazon. Extremely satisfied with this item. Sound quality is great, perfect for the pool or beach. Sand and water came into contact and did not cause any issues.","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AHFNQIKOWKSVGYWD3QMRPDWTWD2A","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3N006UTJMHBQH","title":"4.0 out of 5 stars MI OPINIÓN","author":"Ruddy Yankee","rating":4,"content":"Esperé varios Meses para tenerla porque para saber qué tal el Producto eso se sabrá con el Tiempo.La verdad la Bocina suena Bien, un Sonido Limpio.Pero dependiendo la Exigencia de cada Persona puede ser la Opinión.En mi caso mi Opinión es...Que para ser un Bocina tan cara debería ser más, por ejemplo debería subir más, porque ella sube mucho pero en lugares abierto y si hay mucho Ruido no Sube mucho.Debieron de ponerle Dos Bocinas en vez de una, o sea una en cada lado.La Bocina debió de tener una entra para Memoria, sea USB o fuera MicroSD.Porque es que este es un Producto muy Caro y se supone que es de Gama Alta para que otro Producto con un Menor Precio cumpla con esa necesidad de poder conectar un USB.Otra cosa es el Tiempo, en realidad no dura 25 Horas, con el MegaBass activado y sin encerder la Luz, puede que dure quizá 12 a 15 horas. Y quizá 20 horas con todo desactivado.Que también debería de durar más tiempo la Bactería, con las opciones activadas, como el MegaBass e Incluso la Luz.","timestamp":"Reviewed in the United States September 29, 2023","profile_id":"AEDYLTMGPO4XAQPK6BTFX7TRPFAQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R327VKZ24615JQ","title":"4.0 out of 5 stars Bass","author":"Geo","rating":4,"content":"Tons of bass. Not as loud as I would like. I’m a bass head so this is cool with me.","timestamp":"Reviewed in the United States April 24, 2024","profile_id":"AHU7DXI74DZL4T2GD7KE2G5ZNL2Q","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R211N0IDQ04OCT","title":"5.0 out of 5 stars Unmatched Sound Quality and Portability!","author":"Franklin","rating":5,"content":"As an avid music enthusiast, finding the perfect balance between portability and exceptional sound quality has always been a priority for me. The Sony SRS-XG300 X-Series Portable Bluetooth speaker has exceeded all my expectations.Firstly, its compact design makes it incredibly easy to carry around, fitting snugly into my backpack without adding unnecessary weight. Yet, don't let its size deceive you—this speaker packs a punch! The sound quality is simply phenomenal. The bass is rich and deep, the mids are clear, and the highs are crisp, delivering a truly immersive listening experience across various music genres.The battery life is impressive; I've enjoyed hours of uninterrupted playback on a single charge, perfect for outdoor gatherings or long days out. The Bluetooth connectivity is seamless, allowing hassle-free pairing with my devices.Furthermore, the build quality is top-notch, exuding durability without compromising its sleek appearance. Its water-resistant feature adds peace of mind when using it outdoors or by the pool.In conclusion, the Sony SRS-XG300 X-Series Wireless Portable Bluetooth speaker is a game-changer. Whether you're a music aficionado or someone who appreciates great sound on-the-go, this speaker is a must-have. It combines remarkable sound quality, portability, and durability—all in one package.","timestamp":"Reviewed in the United States December 25, 2023","profile_id":"AFVWMR46ZO7Q36EFRQC5IHJVRPFA","is_verified":true,"helpful_count":21,"product_attributes":"Color: BlackStyle: SRSXG300/B"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:41","page":3,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=3","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=4","asin":"B0B43Y8GHZ","page":4,"pages":43,"reviews":[{"id":"R2LKEYDZ9Q0Z57","title":"5.0 out of 5 stars Great Buy for outdoor needs","author":"KnightFox","rating":5,"content":"I switched to this speaker after using the waterproof JBL speaker. Here are the reasons why this was the right decision even though this speaker cost a little more.1. Battery life. I use this speaker 4 times a week for at least 5 hours and I only charge it once a month.2. Waterproof. I take this speaker on a small sailboat during regatta racing. It got not just wet but submerged in salt water few times when a wave washes through the cockpit. It still runs without issues. Afterwards a give it a rinse with fresh water garden hose.3. Sound levels. It has a great sound and packs a punch. The bass is strong. The treble could be clearer.4. It does have an auxiliary input even though it doesn’t specifically say that in the descriptions on amazon. Bluetooth works great too and is easy to connect.5. It is larger than the jbl speaker and heavier too but that is to be expected if my other points matter to you too.6. Dont buy the case that gets suggested with the product. The grip is too flimsy for the weight of the speaker. Better you get that carry strap that can snap on.","timestamp":"Reviewed in the United States November 17, 2023","profile_id":"AEGU5Q7IAD6FC2LGLCE4D2GZBBTQ","is_verified":true,"helpful_count":9,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R34BK1IAAOH2VH","title":"3.0 out of 5 stars Nice product","author":"Daniel Stewart","rating":3,"content":"Kinda expensive for what you are getting, but works sounds decent.","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AFEFPC4CA5GYFGNMPDP5XXOQSWDA","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R1QIT24001GNW0","title":"5.0 out of 5 stars Great sound","author":"Nanci Galaviz","rating":5,"content":"The media could not be loaded. It’s a bit heavy but has great sound! You can pair multiple divides to have them spread out.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AF6RCZHSZNTOKSQYWM4NJOPTVXKQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R2R7NGN7WZIBPZ","title":"5.0 out of 5 stars Great sound","author":"Amazon Customer","rating":5,"content":"I purchased two of the speakers, and we love the sound quality. However, after only having the speakers since July, one of them will not power on. It was at 100% battery when I turned it off, however, when I powered it back up, it won’t turn on. It’s just dead! I’ve tried plugging it in & it’s still dead. I know that Sony is great but only 8 months in and I am having an issue.Update: I contacted Sony and the product support team helped me with my speaker. If anyone has a problem with their speaker, powering on, hold the power button for eight seconds. Excellent product support.","timestamp":"Reviewed in the United States March 26, 2024","profile_id":"AHUAKFPNDQ53266AMLPHD5SURFCQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R1IDZCMRYL18EW","title":"4.0 out of 5 stars Generalmente bien, audio de calidad más no cantidad.","author":"Jesus","rating":4,"content":"The media could not be loaded. En general bueno. Esperaba que sonara más duro lastima no diga la potencia en las especificaciones","timestamp":"Reviewed in the United States April 12, 2024","profile_id":"AESQIB6ZUOEHXWMPBPL3OBO2W7YA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RGZ77ND51UYAU","title":"5.0 out of 5 stars Quality, Battery, Durability","author":"Cole Karvonen","rating":5,"content":"I got one of these speakers not expecting it to be as big, because the woman they used for the picture must be a giant.But I just sit there and get lost in the quality. Silence in songs just seems to suck the sound out around me.I bring these to work with me, working night shift fast food and it surprisingly takes up a room but won't overwhelm another room. Really just an extra perk for me.Buy another feature from the app is if you buy two, you can connect them together for stereo mode. And it just doubles everything.I also like I only have to turn it up halfway to really be satisfied, and a charging feature that'll only charge them to 90% which will make the battery live a lot longer and not wear out.A genius speaker for long term use!","timestamp":"Reviewed in the United States December 27, 2023","profile_id":"AFGPMZLMQUSHPX5AAPOEHD5VVYSA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"RX3MAKFDDGCY7","title":"5.0 out of 5 stars This was a really great buy!","author":"AxHandle","rating":5,"content":"I'm always in the market for quality bluetooth speakers. When the opportunity presented itself to buy this unit for under $200, it was an absolute no-brainer. It plays loud. Crystal clear loud with a deep punchy bass to boot! And the battery? Well, we had this speaker at a at rendezvous of a motley lot of characters deep within the twigs of the Nicolet National Forest in northern Wisconsin where it was playing at minimum 12-hours straight with plenty to go and only plugged in on a recharge simply because we were not using it. I haven't tested out the guitar plug-in, as of yet. So I cannot report on that aspect. But the lights are cool especially during nightfall if you're into that sort of thing. Oh, and this unit is certifibly solid. It can literally be dragged through a swamp during monsoon season and it won't miss a beat or soak up a molecule of moisture with its superior water tight design. is great when your spending the weekend in camp or at the beach when a sudden downpour shows up on an otherwise sunny day! In closing, in my humble opinion this JBL PartyBox 110 is a rugged, well-built, compact unit thatin my humble opinion sounds great! and I would have been completely satisfied satisfied with the purchase been an awesome little speaker I'd pay more than I have for it.","timestamp":"Reviewed in the United States June 27, 2023","profile_id":"AFWLSG633YHDDP5NYAO4FBQRJ3PA","is_verified":true,"helpful_count":11,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R29N740JAMD3NA","title":"5.0 out of 5 stars Great Speaker with OK Battery Life","author":"MichaelC","rating":5,"content":"Bought this to replace a broken Logitech Muvo 20 that I had purchased many moons ago. The general use is that it's our garage speaker, the kids use it when playing hoops and sauce toss. I also occasionally take it to the patio. Overall I think it has a much better sound than what it replaced with much heavier bass, in fact it could be a little too much for my taste with some music. The sound profiles help to adjust as needed. My expectations on these were pretty low given they are small battery powered speakers but I am impressed with what it produces. I did find the battery life seems to be just ok. We are charging it more than the old speaker but it could also be that the kids are playing it louder. That aside, I think Sony has a winner here.","timestamp":"Reviewed in the United States November 24, 2023","profile_id":"AGUGT4SGRWIFHNNEAPQUXZPM52WQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1FM69W07QPDCH","title":"4.0 out of 5 stars Expected more for the price","author":"Amazon Customer","rating":4,"content":"Shape is unbalanced. Not easy to carry. I have had interference on sound. App is not good,","timestamp":"Reviewed in the United States March 10, 2024","profile_id":"AGBVZT2GRRH4ETLUOSHKHEIL5QHQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"RGTH84CDGG03I","title":"5.0 out of 5 stars Amazing sound quality. Perfect beach, boat, wherever speaker.","author":"James P","rating":5,"content":"Sony hit it out of the park on this one. Impressed with the superior sound quality at all levels. Huge plus that it also charges your phone.","timestamp":"Reviewed in the United States June 2, 2024","profile_id":"AGFNVELGFYVXK546TD7K3RZYRETQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:42","page":4,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=4","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=5","asin":"B0B43Y8GHZ","page":5,"pages":43,"reviews":[{"id":"R2SIJEDGNA0VKR","title":"4.0 out of 5 stars Quality Sound","author":"Shelby anderson","rating":4,"content":"The speaker delivers high quality sound which is to be expected for the price. The water and sand proofing is also high quality. Only giving 4 stars because we also have an x-series karaoke speaker & we are having an issue with the music syncing up when they are linked, there is a lag in the portable speaker.","timestamp":"Reviewed in the United States January 14, 2024","profile_id":"AGYOSIHFUKAF2MIU56LIXGLXEO2A","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RCXUQH2YF35SM","title":"4.0 out of 5 stars Good sound","author":"Tsikoo","rating":4,"content":"Good sound for me. Great app, easy connectivity, no latency noted. Wish the battery was better especially for it's size.","timestamp":"Reviewed in the United States March 5, 2024","profile_id":"AG5SID7AMW6TQG6UBZAD6RC2JU4A","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R2OIBE9JDWEJXM","title":"4.0 out of 5 stars Works great but is expensive","author":"Customer","rating":4,"content":"It's pretty light-weight and sounds good. The volume can get really loud too, but I'd never use it at max. It charges quickly and lasts long enough so that it never runs out on me. Overall this is a high-quality product any way you look at it, but even then it felt too expensive.","timestamp":"Reviewed in the United States January 8, 2024","profile_id":"AGSPENXBJ5BUL54WWQF6LTXLY77A","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3C4GZ2LPMXBLA","title":"5.0 out of 5 stars Excellent","author":"Craig D Scroggins","rating":5,"content":"Does everything as advertised! It's a rather large unit, but everyone stops me at the beach or on a hike to inquire about it. The battery seems endless, even after periods of non-usage. The sound quality is impressive across all genres of music. The bass is rich and deep. I never worry about water or sand, very durable going on year 2 with it!","timestamp":"Reviewed in the United States April 13, 2024","profile_id":"AFR376CJ6WRAXSBGZEAA5LPUN2WQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"RPF7JRNKEUXVD","title":"3.0 out of 5 stars Sounds great but it has issues when trying to use party connect feature","author":"Russell","rating":3,"content":"It sounds great! But when trying to use it with the Sony party connect feature, it periodically drops out of the group. So if you're going to use it with Sony party connect, you may want to rethink your purchase","timestamp":"Reviewed in the United States June 1, 2024","profile_id":"AHT3SCKYQLV5MX4EKAAV65EZZJQQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1MAB2ADYT31IG","title":"5.0 out of 5 stars Is this a sound bar?!","author":"Devon","rating":5,"content":"I’ve only used this speaker for a month now maybe and I’m blown away. The quality of this speaker doesn’t seem possible. Sony out done themselves, if you want a portable speaker with fantastic bass and an amazing range, buy this right now! I can’t say much other than you need to buy this before even looking at the JBL store. If you need something compact (like an echo dot) don’t buy this. It’s way too big I can’t even fit it in my school backpack without it using up half of the space. I would recommend a WONDERBOOM if you need something with good bass and that can fit in the schoolbackpack. What they don’t say is that you can charge your phone with this speaker via USB-2.0 and it has an audio in which is too much that I can’t even use the speaker to it’s fullest extent","timestamp":"Reviewed in the United States October 8, 2023","profile_id":"AE3MBJES3O3LLHWREFIIJM4KMUDQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RXFODAMDJVTW7","title":"5.0 out of 5 stars Boom in my room","author":"Ix","rating":5,"content":"Absolutely love this speaker! I enjoy the lights as the music plays and the bass on it amazes me for the size of the speaker. So far the battery life on it is great and I enjoy the fact that more than one phone can be connected. Sound quality is awesome and definitely worth it.","timestamp":"Reviewed in the United States April 14, 2024","profile_id":"AEDPLELEJ3GFWCCOCPNPL5RADTHQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R16G2MMJ5XX669","title":"5.0 out of 5 stars “🎵Potencia en sonido Nivel Profesional 🔥”","author":"JAHNPABLO","rating":5,"content":"Sony nunca decepciona en sus bocinas pero con esta demostró ser uno de los líderes de mayor calidad 🥳la bocina es bastante potente y tiene mucha potencia en los graves 🎵🔥Su duración es banstante podría estar fácil unas 8 horas con todas las funciones activas (incluyendo la iluminación)la recomiendo en su totalidad aparte de ser bastante bonita visualmente 😍Le doy ⭐️⭐️⭐️⭐️⭐️ (5/5)","timestamp":"Reviewed in the United States April 1, 2024","profile_id":"AHTJCPKLAFRBHRNXDNXTHEFFEXDQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1IL4U87YV4FO1","title":"4.0 out of 5 stars UPDATED at bottom! XG300 from 3-5","author":"K. Parks","rating":4,"content":"This review is for the XG300 model overall the speaker looks awesome and I really like the handle the sound quality is good it has that Sony sound but the output is pretty lackluster for a speaker of this size and weight. It definitely gets pretty loud I was just expecting louder I paid 199US for this speaker and I think it's a fair price, at the MSRP of $349 absolutely not. Overall I don't see much improvement over the XB43 other than it's looks and the handle. The live sound mode is pretty good also for certain listening experiences.Just bumped it up from 3 stars to 5 for a few reasons the sound quality has definitely improved over the months I've owned it and the battery life on this thing is amazing. It's had several updates and literally everything on the speaker is improved now. Even with LDAC enabled in Bluetooth settings the battery still goes all day. If you can get this for under $200 it's a awesome speaker!","timestamp":"Reviewed in the United States January 9, 2023","profile_id":"AGOB5SI6TWNYCX4LSTSER2XB2LQQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3PNG3LRSGFIQ3","title":"5.0 out of 5 stars La mejor bocina portátil","author":"Ethan","rating":5,"content":"Demasiada calidad el sonido se escucha súper bien la mejor inversión en un parlante portátil","timestamp":"Reviewed in the United States June 1, 2024","profile_id":"AGQ3AXSW3IIYDAGN4PCE7J66RKQA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:43","page":5,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=5","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=6","asin":"B0B43Y8GHZ","page":6,"pages":43,"reviews":[{"id":"R5B6UZMN7RTAZ","title":"5.0 out of 5 stars Excellent speaker","author":"Anunnaki","rating":5,"content":"Very nice product","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AHJMFNC3WRALBP43NH7N3GNTCF6Q","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R2ZS8GWWYLSG02","title":"5.0 out of 5 stars excelente","author":"Johan José Joves Cáceres","rating":5,"content":"excelente","timestamp":"Reviewed in the United States June 18, 2024","profile_id":"AH52KQVN5UIQZ7LMPYM56SZ4EJ3A","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R2XJY91LRK9GMX","title":"2.0 out of 5 stars Charge doesn’t last.","author":"dagnygirl","rating":2,"content":"We purchased this for a Christmas present. Did not get to use it. Extensively until summertime at our pool. It runs out of charge in just a couple of hours. Very disappointing especially for a Sony product. Adding insult to injury, you cannot plug it in to charge and play it at the same time. so this rather expensive item is useless for the purpose that it was intended for. Would not recommend it. The description says the battery life is 25 hours. I have never gotten more than a couple of hours out of it. It is too late to return it, but I wouldn’t mind hearing from Amazon or Sony regarding a replacement in the event that this one is defective or refund.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AFOD7RC4ADXJZAT22FNDNDCS6XNA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1Z2ANTQFCNFFZ","title":"5.0 out of 5 stars Disco Lights can be Turned Off. GREAT Speaker!","author":"consumer d","rating":5,"content":"Fantastic! I have a smaller Sony bluetooth speaker. This sounds GREAT, but is just the same on a bigger and louder scale. For reviews that hated the \"disco\" lights on the side, those can be turned off. There is a switch in the charge area. Gorgeous looking speaker. Time will tell how the fabric holds up, but manual says it can be washed with water. I bought a case for it also. Note that this is BIG, and that it is not the kind of speaker that can get tossed in a backpack. More of a party speaker. I think that Sonys are really the best speakers out there, and this does not disappoint. There also is a battery health saving mode that does not let it fully charge. Hopefully that will help it last. LOVE IT!","timestamp":"Reviewed in the United States September 28, 2023","profile_id":"AEHTFSNOEZODUAPJAKGI677SL5MQ","is_verified":true,"helpful_count":12,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R2W2WWFZZURB0X","title":"5.0 out of 5 stars Sounds great and plays loud without distortion","author":"Soccer99","rating":5,"content":"I purchased this Sony portable speaker to replace a Bose mini that I’ve had for years (the Bose still sounds very good but the battery no longer holds a long charge).The Sony sounds great - full and rich base with crisp highs. The unit plays nice and loud, will be great for the beach! I guess I didn’t pay attention to the specs as the unit is much larger than I anticipated when I ordered. The integrated carry handle makes it easy to carry, but it’s still rather large.Keeping the Sony despite the size because the sound is crazy good. Looks like you can also use several in parallel (not sure if all have to be Sony?). The light feature can be turned on and off and, there is an input plug so you could use this speaker as a guitar amp! Now, that’s definitely great for the beach!!I don’t know if there is a carry case, haven’t looked yet, but the unit is described as water and dust resistant/proof.I’ve only just received the speaker but I don’t see any obvious flaws or blemishes that might be of immediate concern - we’ll see how this unit holds up after a coupe trips on the boat and to the beach - the real test!!!","timestamp":"Reviewed in the United States April 18, 2022","profile_id":"AETS5JPRCP7L2F37BVYBYOMHBIYQ","is_verified":true,"helpful_count":8,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R2S5XRZQQAQNVA","title":"5.0 out of 5 stars Awesome speaker","author":"Phil","rating":5,"content":"Great sound, pretty loud too. Great bass. Long battery life. Haven't tested the waterproofness. Overall great speaker! This thing is awesome.","timestamp":"Reviewed in the United States May 9, 2024","profile_id":"AHUZJQTKHBUSQO3QXUSHBRLZYTCQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3UET9D1P4ZZ6A","title":"4.0 out of 5 stars Great speaker","author":"SBRlickJosh","rating":4,"content":"Speaker sounds great ,bass is very good not overdoing it would give it 5 stars but they sent wrong color , still is a great speaker","timestamp":"Reviewed in the United States December 31, 2023","profile_id":"AFJNGJSEUZZWWFGOJ6VOCZVXX6DQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"ROS5Y36XVWLFM","title":"4.0 out of 5 stars Great Sounding Boombox!","author":"Upper Left Coast","rating":4,"content":"The sound was good for critical listening, and LOUD too. Nice array of party features, flashing lights are okay fun. APP features were too basic, with minimal controls and, a three-way tone control, NO equalizer feature.This \"sold as like-new\" purchase, at best, only good. I suggest buying new and not from warehouse. Quality inspection and ratings don't match the actual condition I received. Returning.","timestamp":"Reviewed in the United States August 21, 2023","profile_id":"AF7KGVOONGMFZ6RPVZ53KGSIC5KA","is_verified":true,"helpful_count":4,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R2MX9040QGOV34","title":"5.0 out of 5 stars It's so cool","author":"Mario Petersen","rating":5,"content":"Sound quality is in the goldy lox zone. I love the mids and the bass. I would pay the full price, it's worth it.","timestamp":"Reviewed in the United States April 15, 2024","profile_id":"AE5GU6YKWA56EQJ2JZRUN6FMBGXA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R8Q3EPRBFC3EF","title":"5.0 out of 5 stars Great sound.","author":"Lissette","rating":5,"content":"Got it for hubby for Christmas. He loves it. Older genx more like a young boomer had no issues connecting it to his phone. Threw him back to the nineties and he’s carrying it around like a boombox 🤣. Blasting it in the backyard when grilling. Acting like a teenager. He loves the gift and it sounds awesome. The lights are pretty cool too. My actual teen is jealous.","timestamp":"Reviewed in the United States January 1, 2024","profile_id":"AFNO2CRWTW4X6LZE7YZG6JMFZTLQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: BlackStyle: SRSXG500"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:44","page":6,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=6","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=7","asin":"B0B43Y8GHZ","page":7,"pages":43,"reviews":[{"id":"R22G2AIZH0N5Y2","title":"5.0 out of 5 stars Best Bluetooth Speaker!","author":"CBA_716","rating":5,"content":"Perfect for anywhere; outside, car or indoors. I love how loud and clear it is! Fantastic quality!","timestamp":"Reviewed in the United States April 14, 2024","profile_id":"AHYIQG2MD4BVFI7P3JWMKZVVRHBQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"RAXIZEFARE6JR","title":"5.0 out of 5 stars Great sound","author":"Easy E","rating":5,"content":"Sounds awesome. We will see how the battery life holds up. My Samsung paired instantly and even showed an image of the speaker during pairing. Boots up and connects very quickly. Sturdy design.","timestamp":"Reviewed in the United States March 10, 2024","profile_id":"AEHWHDQGNN2XRA2263SMMFWN4ZSQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3EREYJJMSWSX0","title":"5.0 out of 5 stars Best speaker I own.","author":"Chase","rating":5,"content":"I sold my big dolphin party speaker for this. I don’t regret it.","timestamp":"Reviewed in the United States April 20, 2024","profile_id":"AEN33ZBJTF5NZWISPBGTHHHCTKCQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RO1TWMF08Y0B0","title":"3.0 out of 5 stars Poco volumen","author":"Good","rating":3,"content":"Lo compre porque mi amigo tiene uno y lo había escuchado y sonaba exelente con mucha potencia, pero el que me llego no tiene el mismo volumen lo siento mucho más bajo el volumen 🎚️ y no me convence ..","timestamp":"Reviewed in the United States March 23, 2024","profile_id":"AEFVVGWINCRZIXB5IP27GA2VTG3A","is_verified":true,"helpful_count":3,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R16QMDNRF748H1","title":"5.0 out of 5 stars My favorite speaker","author":"Jo_Jo","rating":5,"content":"This is my new favorite speaker. The performance is awesome, the sound quality is one of the best for the price point. The size is perfect to carry around the beach or parks even family gatherings. I’ve received a few compliments sound quality and loudness of the speaker. The battery life is surprisingly long. I love the design also very simple. The bass could be louder but overall I know I will be happy for a very long time with this speaker. 2 of my friends already purchased the same speaker hehe. Good job sony!","timestamp":"Reviewed in the United States October 6, 2023","profile_id":"AFTSSJMMNWVQC62FYQ24DA5WRZLQ","is_verified":true,"helpful_count":15,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R27A8G6ZC8TUKQ","title":"5.0 out of 5 stars Great overall but one thing!","author":"Tanja D.","rating":5,"content":"Great speaker I would recommend to buy! I got mine on prime day 😉Sounds fantastic 🔊!!Looks 👀 great definitely feels good 👍!The handle could be even not lopsided!Not the only thing I find is not true, is the battery 🪫 life is not as high as said above 👆!I charged it all the way yesterday when I got it and now it’s already on 60% and I have only played maybe 5 hours if I count the time together!But love ❤️ the sound it’s my best portable speaker I think, I have a bit smaller Bose speaker 🔈 and this one Sony sounds just as good if not better!Giving this product 5 stars ⭐️","timestamp":"Reviewed in the United States July 13, 2023","profile_id":"AGV7SE6HFUPFIS3MCBVCCRWLY3DA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R3TICSYGLKYP3I","title":"2.0 out of 5 stars Gigantic and heavy","author":"Jesse","rating":2,"content":"The sound is great but you do not want to travel with this beast. Even if it fits in your suitcase, you'll pay extra for being overweight. I'm planning to return it and downsize.","timestamp":"Reviewed in the United States August 28, 2024","profile_id":"AHAJUTT63X63GSFDJXMAQR6CXY3A","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RK5GJ9VKITL3I","title":"5.0 out of 5 stars Sound quality and Bass","author":"Carl Smith","rating":5,"content":"This speaker feels the room and packs plenty of bass with the mega bass feature and without, LED lights on the sides are another plus side as the lights flash and flicker different colors according to the music mood. I like it also this speaker is pretty big, I was kinda of shocked by its size once opening the box","timestamp":"Reviewed in the United States December 11, 2023","profile_id":"AGZ3TWNIG4Q6MTQRJBTPGEZ6VRTA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R2OX3K4ZEBIJMF","title":"5.0 out of 5 stars Respect for Sony.","author":"Ficker","rating":5,"content":"I own a lot of speakers and headphone specious.But, a rich well-balanced and sweet sound from a single speaker?It's my first !","timestamp":"Reviewed in the United States March 4, 2024","profile_id":"AE7HVYWHTQECAJT6IW7MDBHGGUKA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"RA8CA2TCN026R","title":"2.0 out of 5 stars Not nearly as loud as my last","author":"norbert","rating":2,"content":"This speaker looks nice sounds nice , but unfortunately it’s not really as loud as one would like .inside next to a wall it’s fine outside with nothing around it not good at all. Battery life is average for one of these speakers as I have 3 different models. My oldest was the best xb43. Loud xlnt battery life but not made anymore. Going to be shopping around .","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AHYRC4X2GEHVZXTRVKZWOVRXTQVQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:45","page":7,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=7","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=8","asin":"B0B43Y8GHZ","page":8,"pages":43,"reviews":[{"id":"RP1T17JTQZABC","title":"5.0 out of 5 stars Easy to use and that bass","author":"C. Washington","rating":5,"content":"This thing sounds great. The bass comes through hard when you have the Mega Bass on. You can still hear the highs and mids though. If the bass is too much you can turn the Mega Bass off for a more balanced sound. The only griep that I have with this thing is that it will roll over on uneven surfaces. This could lead to it getting dirty but it is also straight forward to clean.","timestamp":"Reviewed in the United States September 27, 2023","profile_id":"AFKMAMCALPII54DTDNDPPZXBBWJQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R3GEZ5FZRA337K","title":"4.0 out of 5 stars Husband loves it...","author":"YAHNIA","rating":4,"content":"The volume is not that great ,decent- but not great for the cost. Battery life is amazing. Its a little heavy yet feels like a quality product. Like that you can switch seamlessly between devices. Also it charges other devices without wearing out battery. Would recommend!","timestamp":"Reviewed in the United States July 20, 2023","profile_id":"AEAWR7DQGO3MRBAX644GPC4DQXPQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3LVUBE6JJP3OD","title":"4.0 out of 5 stars Quality Sound, but Not as Loud as I Thought","author":"Rater","rating":4,"content":"The sound and bass is absolutely spectacular! It is just not as loud as I thought it would be. With 20 adults dancing in a room, this just won't quite make it. Also, I found that if I tilt the speaker off its legs, the sound has a better spread.","timestamp":"Reviewed in the United States July 12, 2023","profile_id":"AE7O24KLWAR3G5VCBZFXZSF3R64Q","is_verified":true,"helpful_count":4,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"RH5B9KF7RN234","title":"4.0 out of 5 stars Great for outdoors! Little big and heavy","author":"Karen Barnett","rating":4,"content":"I find it easy to use and great for outdoor use. It bigger and heavier that I anticipated so not good for travel.","timestamp":"Reviewed in the United States September 17, 2023","profile_id":"AGLNRXXYG4RUUUASAFHUK2BZELOA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RDUV5PMIFS1JW","title":"5.0 out of 5 stars Best purchase this year","author":"Camilla T. Jones","rating":5,"content":"I can’t say enough about this super-powered stick of sound dynamite. Perfect for enhancing your listening from just about any device. Sony didn’t skimp on that famous MegaBass, either. Definitely not for purists, of course. But for convenience, portability, durability, and ease of listening, I’m very pleased. Oh, and its circular ends have a pleasing color display that’s subtle and fun, not obnoxious.","timestamp":"Reviewed in the United States October 25, 2023","profile_id":"AGGMTDVKJMD7CJE4FDGXGLXI4GSQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"RIWBE18S4Q48Q","title":"5.0 out of 5 stars Great Speaker","author":"Newbird","rating":5,"content":"The sound is a little underwhelming for the size and price, but I guess that's kind of inevitable, given the size and price. ;)I'd buy it again, if only for the design.","timestamp":"Reviewed in the United States January 8, 2024","profile_id":"AHB3KLEDEBZDGGWZFCTYOUADSVGA","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R18A4GYE912Y2K","title":"5.0 out of 5 stars 👍🏻up for Sony XG300 bluetooth speaker!","author":"Customer","rating":5,"content":"I really like this bluetooth speaker! It has good clarity with different types of music. I connected it successfully to several different Apple devices with ease. You can turn the lights on or off and do a couple of other things without downloading the app, and the lights do change colors in sync with the music.","timestamp":"Reviewed in the United States October 31, 2023","profile_id":"AE3JH52F7NE6O4PCVIIQLGETX2CA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R1OG3NQ0ZDYF0E","title":"4.0 out of 5 stars Bass and Battery life.","author":"livingstone","rating":4,"content":"Overall the speaker is great, but the bass is not as good. You need bass boosted to have a little bit better bass. The battery life is just descent.","timestamp":"Reviewed in the United States July 27, 2023","profile_id":"AGUZNSEUVV25OZW7VJ7LIROCIVRA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R1BLT7KWWEJ9R9","title":"5.0 out of 5 stars Good volume. Long lassting battery","author":"MacBits LLC","rating":5,"content":"Speaker works extremely well for what it is. Gets nice and loud while the battery lasts for a while. The lighting is a gimmick but fun at times. It will roll away if on an uneven surface but so far has survived some serious impacts and rough treatment.","timestamp":"Reviewed in the United States November 6, 2023","profile_id":"AFKW5M2EMDFMJE3TD3D6WKYG4HCA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R2MTZK3GIFK1XV","title":"5.0 out of 5 stars I just bought a second one - Excellent","author":"Rob","rating":5,"content":"I purchased this for one home and just got another for 2nd home. Great design features and superlative sound. I am an audio perfectionist and this is very, very good sound quality. The aux input jack allows you to plug in an Alexa product to command it (or you can bluetooth it too).If anyone knows of the Altec Lansing iM7 - I was looking for a boombox to replace that quality level and this was the one!","timestamp":"Reviewed in the United States August 17, 2023","profile_id":"AHEOBT7ZKPUOA5HRDHB74JN23STQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:46","page":8,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=8","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=9","asin":"B0B43Y8GHZ","page":9,"pages":43,"reviews":[{"id":"R654SFKFP2GQS","title":"5.0 out of 5 stars More than what you asked for.","author":"Galen V Henderson","rating":5,"content":"This device is much heavier than expected but the sound volume and quality is much better expected for it's size. Battery life is fantastic and time to charge is surprisingly short. My wife tells me this was the best purchase that I could have made. For those who buy this speaker, this is a win-win situation.","timestamp":"Reviewed in the United States October 10, 2023","profile_id":"AEQ3HCFUISSY6X5JPFEWAUFJKSUA","is_verified":true,"helpful_count":3,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3IUPDWAYUPWJJ","title":"5.0 out of 5 stars Good","author":"Mike","rating":5,"content":"Good product","timestamp":"Reviewed in the United States March 23, 2024","profile_id":"AHHAJ3VQU5WQPICAF6NA45O5X3XQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R18HNRYW7T1GZD","title":"5.0 out of 5 stars Amazing sound and good battery life.","author":"Kelly Fitzpatrick","rating":5,"content":"The sound is really good and the quieter qualities of songs really come through clearly. My favorite feature is that you can turn off the decorative light feature.","timestamp":"Reviewed in the United States January 14, 2024","profile_id":"AEWG7EM2GYJVZX75SY2NHG2UD6WA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R35ZSXZ4MC80DC","title":"4.0 out of 5 stars Impressive","author":"Godric","rating":4,"content":"I got the srs xg-300 and was expecting quality. I was not expecting the big sound from such a small package. I don't get to have many nice things so, I saved up so I could have another one to listen in stereo. I'm excited like a child at Christmas.","timestamp":"Reviewed in the United States May 14, 2023","profile_id":"AGAQQQSKFE2PC6VDZ4WK7NORJFZA","is_verified":true,"helpful_count":24,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R36K8Q4M96JJY5","title":"3.0 out of 5 stars Price doesn't equal sound quality","author":"Mr. Mudduck","rating":3,"content":"Great battery. Lights r nice I guess. Handle blends in when not carrying. I like that. Non of that stuff matters if the sound can't keep up..","timestamp":"Reviewed in the United States January 18, 2024","profile_id":"AGRMAHL3QZ77NWH7MK4CTICP2UUQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R4DQ155HTANMP","title":"1.0 out of 5 stars Worst ever I have seen- genuine review","author":"saichand","rating":1,"content":"I have purchased on Amazon, it is delivered on 30Aug2024. I already had Sony 2016 year home theater ( sound bar + woofer). I thought this will enhance the experience by placing it behind couch.The sound quality is very cheap. No stereo. Very much lagging in playing stereo sounds. By pressing boss button it is playing elevated boss but lacking sound quality of crispy voices and detailed sound.My old Sony home theater is 100 times better.I wonder how Sony producing such cheap audio devices. Very much shame on them. Waste of your money. DON’T buy, you feel regrets.","timestamp":"Reviewed in the United States September 1, 2024","profile_id":"AHOKLEBQ42FW4EM255UBE5NT72DA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R1LYYARESFFX05","title":"5.0 out of 5 stars Na","author":"zorba","rating":5,"content":"Na","timestamp":"Reviewed in the United States March 20, 2024","profile_id":"AEJINZSPL2OFDX3HKFAXPFZYISBA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R91ZN0F82NI63","title":"4.0 out of 5 stars Great Sounds","author":"Perry Tinsley","rating":4,"content":"Like the overall sound and bass of the product. Could have used more volume. Sound quality is good but just not loud enough for the paid price. Overall, a very good product.","timestamp":"Reviewed in the United States June 18, 2023","profile_id":"AEYAHKTGT3S3GXCSJIVFHVIBVM4A","is_verified":true,"helpful_count":5,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R13KMAWPNAH8OD","title":"1.0 out of 5 stars Something Wasn't Right!!!!!","author":"MELLY Z","rating":1,"content":"I'm giving one star do to the fact that I felt something was \"off\" about the speaker itself as soon as I pulled it out of the box. It came with the cords and instruction manual BUT the speaker itself had no factory stickers or protective film. I found it odd because everyone knows upon purchasing new products - there is usually SOMETHING (such as a sticker and/or protective film) giving the purchaser some type of assurance that they just bought a BRAND NEW product. But I just tried brushing it off and plugged that baby in. I charged it and played a couple songs but that was it. It was late and so it wasn't until New Year's Eve that I had actually tried out the volume level and \"MEGA BASS\" feature and I noticed the second time I actually powered it on that there was definite distortion or static. My friend who was over noticed it as well. So after playing detective and after watching multiple un-boxing videos of the SONY SRS-XG500 I noticed they all came fresh up outta the box with two blue stickers located on the front of the speaker. MINE HAD NOTHING.I called SONY and they confirmed that it most definitely should have had the new stickers attached. They had me to two different reset features in hopes to fix the sound trouble - but to no avail.They (SONY) is sending me a pre-paid shipping label and sending me a NEW SONY SRS-XG500 from the actual warehouse. I WHOLEHEARTEDLY BELIEVE I WAS SOLD A \"RETURNED/REFURBISHED\" speaker. I own a SONY speaker and its pretty old - RDH-GTK37 which has been through three pretty big parties and my daily listening habits with nothing to complain about.Just thought ya'll should know.","timestamp":"Reviewed in the United States January 3, 2023","profile_id":"AHTTJ3DUYNGE53YHQ5JOA6FG4FQA","is_verified":true,"helpful_count":16,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R3BGN9472LK5X6","title":"4.0 out of 5 stars Clipping!","author":"Millyt","rating":4,"content":"It's really good but it the one sides clips when at a certain loudness, not sure why","timestamp":"Reviewed in the United States July 15, 2023","profile_id":"AGZHXVYFFZ6J6CY7ES6EKDLKQTEQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:47","page":9,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=9","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=10","asin":"B0B43Y8GHZ","page":10,"pages":1,"reviews":[{"id":"R9B3KL2WUR67E","title":"5.0 out of 5 stars Great sound, surprisingly durable","author":"Bob Chuckelson","rating":5,"content":"Sounds amazing, will easily push 8 hrs max volume. Dropped it from about 20 feet up in a warehouse, the side cover came off and the speaker rattles a little bit but it still works completely fine otherwise. This speaker was made to take a beating.","timestamp":"Reviewed in the United States September 16, 2023","profile_id":"AE2BXSKQ726H5R5IDAOCAHPMEEXA","is_verified":true,"helpful_count":4,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R2OS7WY4JRQPOD","title":"5.0 out of 5 stars Amazing sound","author":"CL","rating":5,"content":"The sound on this is a huge step up from other speakers the lights add an extra fun element I take this with me everywhere and love it","timestamp":"Reviewed in the United States December 1, 2023","profile_id":"AFKPPP6KOCJTZSICWHSHLGPZTYVA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1EQXVNQSI7ESF","title":"5.0 out of 5 stars Great","author":"yevgeniy","rating":5,"content":"Works great has pretty good bass. batery takes a while to charge other than that very nice speaker.","timestamp":"Reviewed in the United States December 30, 2023","profile_id":"AFHJFB5VPNSCMQNCMMRTT2N6T6GA","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R22LI6CE373TUF","title":"5.0 out of 5 stars The XE200 makes this XG300 even better","author":"rC","rating":5,"content":"The media could not be loaded. The xg300 has every convenient option that could be added to a X series Speaker capable of pairing using Sony music centers speaker groupings and creating a great speaker system with different design to play music simultaneously. I recommend definitely the xg300,500 or the xE200 at the cheapest asking price. 🤙 headphones on and volume up For video demo in speaker pairingMode via Sony music center app paired to the sonysrsXB33","timestamp":"Reviewed in the United States June 6, 2023","profile_id":"AFOVFNQ5IS3KQGACJ5HECNXVZRRA","is_verified":true,"helpful_count":8,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R1Z3RSFRKSA1FN","title":"4.0 out of 5 stars Great but as a consumer in the farming industry, I can see a few improvement possibilities","author":"Darin","rating":4,"content":"Great speaker highs to lows are all distinguishable, can hear is fairly clear over a track for at 75 percent. Can charge anything that has usb..What it does need is better/thicker material for the cloth cover. Also they should add a thin strip the rubber they use for it’s stands around the outer most part of the ring, as extra safety. If not for that I would give 5/5Maybe I’m petty but for the price they can deff do that.Aside from that this thing IS one of my favorite speaker puchases. thank you don’t for finally making a product I wanted enough to spend almost half a grand!!","timestamp":"Reviewed in the United States October 11, 2021","profile_id":"AGPAHHDOG4CHAVLO45MWX2YGJEOA","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R1EVQO5MU72IXE","title":"3.0 out of 5 stars Battery life is nowhere near close to 20+ hrs","author":"newsguyoh","rating":3,"content":"I had high expectations for this unit. The Soundcore Anker Motion Boom Plus IP67 Outdoor Speaker has better sound quality. Unfortunately, the passive radiators rattled with a good amount of bass pumping in the Soundcore. This Sony comes close to the sound of the Motion Boom Plus but falls a bit short. Hoping a JBL unit will provide what I'm hoping to hear.","timestamp":"Reviewed in the United States August 16, 2023","profile_id":"AGEU7KF3EHJCAU2ELOYKDOPLOTSQ","is_verified":true,"product_attributes":"Color: Light GrayStyle: SRSXG300/H"},{"id":"R8PTX1S5GTMOI","title":"5.0 out of 5 stars The sound is magnificent","author":"Bruce A.","rating":5,"content":"I love it","timestamp":"Reviewed in the United States February 7, 2024","profile_id":"AG7O3CQVGXW52BHONENXZJWS5RCQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R1US931WTGICG1","title":"1.0 out of 5 stars Not new product and terrible sound","author":"Amazon Customer","rating":1,"content":"I bought this on Amazon’s day fir 50% off. When I received the product I noticed it was missing the manufacturer seal on the box and also it supposed to have blue stickers on the speaker indicating it’s brand new. I knew it wasn’t new probably returned before or refurbished. For the speaker that big the sound is not loud and as good as I expected. I returned it as ups pick up. They have received their product and still haven’t issued me my refunds yet. Amazon usually refunds me as soon as i return the product in to their handlers.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AH4M3MNIEY2ACA6EHKP5SPGA2LUA","is_verified":true,"helpful_count":4,"product_attributes":"Color: BlackStyle: SRSXG500"},{"id":"R3VV70616GJDET","title":"5.0 out of 5 stars Love this speaker SRS-XG300 - Amazon reviews are mixed for different models","author":"Yeathatsme","rating":5,"content":"Bought this for my boat when I am fishing, ended up buying a second for home. Sound quality is nice an clean. Gets loud enough to hear a podcast over a hot tub running with no issues. If you have the sony app you can control how the lights function, and pair more than 1 speaker as pairs or separate speakers playing the same. Beats my Bose hands down, a bit bigger but not huge like the xg500","timestamp":"Reviewed in the United States April 4, 2023","profile_id":"AHGBQMKVMKNXOZRXFTJRSBYNDJ3Q","is_verified":true,"helpful_count":9,"product_attributes":"Color: BlackStyle: SRSXG300/B"},{"id":"R3MEQG3A5I1BXQ","title":"5.0 out of 5 stars Awesomeness","author":"rulz","rating":5,"content":"Awesomeness","timestamp":"Reviewed in the United States February 9, 2024","profile_id":"AFDJZ2RCAAFMRS5DCW65SUSFWFVQ","is_verified":true,"product_attributes":"Color: BlackStyle: SRSXG300/B"}],"page_type":"Question","asin_in_url":"B0B43Y8GHZ","product_name":"Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker IP67 Waterproof and Dustproof with 25 Hour-Battery and Retractable Handle, Black- New","parse_status_code":12000},"created_at":"2024-09-08 14:36:36","updated_at":"2024-09-08 14:36:49","page":10,"url":"https://www.amazon.com/product-reviews/B0B43Y8GHZ?reviewerType=all_reviews&pageNumber=10","job_id":"7238555832953101313","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-08 14:36:36","domain":"com","geo_location":null,"id":"7238555832953101313","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B0B43Y8GHZ","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-08 14:36:49","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7238555832953101313","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7238555832953101313/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7238555832953101313/results/1/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/2/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/3/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/4/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/5/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/6/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/7/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/8/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/9/content","http://data.oxylabs.io/v1/queries/7238555832953101313/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7238555832953101313/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7238555832953101313/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7238555832953101313/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7238555832953101313/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7238555832953101313/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555832953101313/results/10/content?type=parsed"],"method":"GET"}]}}