{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=1","asin":"B08BCHKY52","page":1,"pages":331,"reviews":[{"id":"R2NFW464C6ESVJ","title":"5.0 out of 5 stars Great sound for the average room at a great price","author":"Tom O","rating":5,"content":"I was quite surprised. Feels substantial, well made, sturdy, nothing cheap about it. Lots of soft rubber around all sides so it doesn't clunk around when placed on a surface. The sound, without the app, was clear, wide frequency response, deep bass, much richer than I expected for the price. I'd say it's comparable to any of similar size at twice the price. And the long play time comes from a 4200mAH battery, which is one reason for the good heavy feel. It works well in rooms up to about 15 x 15 ft, or outside on a table. Was easy to pair. The top buttons are a bit too universal for me, like trying to remember what each can do is hard if you don't use them often. Very happy though.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AHTDNYOWQ4ZBB56W3DH74B67WV5Q","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"RZLER4HH0SS14","title":"5.0 out of 5 stars Pretty good for the price","author":"Robert S.","rating":5,"content":"For the price it sounds excellent. I'll probably get another to pair with it. It connects very quickly and connects to multiple devices which is cool. Has a nice quality and performs very well. I like the size and appearance because I can put it just about anywhere and it looks good where it's at.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AF4RYOE6PZD2EORDYER4NQXVYAEQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R19QN8GDE3KJXO","title":"5.0 out of 5 stars Finally replace my angler cube Bluetooth spear.","author":"Taz","rating":5,"content":"I had my maker cube for over 7 years. Well made and still charges. But lack sound. This new anker encore is awesome. Great sound from such a little speaker. I gave it to my mom and she loves it.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AHY4X42VOLFWG22LR2KISITCVNLQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RYU4UWAD5IV8U","title":"4.0 out of 5 stars Great up close or in small rooms!","author":"Ethan","rating":4,"content":"This speaker is an absolute bang for your buck. The sound is clear and punchy and can easily be equalized with the included app. However, the bass becomes quite unpronounced when listened to in a large room or from afar. Works great in the shower or on your nightstand!","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AH3S5K2L4VRAZE37TL4ZSFQ4HJ6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R18DKD818EXDMI","title":"5.0 out of 5 stars Great Littel Speeaker","author":"Dave M","rating":5,"content":"Very good quality at a reasonable price. Good sound. Very long battery life. Strap makes it easy to find a place to hang speaker. Sound is impressive for it's small size and small size makes it very portable and easy to stow for camping, boating, etc. Bluetooth range is excellent.","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AHBPUMCCO5NYAVAEWJYF3TMAXY3A","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R4XCAIRR5LQOY","title":"5.0 out of 5 stars Soundcore Anker 3 Portable Bluetooth Speaker: A Splash of Music Anywhere","author":"Jon Prince","rating":5,"content":"The Soundcore Anker 3 Portable Bluetooth Speaker has transformed my music experience, offering exceptional audio quality and portability in a rugged and waterproof package. This speaker is a versatile companion for outdoor adventures and indoor gatherings alike.Pros:Impressive Sound: The audio quality from such a compact speaker is astounding. Clear highs, rich mids, and satisfying bass make for a well-rounded listening experience, whether you're enjoying podcasts, songs, or movies.Long Playtime: The advertised 24-hour playtime is no exaggeration. This speaker goes the distance, keeping the music playing through day-long excursions without worrying about frequent recharging.Rugged Design: The IPX7 waterproof rating ensures that the speaker can withstand splashes, rain, and even brief immersion in water. This robust design makes it suitable for poolside parties, camping trips, or beach outings.User-Friendly: Pairing the speaker with devices is a breeze, thanks to the quick Bluetooth connectivity. The intuitive buttons allow easy control of volume, playback, and even hands-free calls.Compact Portability: The Anker 3's small size makes it easy to toss into a bag or backpack. Its lightweight build ensures you won't hesitate to take it along on your adventures.Cons:Lacks Advanced Equalization: While the speaker delivers excellent sound quality, audiophiles might miss advanced equalization options to fine-tune the audio to their preferences.In summary, the Soundcore Anker 3 Portable Bluetooth Speaker offers an impressive blend of sound quality, portability, and durability. Its waterproof design, long playtime, and ease of use make it a go-to option for music lovers on the move. Whether you're lounging by the pool or embarking on a hiking trip, this speaker is a fantastic companion that brings music to life with remarkable clarity and depth.","timestamp":"Reviewed in the United States August 23, 2023","profile_id":"AHAIX7QACG4MJM7S4U552IFYLURA","is_verified":true,"helpful_count":28,"product_attributes":"Color: Black"},{"id":"R3EAO5RLCV5LF8","title":"5.0 out of 5 stars Surprisingly Great Sound","author":"Brandon D. Jones","rating":5,"content":"This speaker is impressive. It pairs easily, and quickly, and it connects every time. What surprised me was how great it sounded once connected. Usually these small speakers are tinny and have very little bass to them. Not this one...This speaker has crisp, high tones and warm, resonating lows. The range on this speaker is great as well. I can use it out in my yard, walk all over the place to get stuff done and the speaker doesn't lose signal.","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AGVIE3SEBXB423WTCXJXXU6GJHWA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R2JOCTAQJTA2MX","title":"5.0 out of 5 stars Best mix of any small speaker so far","author":"ashlie","rating":5,"content":"The only thing I don't like is that I can hear the speaker faces vibrating but other than that, this is the BEST little portable speaker so far. Not too much bass but it's definitely there and the mix of the highs and lows and mids straight out of the box is great. I love that I can edit the levels further and save multiple custom equalizations in the app! The soundcore 2 was not supported. Very glad I upgraded to the soundcore 3.","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AG7K3HPHHD4EWA354VTZP5VLM5NA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R2SYFPBGFFISTJ","title":"5.0 out of 5 stars Muy buen parlante","author":"Rogelio V.","rating":5,"content":"El altavoz Soundcore 3 de Anker Soundcore es una obra maestra de la tecnología de audio portátil que combina un diseño robusto, una calidad de sonido excepcional y una duración de batería prolongada. Con su robusta construcción y su capacidad para ofrecer un rendimiento de audio impresionante, este altavoz se posiciona como una opción destacada en el mercado de altavoces Bluetooth.Diseño y Construcción:El Soundcore 3 presenta un diseño elegante y resistente que lo hace ideal para su uso en interiores y exteriores. Sus dimensiones compactas y su peso ligero lo convierten en un dispositivo fácil de transportar, lo que permite llevar la música a cualquier lugar. Con una carcasa resistente al agua y al polvo con clasificación IPX7, este altavoz puede soportar salpicaduras, lluvia e incluso sumergirse brevemente en agua, lo que lo hace ideal para su uso en la playa, piscina o en condiciones climáticas adversas.El diseño de los controles es intuitivo y de fácil acceso, con botones táctiles en la parte superior que permiten controlar la reproducción, el volumen y la emparejación Bluetooth de manera sencilla. Además, cuenta con un puerto USB-C para cargar, lo que agrega comodidad y versatilidad a la experiencia del usuario.Calidad de Sonido:El Soundcore 3 ofrece una calidad de sonido impresionante para su tamaño compacto. Equipado con dos controladores de neodimio de 1.7 pulgadas y radiadores pasivos, este altavoz proporciona unos graves profundos y unos agudos nítidos que llenan la habitación con un sonido equilibrado y envolvente. La tecnología de procesamiento de señal digital (DSP) ajusta automáticamente el sonido para obtener un rendimiento óptimo en diferentes géneros musicales.La potencia de salida de 16W produce un sonido potente y claro, lo que permite disfrutar de la música con gran fidelidad y detalle, incluso a volúmenes altos. Además, la función de emparejamiento inalámbrico con otros altavoces Soundcore permite crear un sistema estéreo inalámbrico para una experiencia de audio más inmersiva.Conectividad y Batería:La conectividad Bluetooth 5.0 garantiza una conexión estable y sin problemas con dispositivos compatibles, con un alcance de hasta 20 metros. La tecnología de emparejamiento rápido facilita la conexión con smartphones, tabletas y otros dispositivos Bluetooth en cuestión de segundos.Una de las características más impresionantes del Soundcore 3 es su excepcional duración de batería. Con una batería de iones de litio de alta capacidad de 4800 mAh, este altavoz ofrece hasta 24 horas de reproducción continua con una sola carga, lo que lo convierte en un compañero ideal para viajes largos o eventos al aire libre sin preocuparse por quedarse sin batería.Funcionalidades Adicionales:El altavoz Soundcore 3 cuenta con un micrófono incorporado para realizar llamadas con manos libres, lo que añade versatilidad a sus funciones. También es compatible con la aplicación Soundcore, que ofrece actualizaciones de firmware, ecualizador personalizable y la opción de personalizar la configuración de audio según las preferencias individuales del usuario.En resumen, el Soundcore 3 de Anker Soundcore es un altavoz Bluetooth excepcional que combina un diseño resistente, una calidad de sonido impresionante y una duración de batería prolongada. Su portabilidad, resistencia al agua y su potente rendimiento lo convierten en una opción ideal para aquellos que buscan un altavoz versátil y de alto rendimiento para disfrutar de la música en cualquier lugar y momento.","timestamp":"Reviewed in the United States December 29, 2023","profile_id":"AFO2KYWMHAT5OVIGBA2LOY5JZBOA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1H80Q7TW9I504","title":"5.0 out of 5 stars A gift for a friend for photoshoots","author":"Tea","rating":5,"content":"I gave it a friend and we tested it out one time at a park. We blasted the speakers to full volume and we could hear it some feet away. It was surprisingly loud for the size of the speaker. As he puts it \"you could steal the party with this thing\"","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AEMJUIG6GEMIZS723AOPZ45OELRA","is_verified":true,"product_attributes":"Color: Red"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:11","page":1,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=1","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=2","asin":"B08BCHKY52","page":2,"pages":331,"reviews":[{"id":"R1E90W2N38YVNB","title":"3.0 out of 5 stars Good enough, I guess","author":"J. Payne","rating":3,"content":"For the price, I'm not sure if my complaints are fair, but it's my first Bluetooth speaker. It sounds awful compared to my USB portable speakers that are 10 years or more old, it sounds awful compared to my soundcore 2 ear buds.Even after manually adjusting the EQ to remove most of the bass it still sounds a little to \"bassy\", when listening to audiobooks. When listening to music, it's the same, it constantly sounds like there's something is blocking the speakers, everything it clear enough to hear, but then a muffled effect is layered over everything. Playing songs with bass I absolutely had to turn off the bass boost or it overwhelmed the audio. The best audio I got for music was to set it to custom and leave the low frequency flat and raise the high frequencies, but then bass acted like it was being pushed through a mid range speaker with a low pass filter.You could get decent audio, including songs with bass, by selecting treble boost or voice for music, but it still sounds like there some sort of \"muffled\" audio overlay on the bass. I don't know how to describe it, it's like the speaker can't produce all the base frequencies, but then they're still there coming through the speaker.Anyway if you can get it on sale it's good enough, but I'd look for coming cheaper with clear highs or spend more for a better speaker.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AG6EQ2JGRHU3FDJS34AY27P3P6YQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RGY35T6AJGGCM","title":"5.0 out of 5 stars Great sound","author":"PRS","rating":5,"content":"I bought this to listen to my music around the pool. It has an excellent sound and no weird cracks with the bass. Sets itself up- turn it on!","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AEHJBB7M3M6KZMJN4EJCHSDG3GWA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RQJJPRY6O081N","title":"5.0 out of 5 stars Exceeded my expectations!","author":"Praxia","rating":5,"content":"I don't see how a Bluetooth speaker could get any better than this for the price. Really exceptional build quality and pricing, with amazing sound quality coming from this relatively small device. Well done!","timestamp":"Reviewed in the United States August 31, 2024","profile_id":"AF5KUKEJE6B2JEGOR5SJRABCW7CQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RXFTCPZILCRC6","title":"5.0 out of 5 stars Great sound.","author":"Richard P.","rating":5,"content":"I've had this speaker for about a year now and wanted to write a true user review.It works with my cell for Amazon music on the job-site. The guys enjoy everything this bluetooth speaker offers. Clear tone for sporks talk as well as very good music quality.I connect to a power pack overnight for recharging and this speaker is energized for 8 plus hours of sound every day. As I mentioned, been using it for the last year, 5 days a week. So yes, apperrance, well it's a little worse for wear but it still keeps on working.Richard","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AFWUEOJGHFH3Y4CDHZ5VD44QDPFQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1MEKBXD7IOCS","title":"5.0 out of 5 stars Great","author":"Big daddy","rating":5,"content":"Sounds great and battery lasts a whole 8.5 hour shift and then some at a decent volume level.","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AHM4SARX5ZLFMN6DWKTI7JI7NOCA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R290U588NUBMLH","title":"5.0 out of 5 stars Great value","author":"Tom S.","rating":5,"content":"I already had Sonos and Tribit speakers. The sound on these is not as good as Sonos, but better than Tribit. For the price, I would say that these are the best of the 3. The Anker sounds larger than its size, particularly the bass.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AHQIR2WRLCZPE7ULNZ25Y66ARLTA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R20VLDYQFTSRCD","title":"5.0 out of 5 stars 3 years","author":"Jbimmy Manhu","rating":5,"content":"I have had this thig for 3 years and it has been great. I always listen to music. I have droped it. Been in the rain. Been everywhere. Battery life is good too","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AF5MVDR2V4TZXZ7NMHMOPHX3LPTQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R12YSA4C51FASG","title":"5.0 out of 5 stars Soundcore","author":"Bianca","rating":5,"content":"I purchased 5 of these back in 2022. They are still great and I just purchased two more to add!","timestamp":"Reviewed in the United States August 14, 2024","profile_id":"AGQZGSGUJSEPPKDWB7SEV6LDYNIA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RP8SLNG18C0U2","title":"5.0 out of 5 stars Works as advertised","author":"Aisha Choo","rating":5,"content":"So far, I’m pleased with the clarity and sound quality. It has a very sleek minimal design which is nice. Connecting devices is simple. Overall I’m happy with my purchase. I’ve used the speaker everyday since receiving it.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AEMJS6C4LMGX5HPP2ZMSXGJDZ6ZQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R29DL3W3M4XDO2","title":"4.0 out of 5 stars Not waterproof","author":"peepee","rating":4,"content":"I took this into the sea and 1 hour in, it died and broke(Update) Anker support contacted me and issued me a refund. Since I like the sound quality of the speaker, I ordered a replacement. I really appreciate their proactive customer service. I'll just not take it to the beach anymore.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AENJMHJ5BIDQSIWC2BXYHWMH7F3A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:13","page":2,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=2","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=3","asin":"B08BCHKY52","page":3,"pages":331,"reviews":[{"id":"R342K8RAHTRTTQ","title":"5.0 out of 5 stars Small, great sounding.","author":"G .FULMER","rating":5,"content":"This Bluetooth speaker sounds great. I listen to it all the time.So far no issues. I have it for 2 months. I am Pleased with this purchase.","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AHAJNLF46GFYKLG22GWC4MWDFILQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2AC5WBWO0P9WI","title":"5.0 out of 5 stars WOW!","author":"Jerry Taylor","rating":5,"content":"Great quality.","timestamp":"Reviewed in the United States August 17, 2024","profile_id":"AFCU4GDCWSALD7MQPS6JH6F5JEGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1WH7YZTW7QIIP","title":"5.0 out of 5 stars Great little speaker","author":"Terri Geis","rating":5,"content":"Great sound, I like its extra distance you can be from your phone. Very satisfied with my purchase!","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AF4EVTX4WEAYR7GQMXLHHXYZOH3A","is_verified":true,"product_attributes":"Color: Red"},{"id":"RDO7W5435SU9L","title":"5.0 out of 5 stars Sounds great, no distortion, long playtime,","author":"The best Bluetooth speaker","rating":5,"content":"Perfect for indoor or outdoor setting","timestamp":"Reviewed in the United States August 10, 2024","profile_id":"AHYPHU25YTU4TDDM7IPO5A23DEDA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R10IY2LKB5834P","title":"3.0 out of 5 stars A drop in performance from the previous version of this speaker","author":"Zain Kazi","rating":3,"content":"After using the previous speaker throughout college and after graduating, I was looking forward to using the newest version of this speaker. Sadly, this speaker is a drop in quality compared to the old version.Sound QualityThe sound quality of this speaker is not really an improvement from the previous version, and regular notes sound slightly muddled, but it is not usually very noticeable. Music with words sounds good, bass quality is pretty good, but listening to something like classical music is where I notice the individual notes sounding a bit muddled. The speaker itself can get pretty loud though, which is a step up from the previous version.Battery PerformanceThe battery performance on this speaker lasts me about a week and a half of daily use. This is a significant drop from the previous speaker, which could last me a month of daily use before charging.Bluetooth ConnectivityI have less issues connecting to this speaker than I did with the previous one. With the previous version, issues could come up when I disconnected and reconnected. Haven't noticed those issues yet with this one. My biggest issue with this speaker is that there is a delay in the transmission from my phone to the speaker, so when I watch videos, the audio doesn't sync up with what is being displayed on my phone. This is incredibly frustrating as I watch a decent amount of clips, and never had this issue with the previous version.Overall, this is a nice speaker, but I don't think I would buy it again, and it's hard to justify it being worth the $55 price. The previous version was an absolute steak at $22. Paying over double the price for a slight increase in volume and not much else is absolutely not worth it in my opinion. The speaker is good as a budget speaker, but for $55, it's no longer a budget speaker, and you're better off buying something else.","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AFSNGVI7PXHZ633L6W2VI3ABFDOQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Blue"},{"id":"R17A1H57OKE73X","title":"3.0 out of 5 stars Its not bad but it's not great either. But, worth it if you are on a budget","author":"Hoopy","rating":3,"content":"So, I bought this to replace a Bose Soundlink Bluetooth Speaker. This is not on the same level as the Bose speaker, but the price is about 25% of the Bose.I bought this because I have 2 monitors and I wanted to extend the sound to the edges of both speakers. So I got the Soundcore Anker 3 in the middle of my desk, and 2 Soundcore Minis on each side of the monitors. This setup has solved my problem and now I feel the sound is balanced for both monitors.I have 2 complaints.1) The Soundcore Anker speakers have very good bass, but they are lacking the high end sharpness. The need to make a Soundcore Tweeter,2) when I put the 3 speakers in Party Mode there is a very tiny lag between the 3 speakers. So, there is a tiny bit of echo effect like you are listening to the speakers in a stadium.But, I can live with these minor issue. I am happy to settle with the \"good\" sound quality these speakers.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AHMCTM64XWFNNCTHB4HJA22IKDDA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R1X7QZSA8YX28L","title":"5.0 out of 5 stars Great sound","author":"guy Kaneshiro","rating":5,"content":"Good price and product","timestamp":"Reviewed in the United States August 4, 2024","profile_id":"AHAIMVHQJPRLRL3FQRT7W453YGGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1XNY78MSD7P7B","title":"5.0 out of 5 stars Great sound.","author":"Mike Sullivan","rating":5,"content":"I bought to Replace another soundcore speaker. I think it was the original version. We’re just the Bluetooth quit working. Love this new one great sound battery last I think a full 24 hours or so absolutely love it.","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AEROGWQW7ZVMBOZUKJCZNWL4SZNA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R129XCIYYTEJ1E","title":"5.0 out of 5 stars Great speaker","author":"Kristin","rating":5,"content":"I have always been an anker fan, my dad lost his soundcore speaker so I got him a new one and upgraded him to the newest version…. Worth the $15 difference. Its sound quality is phenom, even better than previous versions of the speaker. Easy to connect to","timestamp":"Reviewed in the United States July 6, 2024","profile_id":"AHJGAZO5QDBWBQXJDEA3R4R55OLQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R1D1OM6EP289J3","title":"4.0 out of 5 stars Almost perfect","author":"Shain Hampton","rating":4,"content":"This was hard to give 4 stars because it's an amazing value and the best option by far in the price range. Its sound and battery are a solid 5 stars for the price but there are 2 things holding it back. One is major and the other is trivial but still annoying1. The latency of about 350ms is bad for anything synced to video. Games, streaming, youtube, etc is all out of sync. I use VLC media player to counteract the latency by hastening the audio by 350ms for movies, but it's a real hassle to use glitchy browser plugins for streaming and forget about gaming.2. Minor issue, but the annoying audio tones it plays when powering on or off and then when connecting. This takes almost 10 seconds where it plays its little fanfare tones while totally drowning out your media. This takes entirely too long and this could have easily been accomplished with simple LEDs on the unit. Because of this, you cannot listen to something from your internal speaker, then switch on the fly over to the Soundcore as you will lose about 10 seconds of audio while doing so.","timestamp":"Reviewed in the United States February 7, 2024","profile_id":"AF5WAN4PNIFUE77XZFAFPGM2EGEQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:15","page":3,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=3","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=4","asin":"B08BCHKY52","page":4,"pages":331,"reviews":[{"id":"R6QZCOVDQ865G","title":"5.0 out of 5 stars Sounds awesome","author":"Elepore","rating":5,"content":"Perfect for evening outside, listening to music or to run my sleep app with the rain. The sound is wonderful.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AGU6PK6J2Y67WMUDFB43QLNK5HRQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R265DZ0HSU724F","title":"4.0 out of 5 stars Good speaker. Easy to pair. good volume","author":"Chuck Gasaway","rating":4,"content":"This speaker was easy to pair with my Android phone. Sound quality is good, as is volume.I see there is a custom EQ app which I don't use.The buttons are large and there is good audio feedback when powering on the device, connecting, and power down. The only real issue is the music symbol for pausing playback. Seems as though a more standard play/pause symbol would be in order. Also, it seems to take about 1.5 seconds to pause the audio when the button is pushed. Not a huge issue, but it's long enough that I keep wanting to push it again, thinking that I didn't push it the first time.","timestamp":"Reviewed in the United States April 10, 2024","profile_id":"AFX5WJGYRZ3PR4V5LXIABYMX65FQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R38MKKZBIPQFEY","title":"5.0 out of 5 stars Big sound for small money.","author":"Patrick J Ohlson","rating":5,"content":"I love this speaker. I take it outside. To the job site. In the shower. Small but the sound is big. Great base for the size without the big brand name price tag. Battery lasts a full day into the next. Before needing to be charged.","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AHYGWVC72GECKNAMQJ4WRJJZ276A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2PKZ1TIAWL2N4","title":"5.0 out of 5 stars Great quality sound for the price","author":"Wesley Steinke","rating":5,"content":"Given the price this is a great speaker I take camping with me","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AGN77EU6X3WO4PSZFHZYK6IAQJYQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3EFLO8DXQGOXL","title":"4.0 out of 5 stars Good sound, good battery, a 'lil thick.","author":"case_hill","rating":4,"content":"oundcore Anker 3 Portable Bluetooth Speaker:Pros:Excellent sound quality: The Soundcore Anker 3 delivers clear highs and deep bass, making it a great choice for listening to music of any genre.Long battery life: The speaker boasts a 24-hour battery life, allowing you to enjoy your music for extended periods without interruption.Cons:Large size: The Soundcore Anker 3 is significantly bulkier than its predecessor, making it less portable.Awkward volume controls: The volume buttons require multiple taps or a long press to adjust the volume quickly, which can be frustrating.Overall:The Soundcore Anker 3 is a good option for those who prioritize sound quality and battery life over portability. However, the bulky size and inconvenient volume controls may be dealbreakers for some users.","timestamp":"Reviewed in the United States March 3, 2024","profile_id":"AFRIJAYRAK2FFDAFXH2SZ3AKMZ2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RLFFR17H6KJL4","title":"5.0 out of 5 stars Great for the price","author":"Amazon Customer","rating":5,"content":"Great little speaker for the price. Long battery life between charges and super easy to connect","timestamp":"Reviewed in the United States July 12, 2024","profile_id":"AEPQESHM7FNRMWLAGWICO66CPTMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2T1BAOM2O6OCB","title":"4.0 out of 5 stars GREAT SOUND AT A GREAT VALUE","author":"Fernando Najera","rating":4,"content":"I purchased this BT speaker to have it dedicated to my SIRIUS/XM receiver so I don't have to mess with the settings on my 'big' stereo every time I want to listen to it. To this end, it functions wonderfully. If you are up close to the unit, it sounds beautiful. It has several pre-set EQ settings but you can also create a custom setting. Once you step away from it (5+ feet), the sound begins to thin out. The bass is almost non-existent. I don't have a big problem with because the size of the unit is realistically not supposed to produce big bass. The sound tends to 'clip' at higher volumes but again, this is not a big issue as I really just need it for background music and don't expect it to be the primary unit for a house party. Overall, this is a very neat little speaker. I like how it is dual channel so you get stereo sound from one tiny box. I would definitely purchase more of these once I buy more SIRIUS/XM receivers for other rooms in the house. This is well worth the price paid.","timestamp":"Reviewed in the United States December 18, 2023","profile_id":"AHGXK6OQPOLO4HUB4FYPDOM7ZN7A","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R1OGKTG4WRWU9E","title":"5.0 out of 5 stars Blown Away by the Excellent Sound","author":"Tracy Balliet","rating":5,"content":"I don't write reviews often. This Soundcore Anker 3 Portable Bluetooth Speaker far exceeded my expectations. The sound quality is excellent! You can easily hear the base, which is important to me.We purchased a Bose and returned it. I highly recommend this speaker instead.","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AHVYI72R6PMXGZG22G7UMKZ2ESUQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3HJGCFQ9W993N","title":"5.0 out of 5 stars Awesome speaker","author":"uriah bufkin","rating":5,"content":"Considering the price, this little speaker is amazing. I was looking at a couple of higher priced speakers for golf but decided to go with this one based on the reviews and features. I'm sure glad I did. For the price of the competition you can get 4 of these and sync them together. Sound quality is plenty good, and it gets plenty loud. It already took a tumble out of the cart and onto the path and is no worse for the wear. This may not be ideal for large gatherings but again, you can sync as many as you want together. Great buy, and one which I will repeat here soon for the stereo syncing function.","timestamp":"Reviewed in the United States April 7, 2024","profile_id":"AHIBYTI27FQRSOVGZOHPWUKHDEPA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Red"},{"id":"R3EV92GYL6I2EX","title":"5.0 out of 5 stars Awesome speaker","author":"Todd Vercruysse","rating":5,"content":"Sounds great, works great! Great price","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AFK7AFUFN6FZRUOTBZNO43IPPQFA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Red"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:20","page":4,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=4","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=5","asin":"B08BCHKY52","page":5,"pages":331,"reviews":[{"id":"R1K3YL2RHHUKMP","title":"5.0 out of 5 stars Excellent quality and volume for a larger space.","author":"K.A.H.","rating":5,"content":"Excellent sound quality and price! Used it for a small graduation performance in a gym and the sound was perfect. Highly recommend.","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AE2TKYEOFKGHO5ITQFLTQD7E3FTQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3FGPSLNJSF1AO","title":"5.0 out of 5 stars Reliable. Good sound quality. Weatherproof.","author":"Lou","rating":5,"content":"I have had other speakers and their battery life is no where near the length of this speaker. The sound quality is excellent and adjustable. I use mine in the backyard almost every day in the warm weather and in a \"she shed\" and I don't worry about it getting a bit splashed with whatever the kids ( or the ladies) are drinking. Wouldn't keep it out in a driving rain storm but I wouldn't be out there either!!!!","timestamp":"Reviewed in the United States May 7, 2024","profile_id":"AG7NL2HNCHI76JUKPJL7XXYQBFKQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2ZB8BTF4AYUSE","title":"4.0 out of 5 stars *5 month update* SOUNDCORE 3","author":"Ryan S","rating":4,"content":"Update***Product was under warranty. I was provided with a prepaid label. Customer service was really easy to work with through email. They sent a replacement. I’m glad to have the crisp and clarity back versus the Soundcore 2. I would give it a 5, but gave it a 4 because I am still nervous leaving it unattended on the charger. I will only charge this when I’m in the same room.UPDATE***Barely using this for four months, it almost caught on fire. I placed this on the charger before bed. When I woke up, the wire felt very hot. I burned my finger on the plug disconnecting it. The USB port on the speaker is melted around the opening as seen in the picture. The side of the Bluetooth speaker was REALLY hot. You can see the cord was melted as well. I used an Anker wall charger while charging this. If I never took it off the charger in the morning before going to work, my house probably would have burned down. Afterwards, battery lasted probably four hours. I’m afraid to plug it back in to see if it will recharge.This is a shame. The Soundcore 3 sounded amazing with custom EQ settings. I will not be spending another $50 to replace this. I guess I’ll be going back to my Soundcore 2. It never melted plugs nor posed a fire hazard.Worth the upgrade from the Soundcore 2. I was hesitant on upgrading my Soundcore 2’s, I have no regrets I did. I have a Soundcore 2 I keep near my shower, and the other Soundcore 2 gets used as a travel and backup Bluetooth speaker. I thought the Soundcore 2 was the best compact Bluetooth speaker due to how well the sound is.After using my Soundcore 3 side-by-side to compare. The sound is night and day. You can hear the bass and the highs are so clear. I love the Soundcore 3. I will definitely be replacing my Soundcore 2’s with Soundcore 3. The Party ast I have yet to use. But I plan on buying a handful of Soundcore 3’s to place in various room to take advantage of the party cast for party’s.If you have the Soundcore 2, you will absolutely not be disappointed with the Soundcore 3.","timestamp":"Reviewed in the United States May 19, 2021","profile_id":"AGEG325DPAA6HYJX4ECDNRINQ6HA","is_verified":true,"helpful_count":17,"product_attributes":"Color: Black"},{"id":"R32L2WT6NW6F8I","title":"5.0 out of 5 stars Love this!","author":"Amazon Customer","rating":5,"content":"I like that when its plugged in, you dont have to continously wake it up by pressing power (like you do with Doss Soundbox)Sound quality and loudness is excellent.Simple controls.The only thing i wish they would change is that it plays a melody when turned on, and a melody when connects to device. The issue is that if i am watching a video , the melody plays over the audio for a couple of seconds - this is very annoying an entirely unnecessary.If the speaker can detect sound being played - DO NOT PLAY A MELODY! I CAN HEAR THAT THE BLUTOOTH IS CONNECTED.... NO NEED FOR MELODY!!!","timestamp":"Reviewed in the United States March 15, 2024","profile_id":"AHBU4NBK7TGSJTS36N67DFITF7XA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R13SO1LJV5B3AF","title":"5.0 out of 5 stars An outstanding speaker, an outstanding company.","author":"Bob Moon","rating":5,"content":"This is my second review of the Soundcore 3. My first review was based on a connectivity issue which was noted by Anker and prompted them to contact me. They resolved the issue quickly and thoughtfully. I’ve never had any company reach out like that.I’ve always been intrigued by small things that perform in surprising ways. When Bluetooth speakers first became available I was intrigued; what quality of sound could be expected from small and unobtrusive speakers? I’ve had a lot of fun finding out.Over the years I’ve occasionally updated my Bluetooth speaker based on newer models becoming better and better, particularly with bass response. Lately I’ve had a chance to listen to several current models in the $150.00 and below price range, including Sony, Bose, Tribit, JBL Flip 5, and Soundcore 3.The Soundcore 3 is the clear winner. The highs, mid range and bass are all impressive, but the bass response is really surprising. Many Bluetooth speakers sacrifice highs and mid range for a muffled, muddy bass, reducing the entire sound to an unsatisfying mess. Not so with the Soundcore 3 which provides very clear partitions between all ranges and a very, very clean bass. The first time I listened to a song with a low, bass drone, I couldn’t believe what I was hearing. It was a composition that I was familiar with. I didn’t know it had a bass drone before. As one online reviewer put it “The Soundcore 3 should not sound as good as it does.” I couldn’t agree more.So yes, the Soundcore 3 is the best Bluetooth speaker available in the sub $150.00 range, by far. It’s small enough to be almost unnoticed in a room, but fills the room with very satisfying, rich sound.","timestamp":"Reviewed in the United States February 9, 2023","profile_id":"AHDBBL5Q3T4ZUL2ATUYYLKHTJNJA","is_verified":true,"helpful_count":20,"product_attributes":"Color: Black"},{"id":"R1MC4KHDQ5MB74","title":"5.0 out of 5 stars Great Sound, Small Package","author":"john","rating":5,"content":"There's a lot to like here. It gets pretty loud but I think if you're looking for something to use at a gathering outside this is not the best solution. This will handle quiet gatherings indoors and will fill a rather large room with sound if it is not packed with people.The battery life is astounding. On moderate volume I will forget to charge it 6 times and it will still play music for hours at a time. When I do finally remember to charge it it does take some time to charge but for the amount of time that I get out of each charge this really is a no brainer.The sound quality is great! Keep in mind it's about 7 inches long....so it's not got a huge woofer in it. They did a great job of designing a bass cabinet though. It does well especially considering its size. It could easily be used in a car that doesn't have a functioning stereo and it will do great!","timestamp":"Reviewed in the United States January 5, 2024","profile_id":"AHTMKXQZDJHQCSUSOX44U24FGQVQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R2UWNYPNQF5TFT","title":"4.0 out of 5 stars Overall very good speaker for the price.","author":"Anonymous","rating":4,"content":"It's quite a good speaker for the size and price of it. I do recommend this if you're planning to buy any speaker under $100.The only problem I have with its functions is that there's no bluetooth security, meaning it's always in pairing mode and anyone can connect at any time and play whatever they want, even if you're paired to it first.","timestamp":"Reviewed in the United States February 24, 2024","profile_id":"AF4TXING5RBSQXKU3WGUAIQFOIVQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3E4IPI7JB2M0","title":"5.0 out of 5 stars Loud, amazing sound in a small package","author":"Jason G","rating":5,"content":"I was looking for a small, Bluetooth, battery-powered speaker to use for the beach, fire pit parties, and bike riding. I came across the Anker line of various speakers. I’ve always been impressed with their mobile products, so I decided to look into their speakers. I ultimately decided on the Soundcore 3 for its bass and reportedly louder sound.Whoa was I impressed!First of all, out of the box, the speaker has a very luxurious feel to it. I was also happy with the size. It’s about 6” long and 2.5” tall and deep. Not very big, lightweight, and easily packable. Setup was the easiest thing ever. I literally just turned it on, selected “Soundcore” from my list of Bluetooth connections, and that was it, connected in less than 10 seconds.Next I started playing some music from Apple Music. The sound blew me away. Ok, it’s not a surround sound stereo system with perfectly tuned components or anything. But this speaker plays loud, clear music with a range of tone. Again, impressed. With the volume over halfway, it really bumps in the house. I haven’t taken it outside yet, but it’s perfect for inside. When I’m done using it, I just power down the unit. When I want to listen again, I turn it back on and it automatically connects.I’m very happy with this speaker and I look forward to lots of fun listening to music with it.","timestamp":"Reviewed in the United States July 21, 2023","profile_id":"AFXW2QSUCBU3WUAESLJOPN22S3PQ","is_verified":true,"helpful_count":17,"product_attributes":"Color: Black"},{"id":"RDXQ28YIZ209X","title":"5.0 out of 5 stars Great product","author":"Giorgi Shengelia","rating":5,"content":"Great product from Anker as usual","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AGFAZZFBIZUFSWYULILIVBCQFDAA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2HZISBM7P95NF","title":"4.0 out of 5 stars Marginally better than the Anker 2","author":"Chamby","rating":4,"content":"With more watts than the Soundcore 2, I expected this to be louder and overall a stronger speaker. It doesn't disappoint overall, but it's not as loud as expected. I would have liked it to be a full 20 Watts.","timestamp":"Reviewed in the United States March 9, 2024","profile_id":"AH4LS2GQN4LVDTGHK4LP7SBPZRGQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:24","page":5,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=5","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=6","asin":"B08BCHKY52","page":6,"pages":331,"reviews":[{"id":"R1SN1HDWJJ7L94","title":"4.0 out of 5 stars Works well with mediocre sound","author":"Gregory Gafni-Pappas","rating":4,"content":"I do like the speakers and the volume is good. The sound is not quite as clear as I expected and is more mediocre. Love the brand, and the battery in the speakers is great, lasts a long time. Some of their more expensive speakers may have a little bit better quality sound.","timestamp":"Reviewed in the United States February 19, 2024","profile_id":"AG7R5IJ6M22ZXC5F7FED5QQ2MNCA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R13TYCDXNFZ1O6","title":"4.0 out of 5 stars Works well.","author":"Amazon Customer","rating":4,"content":"Pretty good sound for compact size.","timestamp":"Reviewed in the United States April 6, 2024","profile_id":"AHFKWQ7X3LXJAL6XXKSR75GPPPVQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R127OL1I356UIJ","title":"5.0 out of 5 stars Great portable speaker","author":"Hermeticgamer","rating":5,"content":"Bought this for a gift looking for a balance of decent sound, functionality, size, and reasonable price. This hits all those right where I needed. The sound is loud enough for filling a room without much loss of quality. It’s no Bose or Sonos but it also wasn’t five hundred dollars. The set up was dead simple and with the app, you can adjust the sound profile to your liking with the equalizer. Build seems solid and weighty without being overkill and waterproof is nice so will be good for camping, outdoor events, picnics, etc. It also hit a very reasonable price point for the quality. Would love to test the ability to synch multiple of these speakers in party mode sometime. We have several Anker chargers and power bricks that have held up well so I’m glad we gave this a try.","timestamp":"Reviewed in the United States January 2, 2024","profile_id":"AFCQWAEXO72ANU7JLO3P22LFQZCQ","is_verified":true,"helpful_count":9,"product_attributes":"Color: Black"},{"id":"R3U84S4EDVSZB3","title":"5.0 out of 5 stars You Wanna Be Heard?","author":"SACD Audiophile","rating":5,"content":"The sound quality and battery life can't be beat for the price. I decided to pull this out during Friday evening bowling league...It PUTS IT DOWN!!! I was shocked how loud and clear the sound carried in the midst of strikes and at least 75+ peoples conversations. I use the iOS Anker app with custom EQ settings and it was turned up to about 70-80% at the time.I decided to try stuffing this in my Jansport backpack during a motorcycle ride to my friends house...I have to mention it's in a pocket where I'm able to strategically place the speaker and it's directly blasting below the back of my neck. I wear earplugs, my naked motorcycle has a full exhaust, no windscreen, and there's lots of wind noise on the freeway...can I hear my music??? H*LL YEAH!!!The speaker is completely at the max volume in the aforementioned. But I am truly ASTONISHED how I can make out the words and sing along on the freeway at about 70 MPH!!!I'm so impressed I'm writing this review at my friends house a few hours after arriving. It's currently Sunday, 10/30/2022 @ 5:38 AM.My same friend has an older Bose SoundLink Mini and it does have fuller mids and bass. That's the only thing going for it and I am disappointed how low the max volume is. Maybe Bose has an app that takes it higher? My Soundcore 3 is more clear, crisp at lower volumes, and DEFINITELY more loud.I hope you found my review helpful and have a fantastic day!","timestamp":"Reviewed in the United States October 30, 2022","profile_id":"AFDNUQJYTZR4JYFVSFSL4KHECX5A","is_verified":true,"helpful_count":26,"product_attributes":"Color: Black"},{"id":"R3Q341XNAPXEDR","title":"5.0 out of 5 stars This is a GREAT speaker!","author":"Buyer BeAware","rating":5,"content":"I wrote a glowing review of this speaker a few years ago, when I was trying to establish a CD audio disk system for my car. I connected this Blue Tooth speaker to a Blue Tooth portable CD player. The sound is surprisingly wonderful, given it's compact size. I recently purchased another of these speakers after my computer's sound bar ceased functioning. My computer and Speaker now connect via Blue Tooth. The sound quality of far better than the that of the sound bar. It connects easily with the computer without hard wiring them together. I can place the speaker anywhere on my desk, or nearby, to listen to music, videos, etc. This is a GREAT speaker that meets my needs at a very reasonable price.","timestamp":"Reviewed in the United States January 19, 2024","profile_id":"AFF7LCFYXPGQJG2ULR4S725HUEEQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"RU0JMF1BIWQEZ","title":"5.0 out of 5 stars Amazing sound in a small package!","author":"Paul","rating":5,"content":"This thing sounds great and the battery lasts much longer than the many other Bluetooth speakers I've owned over the years. I like the app which has an EQ, it's a great feature to alter the sound between listening to various types of music and podcasts.","timestamp":"Reviewed in the United States May 4, 2024","profile_id":"AE4EHPCRQ4FFZZTH6DM3LDZCCZPQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RDM9R1YE8JRPP","title":"5.0 out of 5 stars Amazing!","author":"star","rating":5,"content":"Exactly what I wanted, exceeded expectations. Great little machine. Easy to use and sounds fantastic— I was using a $30 speaker and this is 7x better for not even $20 bucks more. Glad I went with this one!! So happy!","timestamp":"Reviewed in the United States May 4, 2024","profile_id":"AEN3QBJYBCNM5WBPX52FA4DOXCLA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RJ0FSRCVBBBDR","title":"5.0 out of 5 stars Harmony","author":"Bentley","rating":5,"content":"We'll sounded speaker","timestamp":"Reviewed in the United States June 18, 2024","profile_id":"AGZPE477OKT4OFHJDYAZJFYQENTQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1MIGX9AMFY59B","title":"5.0 out of 5 stars Great customer support","author":"Pat","rating":5,"content":"Our speaker stopped working after five months. Called support and they shipped out a new speaker said it will arrive in 3 to 4 business days spoke to Justin he was really nice and took care of the situation. Thank you for having companies with great support","timestamp":"Reviewed in the United States April 18, 2024","profile_id":"AHHV26B4ZSR3WKF6S6ODXVLDGL2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1M6CTM5ERWSPC","title":"3.0 out of 5 stars The Lows","author":"Christian T.","rating":3,"content":"I loved this speaker for its form* factor and build quality. If you're looking for a speaker cheaper then a jbl flip 4 through 6 and the jbl clip 4 this is a fantastic option. It's pretty loud even in open environments and drowns out constant humming and buzzing noises in my workplace but not too loud to not hear your coworkers if they really wanted your attention.I personally listen to a multitude of genres on various speakers daily so i quickly get an idea of what sounds out of place, overblown, underwhelmed or broken pretty quickly. I liked the sound provided with the stock eq so long as i wasn't playing any tracks with heavy bass and that can be from any genre not just edm or rap. Playing (If You Could Read My Mind by. Gordon Lightfoot) on stock eq at roughly 60% volume and up causes the speakers to struggle producing everything under 70hz. It begins to either bottom out or straight up distort and that was present from day one with or without the updates on 2 separate units. I have presumptions but im not sure. Either the speakers are built too shallow and they really are bottoming out OR there isn't enough pressure in the cabin so this effect doesn't happen either way its extremely unpleasant and i had to* HEAVILY modify the eq just to get it to stop even then i could never play it past 80% without feeling like it was going to self destruct. The sound here is as follows, versatile but not absolute. Certainly not for productivity. Definitely would make a fantastic gift for a child or a parent, maybe someone that just wants to play music in a more quiet environment and lower volumes. This is 100% something to take with you bike riding, walking, running, hiking, around a store to play high pitch noises that annoy everyone in the store, play at low volumes to fill in quiet space, in a car for audiobooks or voice calls. Definitely something that you don't mind losing or getting destroyed or stolen i suppose. Id give it a 6/10 for a speaker this size and at this cost but genuinely hope improvements are made.","timestamp":"Reviewed in the United States October 2, 2022","profile_id":"AGR6UC2Y2P2MROBDBB5PFAAJKM7Q","is_verified":true,"helpful_count":10,"product_attributes":"Color: Blue"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:26","page":6,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=6","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=7","asin":"B08BCHKY52","page":7,"pages":331,"reviews":[{"id":"R35GGZAVRL1TOG","title":"5.0 out of 5 stars Great for the proce","author":"Mathieu Spindler","rating":5,"content":"Easy to connect nice shape and build. Do the job very well.","timestamp":"Reviewed in the United States June 6, 2024","profile_id":"AEQOLUXKBB4NEDTE7POFCFHFR33A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1O8BR14FFYWJN","title":"5.0 out of 5 stars Great sounding speakers!","author":"Joe Stanley","rating":5,"content":"These speakers sound great for the size and price. They would not be appropriate for a large party but would work great for background music at a gathering with a few friends. I use them for background music at night and they are perfect for that.","timestamp":"Reviewed in the United States April 14, 2024","profile_id":"AFA2UFU34S75MGBO7VTEUWAZ764A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1I1XY8N81U8LY","title":"5.0 out of 5 stars For $55? Absolutely 🙌","author":"Christopher T.","rating":5,"content":"This thing is INCREDIBLY loud and the battery life is nothing to turn your nose up at either! The ONLY complaint I have (and not really a complaint, just more of a thing I'd change about it) is that clarity in the higher frequencies (so basically your mid-to-highs) is a tad diminished, but like the title says-for $55 it's absolutely worth it. If you are an EXTREME audiophile lol, then you might wanna opt for a slightly more beefed up version (actually thinking about giving this one to my mom and buying the Soundcore Motion+ for myself lol), but honestly it's even got Atmos compatibility so it truly is great for the price 🔥","timestamp":"Reviewed in the United States January 3, 2024","profile_id":"AG6OMCBHTURYSA2QAKJ7XEDA5FUA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3TF51ISEB932Q","title":"5.0 out of 5 stars Great portable speaker with good sound and EQ control","author":"Jerry","rating":5,"content":"The media could not be loaded. I purchased the Anker Soundcore 3 after being disappointed by the Soundcore 2’s muddy bass and non-existent mids. I read some reviews that indicated that this was definitely an upgrade over the 2. The reviews were correct. Aside from being close to the Soundcore 2’s general dimensions, build quality and weight, this was where the similarities end. They have upgraded to USB-C for charging and removed the 3.5mm Aux, as well as adding a strap holder for carrying the speaker around. The battery life is amazing, especially when running at lower volumes. However, the biggest game changer is the battery life. You just need to download the Anker Soundcore App from your devices App Store, then make sure you have the speaker paired. The app should recognize the speaker once you open it up and answer the various prompts. Then you will be able to control the EQ with 4 preset EQs, as well as the ability to create and save custom EQ sets for your own preferences. Without the app, you are strictly limited to the sound that comes out of the Soundcore 3 by default. The app is what truly makes this speaker feel more high than the current $50.99 price point, which is a good thing. I’m pleased to say that this is another piece of Anker gear that I’m thoroughly pleased with.","timestamp":"Reviewed in the United States January 2, 2023","profile_id":"AGGQJRJYKAJEJAVXETGVHUUQIBLQ","is_verified":true,"helpful_count":17,"product_attributes":"Color: Black"},{"id":"RLENL8KO6MZYB","title":"5.0 out of 5 stars Great Little Speaker","author":"James Wegmann","rating":5,"content":"I've had the speaker for a few months and have used it for all sorts of things from listening to music while in the shower, listening to music in the shop, while BBQing and even brought it with me on a trip to play music in my hotel room. (I go to sleep listening to music) It's worked great for the loud music sessions such as listening in the shop or while BBQing but also works well when playing music at lower volumes. The battery life has been great as well. I do wish there was a bit more bass but I wasn't expecting a ton of bass out of such a small speaker.","timestamp":"Reviewed in the United States December 31, 2023","profile_id":"AEF2JC3NJIYYVURPS25GMFAL25CQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R26U9RR177XNB6","title":"5.0 out of 5 stars Pretty good little speaker","author":"Mickey Dee","rating":5,"content":"Good connectivity. I am an old dude, in my 70's now, and a sound blaster. Soooo, when I cranked up Tom Sawyer on my i-phone I tried to make this little speaker give me more sound than it was capable of doing and with that I was disappointed, but this is a speaker that will not dump 125 decibles into your room or your ears......so for the money and the build and performance it gives, it does a good job. Yeah, I'm a dipstick for still wanting to hear my rock-n-roll so loud, BUT...........................I am a creature of the 60s and the 70s, the greatest era of music and rock-n-roll ever and WE LIKE IT LOUD !!! So no apologies. Just impairied hearing. Self-inflicted !","timestamp":"Reviewed in the United States November 30, 2023","profile_id":"AHOHRRCX3VBWXIWYUKZOHSZETSYQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R2I690GTCR9VY2","title":"5.0 out of 5 stars Powerful little speaker","author":"Stephen R Bennett","rating":5,"content":"Exactly what I was looking for. Small speaker with good sound","timestamp":"Reviewed in the United States May 31, 2024","profile_id":"AHPEQVJ27OL7P3JMOXAUOIBOK2CQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"REVPJ4V2XB7E0","title":"4.0 out of 5 stars I did locd it","author":"Madotsuki","rating":4,"content":"I bought to upgrade from my old soundcore 1. it was great, improvements are that this one has better bass plus an eq ap and it can also be really quiet too.The material used creates a lot of smudge marks all over the speakerUpdate: removed one star.. i keep hearing a high pitch sound coming from the speaker!!","timestamp":"Reviewed in the United States December 25, 2023","profile_id":"AFXWQ665H2UNLKVGZW2NXDOGNGAA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RSFI9XTINWG8E","title":"4.0 out of 5 stars Sounds better than what it is - an inexpensive BT speaker","author":"Chandler2112","rating":4,"content":"This is a very nice speaker for the price. You won't confuse it with a Bose or a Bang & Olufson BT speaker by any means, but it doesn't market itself as such. Easiest pairing I've ever experienced with a BT device, and sounds very good. No one at a campsite or at the beach will complain about the sound quality - but when when output is pushed to the absolute maximum it does get a bit muddy, which isn't surprising. Battery life is exceptional.All in all, if you're looking for a very good bluetooth speaker at a very reasonable price, this is it.","timestamp":"Reviewed in the United States September 7, 2023","profile_id":"AFOMNIN4CWVKHGFVZUIQEYDLBXGQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RAIFBOCWRTYRV","title":"4.0 out of 5 stars Sounds great, Excellent speakerphone, Doesn't Multipair","author":"Jester","rating":4,"content":"This is a super sweet purchase because it sounds really good for the little box that it is and is a terrific speakerphone which was my primary reason for buying it. I had a Big Jambox which is also a great speakerphone, but it was too big for my home office desk and it needed a dedicated charger which is a big brick where the SC3 has a USB C port to charge it. I tested a couple smaller units notably the JBL Go2 (Which is a terrible speakerphone) but was pleasantly surprised by the Soundcore3 as they don't really advertise the microphone or how well it works. You can use the app to tune for voice frequencies so the voice quality is very good and the microphone works very well my voice quality is reported as very good. I do have a couple of negatives, 1) It DOES NOT MULTIPAIR, in other words it won't pair both my Phone and my PC at the same time which is really disappointing considering this is Bluetooth 5 device and second when I pair it to my phone for some reason it seems to mess with my Liberty headphones when I pair them up after using the SC3, I have to unpair and re-pair the headphones in order for them to work properly which is easily done but super odd nonetheless. Overall this thing won't blow your socks off with volume, but it sounds really good for a small unit and is a great speakerphone, I would highly recommend despite it's shortcomings.","timestamp":"Reviewed in the United States June 1, 2021","profile_id":"AESCAX6I7AZ4RBQGO2JU2W5YNRBA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:28","page":7,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=7","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=8","asin":"B08BCHKY52","page":8,"pages":331,"reviews":[{"id":"R1RXUTDGXALPHZ","title":"4.0 out of 5 stars Iffy- Not what I was looking for, but it's not bad.","author":"Molly Head","rating":4,"content":"I'm not sure what I expected, but it wasn't this. It's just ok. The sound is good, but I'm looking for 'bigger' sound for my little office. The battery life IS really short. I get about 2 days out of it, using it for about 6 hours each day. I would leave it plugged in, but the reviews of the cord melting make me nervous.This might be good for a day at the park/beach/pool, but I think that's about it. Since I only use it in a small office, I can't speak to the volume in a large space.It'll work until I can find something better and then I'll pass it down to my kid in college.","timestamp":"Reviewed in the United States July 4, 2023","profile_id":"AEQ23VKUP32B2CAWKT5QCOH3JQPQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Gray"},{"id":"R1P79TVUB7KFAH","title":"5.0 out of 5 stars Very Good product","author":"Tristan","rating":5,"content":"WAIT! Listen to this this review maybe I can help someone out. Ok if you’re looking for a good affordable speaker let me just tell you you came to the right place for an amazing speaker. I ordered 2 speakers to be able to connect them both and it be even louder however before I turned the second one I listen and reviewed only one first. I was between the JBL go 3 and this one and I’m very happy with this purchase. It’s pretty loud for the small speaker it is and when u have to and can play music on both of them at the same time it’s even better. Tans let’s say you want a little more bass you make the voice i don’t know what it’s called but you can basically tune your speaker to sound how you want it. The app shows you battery life and has some other stuff. So if your just looking for a good speaker that’s affordable this is the one. It’s very clear doesn’t feel cheap and overall great. Don’t listen to those people that are speaker experts and talk trash about this one. I was surprised how good it was and for the price it’s even better.","timestamp":"Reviewed in the United States December 29, 2022","profile_id":"AGG4ECKFD2SFJEM36KT7KGPELU6A","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R2ARO8RFYFEKPM","title":"5.0 out of 5 stars Great sound, great value!","author":"Gregory S Libert","rating":5,"content":"I did a lot of research of top brands, listened to them all including extended time with Sonos Roam. This has all the sound of the others, a better app and at least 50% less cost. Incredible bass and mids.","timestamp":"Reviewed in the United States April 13, 2024","profile_id":"AHRITETAZTS3OPJE4VL7CGDKRULA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1HKVQLXS4Q93D","title":"4.0 out of 5 stars Very solid","author":"B. Smith","rating":4,"content":"Solid, good sound, waterproof, usb-c., good quality , rugged. Great for podcasts, listening in the shower. Music fidelity good, won’t blow you away but above average for this price point. I liked it enough Ibought another one!","timestamp":"Reviewed in the United States January 4, 2024","profile_id":"AHRMGWMY5DOGEFKROBY2P3NKMWNA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Blue"},{"id":"R137XVEF5V83G5","title":"4.0 out of 5 stars Not quite a 5 star","author":"Richard B., Mattis","rating":4,"content":"This is a nice little speaker, just not a great one. It has all the bells and whistles, but none are perfect. It's loud, but distorted. It's equalizer doesn't seem to make any perceivable effect on the sound. For the full price I would try another model and see if it fulfills your needs for less$$$.","timestamp":"Reviewed in the United States November 29, 2023","profile_id":"AENTXLYZDNNZGA3TCSQ3PGUDZEHQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3SPNY4PL9URB0","title":"4.0 out of 5 stars Great Product for the Price","author":"Ethan","rating":4,"content":"I bought this in Prime day to replace an older speaker of mine and it does the job. The bass isn’t as loud as I would like, but that’s just my personal preference. It doesn’t seem to be too loud, but works for personal use when I’m using it. The battery lasts like advertised maybe a little short of 24 hours, but it definitely lasts long enough for a full day and into an evening. I had one little connectivity issue where it stuttered for a bit, but turning the speaker off and back on fixed that issue. I also love the auto connect feature; it makes it super easy and convenient to use.","timestamp":"Reviewed in the United States July 27, 2023","profile_id":"AFHFDAK46O355ZQFGBIFUO2FOSMA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"RA8ZBACNBYWSP","title":"5.0 out of 5 stars Sounds great, portable, easy to use","author":"J.Allen","rating":5,"content":"I own the early Soundcore Motion B. My plan was to upgrade to this for myself and to gift my older speaker to someone else. I opened up the package and tried it out and I was blown away by the sound. It was just so rich and full and balanced. I felt it would be a crime to give my older one away, so I gifted the new one and purchased a second one for myself.I use it mostly in my bedroom when I sleep I play it all night, but I use it sometimes during the day too. I've taken it out for the day to barbecues and stuff and the battery lasted 8 hours without needing a charge. I'm not sure how much longer it can actually go, because I keep it plugged in at night. The manufacturer states 24 hours. I know I was thoroughly impressed by my original Soundcore speaker's battery life.It is very easy to pair with the device you choose. There are 4 control buttons on top. The outer case is made of rubber and it is very easy to feel which button is which as each button is uniquely raised out of the rubber. You can play, pause, skip, etc with the buttons on top (the buttons are not dedicated for this purpose) but I have only controlled play from my mobile phone.I prefer the more classic box shape of the Soundcore vs the other offerings from JBL, Bose, and Amazon.I would most definitely purchase it again.","timestamp":"Reviewed in the United States July 4, 2021","profile_id":"AEV7TXHVRU6MHZXLF5AFQJ7K6YGQ","is_verified":true,"helpful_count":10,"product_attributes":"Color: Black"},{"id":"R18IQQ5L28OC97","title":"5.0 out of 5 stars 3 year life span of the battery","author":"Mac the E","rating":5,"content":"update: I thought the battery had died, as it was turning itself off constantly and not holding a charge. I emailed support and they replied very quickly and provided some reset instructions. That worked, and the speaker seems to be alive again! Great support.","timestamp":"Reviewed in the United States March 22, 2024","profile_id":"AFDFZAITXHLMH6DVP3JDEX7LHN2A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RON2Y1JVWL9YJ","title":"5.0 out of 5 stars Great value for money","author":"Paula Buenavides","rating":5,"content":"I love it. Great value for money, very portable & it looks good, too.","timestamp":"Reviewed in the United States May 15, 2024","profile_id":"AFMMZKPNW4RTAHP5WAZXW5GIW5AA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2DTZ43CI9KB0W","title":"5.0 out of 5 stars Glad to find Serious Speaker among all the Light Weight Party Models","author":"Athena","rating":5,"content":"I usually wait awhile to see if a product lasts. But, int his case I was looking for another speaker like an old Sony one I've had for years (still working great - this one for another room). At first I thought I would be out go luck for less than $200. But I was encouraged by reviews for this one saying that the sound quality was good. Still, skeptical of the price, I ordered it.It is almost identical in size and form to my old Sony (which cost far more 8 ? years ago). Bluetooth connected easily to my MacBook. Within minutes I was playing my music in a new location. Sound from this size speaker will never be like it was when we had real stereos, but this is quite good, especially for the price. I don't need it for loud parties to drive my neighbors nuts with pounding base, but I can turn it up in my 400 sq ft solarium and have a room full of good quality sound for 50 years worth of Rock \"n Roll, as well as Classical that sounds full bodied.Happy I didn't have to buy speakers from companies more worried about cranking music and their \"coolness\" ratings.","timestamp":"Reviewed in the United States June 30, 2022","profile_id":"AHNSRZI7ONSUGJHWW77UEKUQ4AZQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:30","page":8,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=8","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=9","asin":"B08BCHKY52","page":9,"pages":331,"reviews":[{"id":"R2SRZTEXMACZQN","title":"5.0 out of 5 stars Amazing little speaker.","author":"brown dog","rating":5,"content":"We bought it so we can use it on our patio this summer. We found we use it more than we thought we would. Can turn up the volume and hear the music through the whole house.","timestamp":"Reviewed in the United States March 29, 2024","profile_id":"AHVMDGRMLNBURUY5ZU7SON6LHNCQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1LUDOB5A1P5WH","title":"5.0 out of 5 stars So far so good","author":"Geoff Fafenrodt","rating":5,"content":"I just got this a couple of days ago. It was a black Friday sale, 32 bucks. I like it. Good sound when you engage the the bass boost. Otherwise it's fairly flat. It has good volume in a nice compact size. But the real winner is the 12 band e.q. that's located on the app. Definitely download the app. You can customize your e.q.'s and save them for different styles of music That's where it's at. Now i just hope it lasts longer than my last one (different company different model ). That one lasted 2 months then zip, nada, zero, dead....But so far so good. Good stuff.","timestamp":"Reviewed in the United States November 26, 2023","profile_id":"AGWHPL6HHXJ7U3QFNEN7DIY7EQFQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R25X5AN4LD7ZMO","title":"5.0 out of 5 stars Great for the shower, struggles with multiple bluetooth devices","author":"Ken K","rating":5,"content":"This speaker feels like a $70 device. It's weighty, the sound quality is nice, it pairs quickly, and it reports charge level back to your phone. I place mine in the shower and it's never had issues with water incursion. Where it struggles is connecting to multiple devices. If I start it up and get music going, any sound from my partner's phone will interrupt my music. A song, a video, an ad, even a notification. After the interruption, it's impossible to get my music going without stepping out of the shower and interacting with my phone.","timestamp":"Reviewed in the United States December 24, 2023","profile_id":"AFSF4FD2CVEK43PALGJNTHJL55BQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"R2MYHBW725DT6W","title":"5.0 out of 5 stars Very nice little speaker","author":"theshawn","rating":5,"content":"Purchased on sale, great deal, very nice sounding little speaker....May just buy some as Christmas gifts....Sounds nicer than JBL Flip 5 imo....and $30 cheaper....","timestamp":"Reviewed in the United States April 28, 2024","profile_id":"AHMRCDDPYS2ZUCGMLBICCHFHV2HA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3O4UXGFMVX193","title":"5.0 out of 5 stars Quite Amazing","author":"Mark B","rating":5,"content":"Great sound from a little speaker. It is much better than listening to music on my iphone built in speakers. Only suggestion I would make to the manufacturer is to install a USB plug to replace the one used by the charging cable. I truly enjoy what Soundcore has done. Other reviews online - especially Tom’s Guide - led me to choosing this device.","timestamp":"Reviewed in the United States January 31, 2024","profile_id":"AEFN3BWPUEZPQL6CZITH5UXWPR6A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3N30N09JTR4R1","title":"5.0 out of 5 stars Price","author":"osvaldo balastegui","rating":5,"content":"Great sound","timestamp":"Reviewed in the United States May 24, 2024","profile_id":"AEDCNJES5OCT2QOWEDXB42PYQV5Q","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R33QPBQE5Q8RST","title":"1.0 out of 5 stars Piece of junk","author":"Matthew","rating":1,"content":"I have owned quite a few Soundcore products from Anker, great headphones, pretty good tws earbuds, and this has to be the sixth, I don't know, seventh bluetooth soundcore speaker I've purchased, and EVERY SINGLE ONE has developed this static-like buzzing noise. You can hear it when it's on, when it's unpaired, pairing, paired, music playing and not playing. The noise only goes away when it's off. It isn't a white noise artifact from transmission or recording or a ground issue, noise isn't causing unwanted vibrations either. I take care of my things, I don't abuse them, this one in particular I kept in a little case I bought for travel (only traveled with it once). Minimal use, never maxed out or blasted the volume. AND YET after about three weeks, to a month developed the same noise I experienced in several other Soundcore speakers. I work with audio equipment, I would say I am fairly capable in diagnosing and correcting audio issues or at least identifying the issue. It sounds like something internally is shorting or a manufacturing defect without me having taken it apart. Again, was never rough with it and a few of my friends have had the same exact issues with theirs, I should have listened to them when they said not to bother with these, but the reviews were too good to think it a persistent and constant issue. And oh boy was I wrong.By then the return window expired, going to reach out to customer service but for now I've been stuck with a 50-something dollar paper weight. The worst thing they can do is send another one. So done with their speakers.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AHHH34PFU33JE5K5W5SPHHUD5IWA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3HSWAHIAP1UAK","title":"3.0 out of 5 stars not to big","author":"wattmasters of bass","rating":3,"content":"i thought this was gonna be like 22 in long .no its a small thing bout 7 in long.has vrry full sound at 50% but after that you start losing your bottom end fast. so if you like listening not too loud this might be for you.but if you like to crank up on certain songs this aint really gonna do it for you thing i dont like is it has no aux out .really sad on that lack of feature.om starting to think you have to drop upwards of 150 $or or more to get a bigger sound.these under 50$ speakers blow your phone speakrr away but your still not gettin a big sound that im craving.. i might have to go to a local store to listen to one first. hope this helps somebody outi wish they made a much higger speaker for a fair price 229 bucks ir mire usnt in my life .","timestamp":"Reviewed in the United States October 17, 2023","profile_id":"AH7HMGUYQRXNE5TKD56WMPJG6R3A","is_verified":true,"helpful_count":4,"product_attributes":"Color: Blue"},{"id":"R17DKFOFRDM9LN","title":"4.0 out of 5 stars Easy to use good sized","author":"Mama P","rating":4,"content":"Its not amazing sound but for the price its great. The charge lasts for a long time, easy to use","timestamp":"Reviewed in the United States December 16, 2023","profile_id":"AGEE4MLSM3UZ64YQ67FSW3TA4NFA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1FQBVADKRJM2","title":"5.0 out of 5 stars Fantastic","author":"Crystal D Vowels","rating":5,"content":"This little speaker is absolutely an A+ in my book. Easy setup, paired easily, and has great sound. Using this in my office to illuminate dead air space while sitting with clients!","timestamp":"Reviewed in the United States March 16, 2024","profile_id":"AHD6DBEVG7JAO3W2BVUGTPLOOWAQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:32","page":9,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=9","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=10","asin":"B08BCHKY52","page":10,"pages":1,"reviews":[{"id":"R1DANC3MAHX4P4","title":"3.0 out of 5 stars Disappointed in the bass","author":"jonathan thibodeaux","rating":3,"content":"First off I would like to start by saying that I am usually an earbuds person, not a speaker person.I bought this speaker to replace my old and aging Soundcore 1 speaker. The charging port was failing and I feel that it lived a happy life. Decided to buy this speaker during Amazon Prime days. Arrived fine, but after some music samples, it felt like the bass was lacking or flat with not great thumps.So a week or two later I went out and purchased a similar style competitor brand Tribit and WoW, oh my gosh was I right. The tribit hits and punches the bass really well, however, the Soundcore 3 is louder in volume but flat and not punchy in bass.Overall feelings I would have to lean towards Tribit for getting a cheap budget 14w speaker.Tribit > Soundcore 3Given this new knowledge, I am likely to buy the next model up the 24w Tribit to see if I can compensate on the volume and still get that bass punch .I totally expected more from Anker and Soundcore, but the missed on this version of speakers","timestamp":"Reviewed in the United States July 25, 2023","profile_id":"AGUXQ6TLWASKXRCA7WN64VNPW5FA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R3CWB734DXEAF9","title":"4.0 out of 5 stars UPDATE! Quit working after barely 2 months!","author":"Cindy A.","rating":4,"content":"UPDATE - Customer service reached out and made it right! I cannot thank them enough. The rating change is for the outstanding & quick response. I may not recommend the speaker but definitely recommend the company!Stay far away from this product!!! Quit working after barely even 2 months of minimum usage. Do not recommend this at all.","timestamp":"Reviewed in the United States September 26, 2023","profile_id":"AF45FBSTU47NUICKZZZOFUUCLKYA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R2RHH7Y0ZHJK70","title":"5.0 out of 5 stars Great sound, long battery life","author":"Barbara Ann Reid","rating":5,"content":"Could not be happier with this purchase. It produces big, clear sound for such a small speaker, great for travel. Battery life is impressive - over 15 hours before it needs charging. Highly recommend","timestamp":"Reviewed in the United States February 5, 2024","profile_id":"AHVTUYQR2TUR7QC4CEJMV6V7LHXA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1KV85UY1P1ZMX","title":"4.0 out of 5 stars Not as good as I expected based on reviews","author":"Misunderstood Computer God","rating":4,"content":"My Ultimate Ears Boom 2 is dying, so I was looking for a good replacement. I looked at Amazon reviews as well as looking at places like Tom's Guide. The reviews for this speaker were really good, and though I had doubts about.a $50 speaker, I took a chance.I don't get it. I'm far from an audiofile and even I can tell this thing sounds like a $50 speaker. It really lacks bass, even with Bass Boost on. While I don't understand the love for this speaker, I'm giving it 4 stars because it's a $50 speaker that performs like a $55 speaker.So as it goes back to Amazon, it'll pass my new UE Wonderboom 2 that everyone raves about. Reviews suggest this $85 speaker is better than the $150 UE Boom 3, but I suspect it's not.","timestamp":"Reviewed in the United States July 18, 2022","profile_id":"AELQO2M7D3MT5SIPQ6LF4RXPIEPA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"ROIJDHPDKSQ5Y","title":"5.0 out of 5 stars Big sound in a small package.","author":"Christidge","rating":5,"content":"I needed a portable *good sounding* BT speaker to take with me travelling. I got one of these after watching some review online. I wanted a \"stereo\" speaker , so that both channels were present when I listened. This little thing kicks way above it's price point, easily fills a small room, sound quality is really pretty decent, and the app gives you some helpful EQ options. Even bass is fairly good for what, 3\" drivers? Solid build as usual from Anker, battery life is very good too. So glad I got this .","timestamp":"Reviewed in the United States November 11, 2023","profile_id":"AGUBG2TSCZLE6IV2343QZIEKF5UA","is_verified":true,"helpful_count":11,"product_attributes":"Color: Black"},{"id":"R3R4KIFM3K2WC8","title":"4.0 out of 5 stars Speaker isn’t s loud as I thought it would be.","author":"Iesha Eddy","rating":4,"content":"Nice speaker but not that loud.","timestamp":"Reviewed in the United States January 7, 2024","profile_id":"AE52BLY2D7K7RQFCT6RI2MXI5IUA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RCR1GZL84NEOB","title":"5.0 out of 5 stars Excelente Compra.","author":"Angel J. Otero","rating":5,"content":"Esta a otro nivel, Espectacular. La batería dura más de 24 horas. Dependerá cuanto la utilizan. Pero me encanta. El sonido, tamaño y el precio es una excelente compra. Tengo varios equipos y este los supera. Cuando haces una evaluación todos los criterios, Precio, tamaño y sonido. Ejemplo JBL, Bose, Beats y Otras.","timestamp":"Reviewed in the United States January 1, 2024","profile_id":"AFFWOSYWLWM3O2KMERNMD7WBJOAA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RNBZ8BE88SBL4","title":"5.0 out of 5 stars Nice speaker","author":"Chusman","rating":5,"content":"Bought this speaker to have in shop for my husband. The shed is 50 x 60 and this little speaker kicks out a lot of sound. It has been a great little speaker to have. Was easy to set up with his iphone.","timestamp":"Reviewed in the United States February 3, 2024","profile_id":"AG45FCA5B67SHHPE5AJIII7XWOPA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R29THAXCOTK4ZW","title":"5.0 out of 5 stars Great sound in a small package","author":"Kitchkin","rating":5,"content":"I love Anker products and this didn't disappoint. Works well with my iPhone and other devices.","timestamp":"Reviewed in the United States March 9, 2024","profile_id":"AFZK4J5URS6HB3DSBENLDZYR54FQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1P3ELA7J79STE","title":"5.0 out of 5 stars Left speaker blew out after less than 6 months","author":"Corin B.","rating":5,"content":"Update : Soundcore (Anker) reached out and offered a free replacement after some basic troubleshooting steps. I will say that even though the \"Standard\" warranty is 3 months (per their website), their customer support was truly exceptional. I cannot say the same about most Amazon-only brands. I am changing my review to 5 stars to reflect the customer experience received and the general satisfaction with the product.I really enjoyed this speaker while it lasted. I never used it around water and never blasted it at full volume. The sound was good and crisp for the first few months or so. It deteriorated over time to the point that I cannot listen to anything at all without hearing a loud \"scratching\" noise coming from the left speaker. I wouldn't be as upset if Anker (the parent company of Soundcore) offered a decent warranty period for their products. In the US this (and all of their other products) come with a 3 MONTH warranty. Needless to say, I will NOT be buying any Anker products - this includes TaoTronics, Anker, Soundcore, Eufy, Bolder, ZULU, Roav and whatever new brand they come up with in the future.","timestamp":"Reviewed in the United States January 24, 2022","profile_id":"AFDS4PQA7BHOYH2K7ZICZ6ZKVAZA","is_verified":true,"helpful_count":8,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B08BCHKY52","product_name":"Soundcore Anker 3 Portable Bluetooth Speaker - Wireless, IPX7 Waterproof, 24H Playtime, Pure Titanium Diaphragm Drivers, PartyCast, BassUp, Custom EQ App - for Home, Outdoor, and Beach","parse_status_code":12000},"created_at":"2024-09-08 14:46:07","updated_at":"2024-09-08 14:46:35","page":10,"url":"https://www.amazon.com/product-reviews/B08BCHKY52?reviewerType=all_reviews&pageNumber=10","job_id":"7238558229892986881","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-08 14:46:07","domain":"com","geo_location":null,"id":"7238558229892986881","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B08BCHKY52","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-08 14:46:35","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7238558229892986881","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7238558229892986881/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7238558229892986881/results/1/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/2/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/3/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/4/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/5/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/6/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/7/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/8/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/9/content","http://data.oxylabs.io/v1/queries/7238558229892986881/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7238558229892986881/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7238558229892986881/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7238558229892986881/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7238558229892986881/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7238558229892986881/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7238558229892986881/results/10/content?type=parsed"],"method":"GET"}]}}