{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=1","asin":"B08MZZTH1N","page":1,"pages":105,"reviews":[{"id":"R3LYZE987ADOQH","title":"5.0 out of 5 stars Tribit Stormbox Pro Versus Bose Soundlink Revolve.","author":"Chris","rating":5,"content":"I have both of these speakers and am offering a comparison. These are my opinions for what they’re worth. The bottom line is that the Tribit Stormbox Pro is a better value than the Bose Soundlink Revolve.Sound:Both of these speakers provide excellent room-filling sound that is decidedly different. The Bose is more ambient with a mono feel, which it is. The bass and mid-range are good but there is very little in the way of high treble. For example, you probably won't hear that classic \"ping\" in middle of \"Comfortably Numb\". Bose, being Bose, provides no information about what is inside the casing. My guess is that there is one woofer and a single transducer.Tribit, on the other hand, emits more of a surround sound which actually seems stereophonic. Bass is thumping amazing with the booster on, mid-range is fine and and very high notes come through loud and clear. Some reviewers describe this as \"Tinny\"; I don't think so. Tribit openly discloses that there is a subwoofer, 2 transducers and 2 passive radiators.ADVANTAGE: Tribit. At lower volume, the sound quality is equal. Tribit wins at moderate to high volume with the Extra Bass activated.Functionality:Bose has 5 control buttons (Power, Bluetooth pairing, volume + and -, and one more which I haven’t figured out but things get messed up whenever I push it. An audio cable port is provide if you can’t connect via Bluetooth for some reason. The optional Bose charging cradle is the worst accessory ever designed in history - don’t waste your money. Bose rates the speaker as IP55 water resistant.Tribit has 4 buttons (Power, Bluetooth pairing, and volume + and -). The Tribit also shows battery power. The Stormbox Pro has a carrying strap which is a great idea; I’ve dropped my Bose a couple times. Tribit rates the speaker as IP67 water proof.ADVANTAGE: Tribit. The controls are simpler.Price:Right now, the Bose Soundlink Revolve (Series II) is $219 and the Tribit Stormbox Pro is $119.95 with a 20% coupon ($95.96).ADVANTAGE: Tribit. Bose is over-priced.Appearance:The Bose exterior is solid plastic and durable. Tribit has a high-quality fabric exterior and looks good. The Stormbox is 1” higher than the Revolve.ADVANTAGE: Equal.Battery:I’ve never had an issue with my Bose’s battery. The manufacturer claims 13 hours of playtime. Tribit claims to provide 24 hours of play time and has a port for charging your cell phone.ADVANTAGE: Equal.Durability:One thing you have to hand to Bose, their products are built to last. Despite the fact I cannot attest to the Tridbit's durability - Bose gets the vote.Advantage: BoseSummary:The Tribit Stormbox Pro is an amazing portable speaker at under $100. It meets or beats the Bose SoundLink Revolve in all categories. I don’t know how it would match up against the Bose SoundLink Revolve+ with runs $329.","timestamp":"Reviewed in the United States October 24, 2021","profile_id":"AG6WESEHODYUI74XLBFEQWAEAEKQ","is_verified":true,"helpful_count":61,"product_attributes":""},{"id":"R33PIX8ADNIZWV","title":"5.0 out of 5 stars A Perfect Wireless Bluetooth Speaker for your Laptop or Tablet","author":"Old Salt","rating":5,"content":"My wife and I are semi-retired and this purchase was for home use and our review was not in exchange for money or a seller's payment. We rarely leave reviews unless our purchase was something we found excellent with great value. We have purchased 4 portable speakers to connect to our Dell 7200 2-in-1 which is a tablet and laptop. The factory sound is weak, flat an horrible and is not worth seeing a movie online. We have tried both a sound bar and aux. speaker. Most provided a wireless bluetooth and a wired connection. The Tribit's bluetooth was easy, stable and remains connected without issue or having to re-connect like our other bluetooth speakers. The sound is awesome, clear and distortion free. Our music taste goes from blues, jazz, soft rock and classical. Our movies vary. But this speaker sounds better at reproducing sound with much higher volume that is clear and sharp with little to distortion. The sound with only one speaker fills the room like a surround sound speaker system. We decided to purchase a 2nd Speaker and it was suggested. Today, I am very happy when my purchase exceeds my expectations as the Tribit did. With a discount and coupon our cost was only $95 and this was the best money we ever spent on a laptop speaker!!! My wife and I recommend this speaker and our seller who shipped this right away because our last speaker crapped out. We charge it using our cell phone charge cord which works great","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AG2SMHYAKOYT4XBJOPYGSHIF37CA","is_verified":true,"product_attributes":""},{"id":"R1P778PCCYQGO0","title":"5.0 out of 5 stars Amazing Quality-Brillant Design-Amazing Sound","author":"Kristopher Ryan Warren","rating":5,"content":"What more can I say other than, Amazon, keep listing these underground and not in the big box stores Bluetooth speaker manufacturers. I literally have owned these speakers, ranked from 1 to , 1 being the best speaker I have ever owned in the portable Bluetooth speaker category. Keep in mind, I'm just the average everyday, in my car with 2 12 in subs by JL audio, Bose highs and lows (Armada SUV), and home entertainment center that is a old late 80s Marantz Amplifier attached to 2 Marantz floor 15s with highs and mids within the speakers. So, I'm no audiophile, no schooling to know notes and ranges or frequencies, just know when it is at 100 volume, is it distorted, does the bass give out at every hit if battery is half dead (Sony Bluetooth Speakers), and a few other important things I must have in a speaker such as; distance before the karate chopping the song to death starts, can it charge my phone as well (at a speed of 1.5a or higher if that even has hit a speaker yet), MAH capacity has to be 3000 or higher, portability is important, weather resistant is minor, I'm 45 and no longer desire to be with homies regardless of weather conditions or at a beach I'm black so I'm straight, I'll keep my ass indoors if it rains and pool parties was 20 years ago ipwhatever is only for my phone. Speaker who gives two turds, as long as it hits those marks I'm hella happy. Here we are and where this bad boy/girl ranks in my list of yompers.My list of amazing speaks/yompers1. Soundcore Select Pro: absolutely hands down best of it's class by a Seattle Slew distance. Price is unbeatable at 55 dollars during December, regular 90 dollars. Reason you don't see it on Amazon, cause soundcore realized they sold it at a way to cheap price and rebranded it with the motion boom, motion boom is second but the select Pro is by far all around number 1 which includes any JBL Bose Sony or pick one, soundcore nailed it.2. Motion boom soundcore: same as select Pro but more money and bigger battery. Oh they charge devices at the Anker iq speed, since soundcore is Anker, makes since.3. Oontz: damn brilliant design, first to do it triangular and the price point is beyond mi dblowing. My first was the smallest one, I ran down stairs demanded my wife stop her job and hear this little walkey sized speaker, not bunch of bass but clarity and loudness unmatched, 20 dollars and 69 for the biggest one and get 2 of the biggest one they make and they just passed soundcore due to stereo sound and only 120 and you have a speaker, really 2 that sound studiesqe.4. This speaker. Almost a tie with oontz big boy but the price of this one has me putting it 4. Had it been more like 49, number 1.5, soundcore is top dawg for awhile just cause of the app and everything involved. This speaker though is super attractive, chicks come up to just want to hold it, sometimes I gotta ask what it is that they want to hold cause I forget I have in hand cause it's not charge (JBL) heavy or awkward like the many out there. It sounds on par with the megaboom 2 from ue. Not as much bass but the 360 and the clarity is beautiful and filling if starving to hear a rap song like some pac that you just need to hear the message, the best is nice but days the message is what matters and this speaker is that speaker.I could go on on and on, frankly that's to much texting and if my lady knew I wrote this much I be hung immediately and divorced while hanging. So I gotta go but I hope my grammar and structure wasn't to over the place but I'm trying to write and ensure snoop wifey wife don't snoop over my shoulder and say, \" oh ok I see, so when I get a bae I'm drivn and I know you parked at the store cause I followed you, but you can opinionize on a yomper, boi you foul\" so yeah. Ya dig and I'm out","timestamp":"Reviewed in the United States May 29, 2022","profile_id":"AF77DQE47KW34LY6AAEXZYBSJJRQ","is_verified":true,"helpful_count":37,"product_attributes":""},{"id":"R6U4AEBND1YAC","title":"4.0 out of 5 stars *positive update* older version of storm box speaker doesnt pair with the upgraded model","author":"daniel","rating":4,"content":"7/26/23 update:mona from tribit customer service reached out and kindly arranged for an authentic older version of this speaker to be shipped to me direct from their warehouse and so far, the stereo pairing works great and the speakers sound amazing.sound quality is 6 stars out of 5, build quality is also 5/5 stars. battery life is a solid 4/5-these bad boys put out 40 watts each and last at least 8-9 hours. the one snag is bluetooth connectivity; id give these a 3.5/5 unfortunately. i feel the sound quality makes up for it completely but it is annoying when the right or left channel disconnects or goes out of synch with the other speaker when standing in between the speakers or turning the volume up or down. this is a general issue i've experienced with all kinds of tribit bluetooth speakers i have around my house so, if having to turn your speakers on and off in the middle of listening session is a deal breaker you may have to step up to a higher tier of brand.i have them set up in my large family room for music and podcasts and the smaller tribit stormbox go's on my desk connected to my macbook and ipad and i'm very happy with these speakers and this brand. the sound fills the room and the subwoofers are a nice addition.original review:after a year of using this speaker, taking it back and forth to europe and los angeles, using it at the beach, in the bathroom, as a speaker for a TV, laptop, etc, i bought a second 'upgraded' one since i'm so satisfied with the product. i cant wait to pair them together and see how the stereo sounds. it's loud but the bass can be too much sometimes so, play with the volume on your device and speaker to find the right balance you personally prefer. my one friend with the a bose competition speaker without returned her $220 speaker for this one and she's happy with it.UPDATE:down from 5 stars to 3. the 'upgraded' version of the stormbox pro does not pair with the older model i bought ONLY A YEAR AGO. the brand doesn't mention this in its listing; you have to search \"stereo pairing\" in the 'answered questions' section on the amazon page of the upgraded version and the older version doesn't even exist anymore on their official website. very disappointing and shady.the upgraded speaker also sounds slightly muddier and muffled compared to the older version; that can be the space I have the speaker in or the music i listen to but, having both speakers next to me and switching the same devo song between the two, there was a noticeable difference.is this upgraded version still a very good bluetooth speaker worth the price in comparison with its competition? yes.is it loud and really high quality? absolutelyam i still satisfied with the older version i purchased a year ago? definitely. I'm riding that thing til the wheels fall off lol.did i return it? yes. i need two stereo speakers for my personal desk and I do not want nor need to purchase two brand-new, overpowered, 40w bluetooth speakers.","timestamp":"Reviewed in the United States July 7, 2023","profile_id":"AGWZOATXLMNI7NWVJ76LZ3FF5VKQ","is_verified":true,"helpful_count":6,"product_attributes":""},{"id":"R1TN1754KDX4ZW","title":"5.0 out of 5 stars Great sound, great value","author":"BGK","rating":5,"content":"I originally had speakers running from an indoor stereo to a pair of outdoor speakers. I redid my outdoor patio area and built a gazebo and was looking to simplify things. I bought a pair of these speakers. Two speakers will pair for stereo sound (left/right channels). I installed hooks into the gazebo rafters and the rubber handles are perfect for hanging them. They sound great. They have been pairing easily without fail since the spring. Once I paired the first time, all I need to do is power them on within proximity of one another for them to enter into stereo mode. Really happy with battery life as well. It would be nice if there was a way to place them into “standby mode” that would enable you to power them on from your phone as opposed to physically having to press the button to turn them on. Again, since I have these hanging up, having to take them down to power them on is a slight inconvenience that I didn’t have to deal with when I was utilizing my WiFi enabled stereo receiver. No regrets on the purchase and glad not to have to maintain hardwired speakers any longer.","timestamp":"Reviewed in the United States July 7, 2024","profile_id":"AFWACVDE7WMM72BGTYTD6ZPZDBXA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R1M7M5NCPRPBGX","title":"5.0 out of 5 stars GREAT outdoor addition","author":"Nelson Fam","rating":5,"content":"Bought this to play music outdoors in a very noisy and windy location while playing pickleball. It delivers excellent music quality and volume for both sides of the court, seems well built enough, and easy to use. Charges a bit slow, but at full volume I get about 8 hours use which is no slouch. Very happy so far with the speaker, excellent value proposition","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AFZTFUYOHA4TAF3SMT2H4KKHQFXQ","is_verified":true,"product_attributes":""},{"id":"R1BUPEQE36WKUF","title":"5.0 out of 5 stars Simply Amazing","author":"Dave Hewlett","rating":5,"content":"I don’t often write reviews but this amazing little speaker has some features that make it stand out from the crowd. Several are not mentioned until you read the instruction pamphlet.Like all the others reviews I agree this speak isounds amazing. I have the Bose revolve and the range from the deep base to crystal clear highs are better than the Bose. That is saying a lot as the Bose is one of the best speakers on the marketBut what really sets this apart is three awsome features that I didn’t even know about when I purchased this speaker. I love that you can have two Bluetooth connections at the same time! Now my wife and I can be paired and take turns playing songs.Then I discovered that if you buy a second Tribit StormBox Pro you can sync them to play in Party mode ( same sound from each for putting into a second room) or play them in stereo mode where one speaker plays the left channel and the other plays the right channel!!With all these features and great sound to also be waterproof makes this speaker the clear choice amongst the many choices in portable speakers.","timestamp":"Reviewed in the United States June 9, 2024","profile_id":"AHQVDCQNVNYJD37VMA2GQIGYD6HA","is_verified":true,"product_attributes":""},{"id":"RL1GIAX00LDVB","title":"5.0 out of 5 stars Needs some adjustments for best sounds","author":"xiao zhang","rating":5,"content":"First of all, this speaker looks and feels premium. I'm gonna go straight to sound quality part. Right out of box, the sound can turn off most people, including me. I almost put the speaker back in the box and returned it. The xbass feature makes very little difference in bass output. Let me put it this way. This speaker is for people who like flat and clean sound. However, after I downloaded the app, the equalizer makes huge improvements. When making adjustments on equalizer, the midrange and highs can be notably different by just tweaking 1 to 2 dbs. Nevertheless, for the bass, you have to tweak 5 to 6 DBS to hear the difference. The bass does not get booming. It's always clean and musical. This speaker is not for bassheads. The bass sounded muddy and almost distorted at the beginning. However, after few days of listening, the bass improved a lot. It got punchier and almost no distortion even at high volume. The overall sound is now balanced and transparent. I compared it to my bose SoundLink. To me, this speaker made bose sounded like there is a curtain in front of it. In conclusion. I am very happy with this purchase. For the price, it's very high value speaker","timestamp":"Reviewed in the United States April 9, 2024","profile_id":"AFCH6TE2ZKBR7DBVLAHR34WWS74Q","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R1HB9ELT3J7O33","title":"4.0 out of 5 stars Good but sound doesnt balance out well.","author":"4toman","rating":4,"content":"I was introduced to the brand through the Tribit MaxSound Plus that was quite affordable (around $60) yet quite powerful. I decided to upgrade to this particular one and unfortunately the sound is somewhat lacking despite the modern design. The bass is too deep and you need to have the volume up to get a balanced sound. Only thing I can give it is the fact that you can hear almost every sound in the song, it perfectly separates the sounds. I wonder if its one of those speakers where you need two of them to achieve that perfect sound.*Was going to give it 3 stars but realized that the audio I was testing with wasnt good, its not as bad as i thought but still not as balanced as the Tribit MaxSound Plus.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AG5II77UGL3MQ43L6YRDH42AJKVQ","is_verified":true,"product_attributes":""},{"id":"R3OVTUEKWOG8ZM","title":"5.0 out of 5 stars Calidad / precio óptima","author":"LilianG","rating":5,"content":"Comprado en oferta para sustituir a un JBL flip 4,por problemas con la batería.Luego de varias opciones decide por el tribit.Agudos nítidos, manteniendo un sonido agradable y dulces sin llegar a chillidos incómodos. Calidad óptima.Bajo adecuado,sin distorsión en alto volumen y sin opacar el espectro agudo- medio del registro audible.Para una corneta BT portátil es todo lo esperado. Sonido de 360° bastante aceptable.He tenido cornetas B&O,Bowers and Wilkins, Sonos ,JBL y Marshall. Y está por su precio, tamaño y prestaciones le concedo un 10/10 para una BT en su rango.La recomiendo ampliamente.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AFAQIE4WQW3XB6J3I6KLBDF6IBLA","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:10","page":1,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=1","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=2","asin":"B08MZZTH1N","page":2,"pages":105,"reviews":[{"id":"RCH7YV9Z60590","title":"5.0 out of 5 stars Great Sound","author":"Dan West","rating":5,"content":"This little gem has great sound for its size. The handle is great and it stays charged for a long time. For a bit over $100 I purchased 2 of them.","timestamp":"Reviewed in the United States August 12, 2024","profile_id":"AF35OJPBY2X2PPA2JYIF4NH7EXRQ","is_verified":true,"product_attributes":""},{"id":"RUYZ0MZDEXQW5","title":"5.0 out of 5 stars Great Speaker 1 minor gripe","author":"Nathaniel Pratz","rating":5,"content":"This speaker sounds amazing love the app. Although, sometimes when I turn it on for no reason when I press play the volume is as loud as a concert even if turn the volume all the way down first. Other than that I love it!","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AFMGLCE2HGVWXCBV4FZPTSWC5DBA","is_verified":true,"product_attributes":""},{"id":"R3BQ3EG1Q2E9CX","title":"5.0 out of 5 stars Impresionante","author":"Jorge Brizuela Gonzalez","rating":5,"content":"Es lo que esperaba, es comparable con los mejores y su relación precio calidad muy aceptable.","timestamp":"Reviewed in the United States August 14, 2024","profile_id":"AGRCSHXZGZIZYLV4GUP2QBRQG4KQ","is_verified":true,"product_attributes":""},{"id":"R3HL34SIG5WGBR","title":"4.0 out of 5 stars Great for such a small speaker (just manage your expectations).","author":"Bluesguy","rating":4,"content":"Update:This is a really good sounding and substantially built speaker. Why are people pathologically obsessed with overwhelming and intrusive bass? (and why do people keep spelling it “base”?)My only gripe with this speaker (and just about any good Bluetooth speaker) is the uneven response when turned up. Reviewers blather on and on about how great the bass is without any consideration for even, clean, sound reproduction. I am a rock musician so I like loud bass but I also like to hear the mids and highs as well. Given the size of these speakers there is just so much bass that can be cranked through them and still sound good. The good thing about 60 watts of power is that - even though I can only put the speaker at about 70-80 percent before the bass starts overwhelming the mids and highs - it is still pretty loud for my needs.This is a good speaker but, like most speakers, it just tries too hard to be bass heavy and not smooth and even.Original review:I really like the way this speaker sounds at low to middle volume. At that level the bass has an impressive level and it’s tight sounding. I would have given this speaker a full five stars if the EQ in the app was useful. There aren’t enough bands of adjustment on the EQ and it doesn’t hold the settings. The EQ is also not designed to show you exactly what sound profile is active at any time. Like I mentioned, turned up to about 40-50% the sound is very good. This sucker gets loud. Once one goes over 50% volume the upper mids to the high end start to get very harsh. I find that higher than 50% that killing the bass boost helps a lot. The speakers sound evens out quite a bit when you take off the bass boost at higher volumes. 60 watts of output power doesn’t necessarily mean “louder” than a 40 watt amp, there is just more headroom. I never push any sound device past 80-ish percent because going past that on any speaker/amp or on any sound system is just asking for trouble and disappointment. At 80% the sound is acceptable with the bass boost off. Remember the size of this thing. It’s definitely not a hip-hop thumper bumper. Killing the bass boost actually does make really loud volume sound better. Before I gave up on the EQ in the app I was able to even out the response at higher volume nicely it’s a custom profile. The inability to know what preset was active, and the tendency of the EQ to not even change from one sound profile to another was also annoying. I don’t need to connect 100 speakers or have a rave in my backyard or ever use this on a sandy beach so this speaker works very well sitting on the counter in my bathroom. Overall a very good purchase at the price for my use.","timestamp":"Reviewed in the United States May 16, 2023","profile_id":"AFZFPPHFXVVWBFJ36DY45MKHWAGQ","is_verified":true,"helpful_count":14,"product_attributes":""},{"id":"R244ZBJLI7OIPY","title":"5.0 out of 5 stars Calidad precio","author":"Juan Palaco","rating":5,"content":"Muy buen altavoz, cumple todas las expectativas.","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AFNR5CNPTRITRKWIJXDEFPETOGYA","is_verified":true,"product_attributes":""},{"id":"R3SD52W9K8VINP","title":"5.0 out of 5 stars Es bueno","author":"Yenifer","rating":5,"content":"Es bueno","timestamp":"Reviewed in the United States August 3, 2024","profile_id":"AHEXSQW5L2AMUIE5W3ITJI7VK4HA","is_verified":true,"product_attributes":""},{"id":"R2YB2RP0H9P7VZ","title":"5.0 out of 5 stars Tiny but mighty","author":"Edward G.","rating":5,"content":"For it's size this speaker is loud I mean it's really really loud especially when you go into to EQ app and mess around with it you can make it sound more to your liking, the the extra bass button is pretty useless though because the bass on this speaker is not the best buy still decent","timestamp":"Reviewed in the United States June 30, 2024","profile_id":"AEL4T2F24F2BEYHZECKO5JIEBNXA","is_verified":true,"product_attributes":""},{"id":"R1U42A9QGOMX8L","title":"4.0 out of 5 stars Sound Quality Equal to Name Brands But Not a Party Speaker.","author":"Damon P","rating":4,"content":"Pros- price, quality of sound and build, look and feel top notch! Best used for watching movies in-house or small in-house chill parties with handful of people.Cons- Not a party speaker, can't use outside due to too much brown noise. Wish battery life lasted longer, at full sound only last roughly 6 hrs. Was hoping 12 hrs on a full charge.It's a great price if you want to elevate your movie watching or small parties in a living room. Treble and bass clear and crisp sounds. But don't mistaken them for party speakers because they're not. You're gonna need to shell out a bit more money.I was happy because I love watching movies so now I get to hear them with quality sounds. A firm 4/5 stars for me.","timestamp":"Reviewed in the United States February 19, 2024","profile_id":"AGCLOJ5RUTJS443CL7PQPJTSVTOQ","is_verified":true,"product_attributes":""},{"id":"RLSPC9YMIMTRD","title":"5.0 out of 5 stars Una mejor versión","author":"Arvind Alberto Gomez prieto","rating":5,"content":"Mejor versión mayor duración de Bateria","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AHSYHBHLIZBXQWFL7OW4ICWIPNRQ","is_verified":true,"product_attributes":""},{"id":"R1PQBCFZJO6DWS","title":"5.0 out of 5 stars Awesome speaker.","author":"Luis Rivera","rating":5,"content":"Outstanding performance very impressed.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AG6M324QBIKWEXYEPPK46AUXFSOQ","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:11","page":2,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=2","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=3","asin":"B08MZZTH1N","page":3,"pages":105,"reviews":[{"id":"R2OSE7V8RO4WPE","title":"5.0 out of 5 stars opinión","author":"German","rating":5,"content":"Buena cakidad","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AGXFXY6FXX7LZ6VKZEZF7YRDDVBQ","is_verified":true,"product_attributes":""},{"id":"R1E7E0WSR1C9J1","title":"5.0 out of 5 stars Seems well built","author":"Brian Ward","rating":5,"content":"Sound quality very good","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AGQQL3K7OXJNPJX23PO4DS73PB5A","is_verified":true,"product_attributes":""},{"id":"R8MKZMV7MBWVG","title":"5.0 out of 5 stars Outdoor Speaker","author":"Amazon Customer","rating":5,"content":"I selected this speaker after reading several reviews and I also have the smaller version of this speaker which I used in the classroom. I am super satisfied with the product. Easy to use, recharges easily and doesn't take too long at half charge. I refuse to try the waterproof and floating options that they advertise, not willing to risk. Several family members have tried and liked the speaker also.","timestamp":"Reviewed in the United States June 9, 2024","profile_id":"AH6SKJJTFAZN3E5IC2NBAKDKKB4A","is_verified":true,"product_attributes":""},{"id":"R5KDYZXCKUOK2","title":"5.0 out of 5 stars The best, Portable, Sounding speaker money could buy especially compared to other speakers","author":"tj nguyen :)","rating":5,"content":"So let me start off with the best. The sound quality. and that’s 100 percent why you would want a speaker. well let me tell you, every sound, every little bit of melody, every bit of drums, bass, guitar, beats, anything that this speaker plays, you can hear every little detail of production that whoever made that song, you can hear and makes you feel like your in a studio listening to it yourself. And if that wasn’t good enough. The size and portability of it. Big enough to fit even in a purse with a little bit of wiggle room, and if that doesn’t say enough it’s about 7 inches. Thirdly, the price. 90 bucks? Comparing to their competing brands holy cow this is worth every single penny, I think you can notice how much I love this speaker at this point 😂 because I really do especially like a music fanatic like me you want to hear even the littlest of details and this speaker treats that like waking up and drinking cold water in the middle of the night. Heavenly. Best for any medium sized gathering in the backyard independently listening it alone oh and did I mention it was waterproof and with a bass button on the speaker so it even sounds even more crisp? Should’ve said it sooner.Over all, no cons whatsoever ever. Don’t be surprised though if your sound on the speaker gets lower and lower when the speaker dies more and more. It makes sense. So always keep it charged. Perfect speaker :)","timestamp":"Reviewed in the United States October 12, 2023","profile_id":"AFE3OCS4TIJXSNB7H7MWNAUYDJHQ","is_verified":true,"helpful_count":3,"product_attributes":""},{"id":"R113NF8KWT56ER","title":"4.0 out of 5 stars Incredible sound—but impossible for two devices to be connected simultaneously in stereo pair","author":"Watermelon Love","rating":4,"content":"These Tribit Stormbox Pro speakers deliver incredible sound and are generally easy to work with.My major disappointment is in the false advertising over the claim that two devices can be simultaneously connected to this product. I own two and use them in stereo pair. The company confirmed via email that it is not possible to connect stereo-paired speakers to two devices simultaneously. This was a key selling point for me. I’m docking one star for this false advertising.","timestamp":"Reviewed in the United States February 20, 2024","profile_id":"AHIPEEP7WYL4DLYI7UDBF5UUF4WA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R3V0B74GU3CW73","title":"4.0 out of 5 stars \"Jumpy\" volume, but great sound","author":"Chuck P.","rating":4,"content":"I've used Bose SoundLink II speakers for a while and think this has a better overall sound. My only issue is that the volume is way too sensitive and jumps up too fast. Other than that, I really like it.","timestamp":"Reviewed in the United States March 11, 2024","profile_id":"AHPS3K6LSBXD6WKOLYXTGYQSZRUA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R4NX7G5LCT747","title":"5.0 out of 5 stars EXCELLENT BLUETOOTH SPEAKERS !!!!","author":"Thothgirl","rating":5,"content":"I spent weeks researching and comparing Bluetooth speakers. I wanted something in my living room and knew I would need to pair two speakers together to get the sound I wanted. I had vintage 80’s Fisher tower speakers that couldn’t be beat. I’m a bass freak and it was absolutely necessary to get speakers that could produce at least half the sound and bass of my Fishers. I finally settled on these Tribits, after checking JBL, Sonos, Bose, etc. I was also looking for value in sound. I only bought one first and listened. I liked what I heard and bought the second one. I paired them both and heck yeah !!!! Beautiful sound and clarity ! Beautiful bass ! They have a nice hefty weight to them and they are sturdy and well built. The extra bass boost button absolutely pumps up that bass ! I love the the carrying handle too. Very strong thick rubber. I placed them on the floor by the wall on either end of the living room and the sound was astounding. I definitely felt the surround sound engulf me as these claim to be Hi Fidelity 360’s. I strongly suggest you place them near walls to get the very best sound. I was deeply impressed and quite satisfied with their performance at less than half the volume ! I highly recommend these and they will not break the bank. Amazon currently offers coupons of $25 or more on these. You won’t be disappointed at this price point.","timestamp":"Reviewed in the United States January 14, 2023","profile_id":"AG6LLDJKCMMZD6M3SZ4KOPD6SZCQ","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R28QB3D7HAG07L","title":"4.0 out of 5 stars Excellent Bluetooth speaker","author":"Steven Alex","rating":4,"content":"Had this for a few weeks and I’m very impressed. Super portable, great battery life, very good sound. Very clear sound. Good for listening to a variety of music and podcasts. Gets very loud for its size and price. Appears to be well made, waterproof. Highly recommended.","timestamp":"Reviewed in the United States February 25, 2024","profile_id":"AEUA2MGWC6AF5NPBYKY4J3KQ4OEA","is_verified":true,"product_attributes":""},{"id":"R1FOK1VWY6GWXY","title":"5.0 out of 5 stars One of the Best Bluetooth!!!!!! speakers","author":"BigpapaBean","rating":5,"content":"Well first I would like to say that this is one of the best 360 sound a Bluetooth speakers out there never originally heard of this brand tribute but so it pop up on my page when I was looking for a Bluetooth something small something nice. Well this thing is definitely worth the money it has all the great features you would want the connectivity to my phone is super fast and the sound is incredible. Very compatible to the sound of bose or any of the other high-end speakers. But the great thing about this devices the cost is not the same. this company set it at a great price, the sound is incredible and it is a 360 speaker so no matter which way you turn the speaker the sound is the same. And the battery life is incredible so far for one entire week I played it every night while I was sleeping for 4 to 5 hours and I still have yet to charge it. It also has a power bank that you can charge your phone but I have not used that feature yet, of course it's water resistant and it's a very sturdy device with a great handle. I have made a few phone calls on it and the sound is great on both ends. Can't go wrong with this Bluetooth speaker if you on the fence about buying it don't just buy it and you'll understand why I wrote this review....","timestamp":"Reviewed in the United States June 4, 2023","profile_id":"AHIDDOOOBWU3DEP2RKWQ7XG43A7Q","is_verified":true,"helpful_count":6,"product_attributes":""},{"id":"R15PJDM93Z6SHD","title":"5.0 out of 5 stars Best sound pound for pound ! but the heavy hitter is the Customer Service!!!!!!","author":"J. Villacis","rating":5,"content":"The sound is amazing for the size and compared to other Bluetooth speakers I have owned. The battery life is amazing like all the products I have had from Tribit. The Bluetooth paring is great to multiple devices.BUT where this product shines is the Company standing behind the products. The customer service is white glove service and support. Had questions and concerns and they were addressed 1000% within just a few min of working with Mona. They helped and kept me informed of all aspects and support they game me was top notch.They will have my business for future items and the comfort of purchasing and support they give into the products they believe in and back up.Thank you Team Tribit !","timestamp":"Reviewed in the United States February 15, 2024","profile_id":"AE6RJEGRINMQFBHVEG6Y2SWX3J7A","is_verified":true,"helpful_count":2,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:12","page":3,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=3","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=4","asin":"B08MZZTH1N","page":4,"pages":105,"reviews":[{"id":"R2F9K09LP67QNY","title":"5.0 out of 5 stars Not for the price, so disappointing","author":"ChrisMen","rating":5,"content":"Update( 12/29/23). They read my review and wanted to make right by it. And they did. It hard to find a great company and listen to they customers. I change it to 5 stars for the great customer service. Going beyond the call of duty. Great jobSo I really really wanted to like this product cause I got the smaller one for my office and it amazing. So I bought this one for when my daughter's have softball game. I like to play music. But the sound it too low. I kept checking if I had it all the way up, and I did. I'm sooooo piss this didn't live up to the stars it had. Like it has 4.5 stars how can so many people it gets wrong? There no bass. This thing is definitely not meant for the outdoors. If your 15 feet away from it, your definitely can't hear it. For the price just get yourself JBL.I'm so upset. I'ma keep it cause I don't like to return thing. I'll keep it for the bathroom where it can be heard.","timestamp":"Reviewed in the United States October 17, 2023","profile_id":"AGZ2QOWAZXAQ3F35JMARKL3G4KVQ","is_verified":true,"product_attributes":""},{"id":"RBN385A46UFYY","title":"3.0 out of 5 stars OK for the price range its in but definitely not a B&O.","author":"jtfreelancer","rating":3,"content":"I purchased this speaker along with the Bang and Olufsen Beosound A1 2nd Gen. I was looking for a decently portable water resistant speaker for use around the house and while on vacation. I rolled the dice on the Tribit StormBox Pro because the smaller StormBox Micro has a great review on WhatTheHifi. My criteria were USB C, long battery life 15+ hours, IP67, bluetooth 5 or greater, and AAC support for Apple Hifi.The StormBox Pro sounds like every other midlevel bluetooth speaker (i.e. JBL Flip 5, Sony XB23). It is definitely loud but the sound lacks refinement. It outputs the same sound level at approximately 40% volume as the Beosound outputs at 70%. However, the audio sounds like it is coming out of a can. The enclosure definitely influences the sound. With the B&O you just hear the music and it sounds spacious. The soundstage separates the individual instruments. With the StormBox everything sounds on top of one another. Fine details get lost. If you are wanting to listen to Top 40 super loud at the pool or the beach then the StormBox will be fine. It will have better battery life and you don't have to worry about your $200 speaker walking off or breaking. Plus you can buy two StormBoxes for the price of the B&O.When it comes to deciding between the Tribit and a JBL or Sony it will come down to battery life, size, weight, and if you prefer having an app to change settings like Sony has. I think the sound on all three will be close enough. Flossy Carter has a great review of the SoundBox Pro vs the Flip 5 on YouTube. He also reviews the Beosound.One last note concerning Bluetooth performance. I was looking forward to a range increase from 4.2 devices to 5.0+ devices. I tested the range of an older 4.2 speaker against the StormBox Pro 5.2 and Beosound 5.1. All three speakers started to break up around the same area of my house within a few feet so 5.0+ isn't life changing. Perhaps the transmission quality and battery efficiency are better but I have no way to test that. As a side note, my Airpods 3 performed the best range wise going about 10 feet further than all three bluetooth speakers.","timestamp":"Reviewed in the United States January 26, 2022","profile_id":"AHYUWEK7XUDF3MFRJTFYA6G4I3AQ","is_verified":true,"helpful_count":5,"product_attributes":""},{"id":"RZD3ME2JRK4J1","title":"3.0 out of 5 stars Really wanted to like this speaker, but audio quality just isn't there.","author":"Kevin","rating":3,"content":"I really wanted to like this speaker but, at least in what I received, the audio quality is just not there. It's muddy, crackly with even moderate 50% volume level, and ultra high definition audio (Amazon Music) and EQ adjustments don't solve the issue.The speaker looks great and feels like it has build quality. It's water proof and the battery lasts a long time. It's a huge bonus that I can charge my phone from it.I really want to like it, but after firmware updates and tweaking it just doesn't seem to match up to other Bluetooth speakers I've heard. Going to return this one and try something different. Maybe it's just a quality control issue - tons of great reviews here otherwise that don't seem to match my experience.","timestamp":"Reviewed in the United States April 13, 2024","profile_id":"AEN577GPWR5KYGNDAO4UFZYDCECQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R2ZDMYJF812CUQ","title":"4.0 out of 5 stars the XBass button isn't working at all for me.","author":"May Anderson","rating":4,"content":"I just received my speaker a few hours ago. While I think it sounds ok for what you pay for it, my XBass button doesn't seem to do anything at all. I have tried just pressing it. I have even tried holding it down for a few seconds, and nothing changes sound wize for me at all. I am totally blind, so if there is a light that turns on when you activate this feature, I wouldn't be able to see it, but sound wize there is 0 change to the sound. if I am doing something wrong, maybe someone can let me know, but I don't think I am. Otherwize this speaker sounds good for what you pay for it.","timestamp":"Reviewed in the United States September 3, 2023","profile_id":"AGUBO35LXBOVPF57UHJELAEZ77XQ","is_verified":true,"product_attributes":""},{"id":"RDYDQVKW1BRIH","title":"5.0 out of 5 stars Great for TV satellite speaker setup","author":"mike","rating":5,"content":"Looking for an easy solution to add a satellite speaker to my older Vizio sound bar so that the living room TV could be heard easily in the kitchen, I purchased an Avantree Bluetooth transmitter receiver. The idea was to use the optical passthrough function on the Avantree unit and broadcast the TV sound signal to a portable Bluetooth speaker. Unfortunately, most Bluetooth speakers (including Bose) use low quality Bluetooth codecs, which result in enough delay that there was an annoying echo when the Bluetooth speaker and TV speakers were both on. This speaker uses the aptx codec, which has a low latency mode with nearly no delay. I can now have the tv volume at a reasonable low level, and have the Stormbox in the kitchen while cooking or cleaning up, each with independently adjustable volumes. As the Avantree can connect to two devices, I'll probably buy another unit to hack together a whole house sound system for about $300 total.Alone on a flat surface, the speaker sounds okay, but thin. Because of the way sound works, no matter the claims of any speaker brand, speaker cones need to move a lot of air to sound good. No small speaker will ever sound as good as a large multi speaker cabinet. Because I'm pairing this to a sound bar with a woofer, the tinny sound is supplemented by the woofer just fine, and spoken lines from movies and vocals from music actually stand out a little more, which is a good thing in my situation.The Stormbox isn't as pretty as the Bose equivalent, but its laughably better in every other way, for less than half the price.","timestamp":"Reviewed in the United States January 29, 2022","profile_id":"AHJPDCYC74TKCKO6EEHGLLWYIM7Q","is_verified":true,"product_attributes":""},{"id":"R2Y72S0LB6U0K3","title":"3.0 out of 5 stars Decent. You get what you pay for.","author":"Lori A Klumpp","rating":3,"content":"Pros:Low to mid volume sounds great.Solid and sturdy. Has a good weight to it.Easily connected to my Android phone and tablet.Long battery life depending on volume used. I got about 19 hours out of it at around 25% volume.Built-in power bank to charge another device.Supposedly waterproof. I've never gotten it wet.Cons:Volume above 50% becomes distorted.Very little difference when XBass is on.Nearly 8 hour charge time from a nearly dead battery.No headphone jack.Does not connect to my Windows 10 laptop.Not overly impressive. Limited features.I wouldn't buy again.","timestamp":"Reviewed in the United States April 20, 2024","profile_id":"AHDAWAWAQL3PTYDBFMXM3PGM3QAQ","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R2SPCH9WP5ZRRE","title":"3.0 out of 5 stars Didn't suck but not the eye opener the original was.....","author":"D. Barnes","rating":3,"content":"I kept looking for a reason to keep this speaker but I simply couldn't come up with one. I bought the original Stormbox 4 years ago and it blew me away with the vibrancy and dimensionality I heard, all of it complimented with a bass that punched above its weight. So here it is 2022 and I figured I'd check out the Pro. I expected more of the same, only bigger. That's not happened. Immediately you'll see that the outside of the Pro has more of a clothy feel to it all over.And that's exactly what wrong with speaker.Everything I loved about the original Stormbox is gone in the Pro. The vibrancy is gone, the dimensionality and separation is gone and the music sounds like its trying to come through fabric, robbing the music of its highs and mids. The app was finicky and not intuitive at all. It was hard to work the EQ and I could hardly hear any impact. I was hearing performance in the original; in the Pro, it seems like I was just hearing music coming out of a radio.What you do get with the Pro, however, is much more big, honkin' bass. And, yes, it does get mighty loud. And the bass, even at this size, still punches above weight.Now that's not to say the sound had too much bass but it could've stood to be a bit tighter (but at this price point that's wishful thinking). The amount of bass was fine but I really wanted the mids and highs and dimensionality to come out and join the party as well as they did so much better in the original.This will be a return.","timestamp":"Reviewed in the United States December 9, 2022","profile_id":"AFDFKRHUG3WVWHCKUTDDB5KFEOAQ","is_verified":true,"helpful_count":8,"product_attributes":""},{"id":"R2TVLOP1JIOC1U","title":"4.0 out of 5 stars Great Speaker, Love Tribit, But","author":"RicRik","rating":4,"content":"This is my 4th Tribit Bluetooth speaker. Have loved each model except for that darn micro usb type-b ports. Those are hideous, and literally make perfectly good devices useless regularly.•The type-c port they’ve added is a long awaited addition to their Stormbox Pro speaker.All my Tribit speakers have had superb sound quality to similarly priced competitor brands. This also holds true for the Stormbox Pro model.But T here is one annoying little quirk that keeps me from giving the five stars I really wish I could give. Maybe it’s just my speaker but•the volume from third to fourth press increases pretty drastically. I consistently have to either struggle to hear or have it at an uncomfortable volume. That I know of, i didn’t experience this issue on any of the other Tribit speakers until now and if I did it wasn’t as noticeable.• I wish there was an in-between between the two sound levels.I also want to say this little speaker is built very well. Connects easily, charges well, and is over all been a great speaker, especially for the price. I’ve had it now about a year and it’s really held up. •Hopefully the volume issue I’m experiencing will be addressed. Thanks Tribit!","timestamp":"Reviewed in the United States March 8, 2022","profile_id":"AEKU7LJ3YA3OJ7LES24NH3POEBFA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RK38EF3K2ZVZO","title":"5.0 out of 5 stars Class act","author":"John","rating":5,"content":"These speakers are wonderful! After a break in period of about 6 weeks, I can say the sound on these things ( I purchased 2) is excellent and the soundstaging and audio imaging out of 2 of these is way better than all the Bluetooth speakers I've had and or listened to within their class. Believe me these things purch WAAAYYY above their weight!! The highs are crisp without being harsh and mids are clearly defined. The bass response is surprisingly good given the units relatively dimutive size and delivers clean smooth tone. No, it's not going to shatter your windows kinda bass but great nonetheless ( especially with extra bass button enabled). I live in an apartment and as such have never had these things past about 50 % volume and I can tell you if I turned them up any louder the neighbors would call the cops on me!!! These speakers get extremely LOUD!! UNBELIEVABLE!!!So in summary: If you're looking for a great speaker/s at an affordable price, these are a must have and a total win! I purchased mine on sale for a hundred bucks per unit and feel as though I got a lot of quality in these well built, great sounding speakers! Kudos to Tribit!!","timestamp":"Reviewed in the United States February 18, 2023","profile_id":"AHNGPIM4TWMEZHWWIOORQRGAKM5Q","is_verified":true,"helpful_count":6,"product_attributes":""},{"id":"R16H9XLMGZV3IK","title":"4.0 out of 5 stars Awesome speaker, better as a pair, but read on about connections","author":"David and Kimberly","rating":4,"content":"The speakers sound great as a stand alone, but if you buy 2, they sound really good. However, the instructions seem to be outdated and pairing the speakers together in stereo or party mode is a hard. Support said you don't need the app, but I think you do. It took a lot of trial and error, but once I got them paired, they have been good since.","timestamp":"Reviewed in the United States November 6, 2023","profile_id":"AGBHLZ6XRJBBR5RO7BIB4KTHXUMQ","is_verified":true,"helpful_count":1,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:14","page":4,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=4","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=5","asin":"B08MZZTH1N","page":5,"pages":105,"reviews":[{"id":"R3KVH85U2P20VD","title":"4.0 out of 5 stars Volume goes to full blast and scares the crap out of us!","author":"Breck H.","rating":4,"content":"This speaker has pretty great sound quality for its size. Except for the issue I’m having, I’ve really enjoyed it. However, for some reason, every 20 minutes or so, the Bluetooth tone sounds, and the unit operates at full blast for two seconds before returning to the original volume . It scares the crap out of everyone in the house and probably annoys the neighbors. I’ve had this speaker for about a year and I don’t remember it doing this at first. Before writing this review, I clicked on the manufacturer’s support website, which went nowhere, and called the support phone number, which was merely a sales pitch for some online coupon and no support. So don’t count on getting any customer or a technical support for this item.","timestamp":"Reviewed in the United States June 4, 2023","profile_id":"AF3SNEZJV7JKPIOPURZQYADABEEQ","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R28LIMJ3DGXLEL","title":"5.0 out of 5 stars I thought this was supposed to have bass?","author":"Trock","rating":5,"content":"12/28/21 - updateSo I’m not sure what the deal was when I first used this speaker. I’ve used it several days prior, multiple times per day and it’s much louder. I will say the bass won’t work well in certain settings. Example, in my house the bass sounds non existent. In a workout room or larger open areas it sounds much better.So I have a 2nd generation Amazon echo. We use it to listen to music while working out at our house. The sound from the echo has always been surprisingly good, with solid bass for such a small speaker. I think the echo has a 2.5 inch woofer and a smaller tweeter in it. I was hoping to upgrade from it since we got it in 2017. This speaker honestly isn’t really close to that echo bass wise. Clarity wise, the Stormbox sounds good. I’ve listened to it for a day so far and I’m disappointed. Maybe my expectations were a little too high, but a speaker from 2017 shouldn’t sound just as good or slightly better than this speaker I feel like. Im not a huge audiophile pr anything like that, I just wanted something that had some kick. If that’s what you want, this probably isn’t for you. It gets decently loud and sounds clear, but even with the “X-Bass” setting, it doesn’t have hardly any bass.","timestamp":"Reviewed in the United States December 23, 2021","profile_id":"AGHMTVVT4AEKG56RMRN7LEP323GQ","is_verified":true,"helpful_count":3,"product_attributes":""},{"id":"RJV4KDE54UIWA","title":"4.0 out of 5 stars Great value for the price but not without issues …","author":"Butch Montoya","rating":4,"content":"Outstanding little speaker(s) for the price but it does have a couple issues.1. Bluetooth drop off - from time to time one will experience Bluetooth drop off (note: I have this paired with my iPhone 8Plus and iPad Pro). I experience it when listening to music and then changing app on my iPhone. I also note that when I’m “stereo mode” the Bluetooth range is limited to about 10 feet (between the two speakers) but in “Party mode” I get a range of 30 to 40 feet before I get Bluetooth drop off.2. Switching between the two devices can be cumbersome (I found the best way is to go into the Bluetooth setting in the active device and “disconnect” before switch to the second device).3. Notification (sounds) and answering my iPhone doesn’t always work (but I don’t like answering my phone over the speaker [privacy issues] so for me, this is not a big issue).Edit: After talking w/ Apple Support I discovered that the Bluetooth dropping (when switching between app while listening to music [while connected to my TriBit StormBox Pro]) is an Apple issue w/ their current software (iOS 14.7). But that doesn’t explain the Bluetooth distance issue when in stereo mode vs party mode.","timestamp":"Reviewed in the United States June 17, 2021","profile_id":"AGJGW3TLTKAA3H3PKELQM4ELLO6A","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R1HABGEM2JJ392","title":"5.0 out of 5 stars Great background music speaker","author":"ms","rating":5,"content":"I have been looking for a relatively low cost background speaker for my music and SIRIUS radio. This little speaker with a big sound is perfect. It is well balanced and is perfect for elevator music playing in the background without disturbing any activities such as talking or working on your computer. I found it perfect on a low sound setting.","timestamp":"Reviewed in the United States February 24, 2024","profile_id":"AGVU55QPNEK7X6AFUG3ZV6JUS53A","is_verified":true,"product_attributes":""},{"id":"R1REXLXW5DHGYJ","title":"5.0 out of 5 stars Maybe the King of $100 speakers!","author":"Jay Chambliss","rating":5,"content":"Not sure of the price of the speaker right now but it's usually around the $100 range. It could be a couple of dollars more, or maybe a couple dollars less. I am not familiar with every speaker in this price range but for the few I have experience with, there's no comparison. These include the JBL Flip, The Bose Soundlink, The Sony SRS, The UE Boom and others. The problem is that it's an unfair comparison. These speakers are much smaller than the Stormbox Pro and they all perform much smaller as well. To get a fairer comparison, you need the JBl Charge or the UE Mega Boom and the Bose Soundlink Revolve but then, you're in an entirely different price range and I believe this speaker can punch with those guys as well! It may not win the fight but it wouldn't be a KO! Add in the fact that you can buy two of these and connect them together for the price of the the Soundlink Revolve and it's clear. The Strombox is clearly King Of The Mountain right now.","timestamp":"Reviewed in the United States August 31, 2022","profile_id":"AGSQH6BTSMB3IZYQSRD3JOBH2X2Q","is_verified":true,"helpful_count":3,"product_attributes":""},{"id":"R1L0X18TTKD8J2","title":"4.0 out of 5 stars Great for its size","author":"Michael Maxwell","rating":4,"content":"Great sound for small size. Same sound in any direction. Distorts at loud volume, especially hard rock. Great for hip hop. Jazz, etc. at louder volume. Biggest flaw is volume seems to double with each tap of volume button. Too quiet, then too loud. Frustrating","timestamp":"Reviewed in the United States November 10, 2023","profile_id":"AEORIBTUNVOGEROSI42LG3YKNO3Q","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R3QPZBI451L6DK","title":"4.0 out of 5 stars Tribit pro","author":"Danny Wise","rating":4,"content":"It sounds good,similar to Bose revolve2. Not as nice at full volume on this particular one. Does have the 360° sound not bad for the price I paid.","timestamp":"Reviewed in the United States December 11, 2023","profile_id":"AFK5KG3KBO36CBCIO37VGOKG3BMA","is_verified":true,"product_attributes":""},{"id":"R21QLGCRUTV52T","title":"5.0 out of 5 stars Sound is awesome for small rooms.","author":"fun,fun","rating":5,"content":"Plays awesome in smell area.","timestamp":"Reviewed in the United States May 9, 2024","profile_id":"AFZTWW55R2Q37JX74AHM2HEEGV7Q","is_verified":true,"product_attributes":""},{"id":"R78NMVQ7N4OA2","title":"4.0 out of 5 stars Better than the original","author":"Keith Sennette","rating":4,"content":"I had the original Stormbox Pro and it sounded okay but the bass was weak. Just got the upgraded version and I must say I was surprised how much deeper the bass is compared the original Pro. It's not perfect, thats why only 4 stars overall. I sold the original only a few days after I got it. I'm going to keep this one.","timestamp":"Reviewed in the United States September 17, 2023","profile_id":"AF66V7KIFRTXODQSC22JKRBANH2Q","is_verified":true,"product_attributes":""},{"id":"R2SRDD57MNEH04","title":"5.0 out of 5 stars Great Sound Quality","author":"John Mccomas","rating":5,"content":"This little speaker sounds bigger than it is. Sound quality is very good. Very happy with it.","timestamp":"Reviewed in the United States April 19, 2024","profile_id":"AEEVYE2D6EVXCBBK7AECNO6WBGQQ","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:15","page":5,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=5","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=6","asin":"B08MZZTH1N","page":6,"pages":105,"reviews":[{"id":"R1SMIZNB8RPMOP","title":"5.0 out of 5 stars High quality sound, durability, battery. All great all around","author":"Gary H.","rating":5,"content":"If youre looking for a speaker get this one! Durability, battery life, charge time, 360 sound, bass quality, sound is good and loud enough for small social settings, waterproof i brought in shower few times and still works fine after getting wet, didnt even dry it off, let it air dry, anyway the handle is nice and hasnt shown sign of loosening after like 6 months of use, i clipped the handle on a strap on my golf bag and drove around and it was still fine, flat base makes it sturdy when standing on tables and round edges gives good appearance and better feeling in the hand if you just grab it. I keep it in x bass mode mostly all the time but can turn it off for special situations to make it more subtle. It has 360 sound but two sides have 2 speakers and 2 have 1 so if you rotate it it hits different but its not that noticble if youre not within a couple feet of it. Pretty much the best speaker ever, id say maybe could improve by putting 2 more speakers in it for s little more oomph. But regardless the sound is good i like the bass on it and im usually a stickler about that.","timestamp":"Reviewed in the United States November 28, 2021","profile_id":"AFPXMHDJVHLL4UZOBGOG5FBDMECQ","is_verified":true,"product_attributes":""},{"id":"R3RDMB7ZLABLQM","title":"4.0 out of 5 stars Buen dispositivo.","author":"Dante Gutiérrez","rating":4,"content":"cumple con sus especificaciones. buen sonido, graves fuertes, pero definidos, medios y agudos nítidos. duración de batería bastante prolongada. Un detalle a mencionar y es que se escucha muy diferente según al dispositivo que se conecte. Tengo un Huawei Y7 (malísimo) y el audio va fatal, incluso se escucha peor que el Tribit Stormbox (no se confundan es un muy buen altavoz también) pero la incompatibilidad depende del dispositivo. Lo conecté a mi pc y la calidad cambia brutalmente.","timestamp":"Reviewed in the United States July 26, 2023","profile_id":"AECSBLV3VLO4RCEGAKHKJMOH4Z5Q","is_verified":true,"product_attributes":""},{"id":"R3KFM29W7I59VA","title":"4.0 out of 5 stars Buena relación calidad-precio","author":"Luis Daniel","rating":4,"content":"El sonido es realmente equilibrado, no hay mucha diferencia en el sonido cuando se activa la función de \"bass\" pero se siente un poco el cambio. La duración de la batería es lo mejor!! Lo recomiendo.","timestamp":"Reviewed in the United States November 10, 2023","profile_id":"AEMJS7WQMYLJ27KOTJLZW22II5DQ","is_verified":true,"product_attributes":""},{"id":"R3OWNB528DZ2IB","title":"5.0 out of 5 stars Great bluetooth speaker for the money","author":"H. Rutland","rating":5,"content":"Highly recommend the Stormbox pro, I needed a decent bluetooth speaker for apt and to take on travel without spending a few hundred dollars. Did my research and ended up going with Tribit over the Sonos roam since I already have a Sonos soundbar for TV and love it. Very happy with decision. Great value, very well built and delivers nice clear sound. My cons are comes with very short non braided cable and should STOP using plastic caps for packaging (should be cardboard). Yes, it does take 7-8 hours to charge but hey you get a long life battery so for a speaker where I do not need a quick charge I have little issue with this. I like the larger capacity battery. Overall for a decent bluetooth portable speaker in the $100-200 range this has my vote. Was not familiar with Tribit brand, own Sonos, Bose and JBL. Holds its own and well built. Sound quality not quite there with the big boys but close enough. Would definitely buy Tribit again.","timestamp":"Reviewed in the United States June 18, 2022","profile_id":"AGK55G4BU7AMGR2ER2YHRGV3CYHQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R218QGOOJNASBI","title":"5.0 out of 5 stars Best bang for your buck, great sound quality!","author":"CrunchyDaddy","rating":5,"content":"I bought this in Oct/21 and it's still kicking like new! Prior to owning this Tribit, I was using a JBL Charge and Megaboom. Both were good units but I felt like both of them were missing something, like a little bit more highs and just a tad more lows. I always liked the Bose Soundlink design but just not the price. Random browsing took me to this Tribit. I decided to give it a shot and wow, I can't say how much I love this thing. I'm no sound expert, but what my ears were hearing, was just the right amount of everything that was missing by the others. Battery life is awesome and I don't feel like it's battery has faded at all.I can't even say \"great budget speaker\" is right for this thing. Price aside, I feel like this goes up against the bigger brands.","timestamp":"Reviewed in the United States February 10, 2023","profile_id":"AE6VKUWKPSLHNVNMFQOVMK6625ZA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R2ZYIP0SNQXUO5","title":"2.0 out of 5 stars look elsewhere if possible","author":"Maevis","rating":2,"content":"this thing is pretty good (i would actually love it if it functioned properly), but the negatives about this speaker make it almost unbearable to use.when we first got this speaker i rated it 5 stars because it worked well for our halloween party- it easily paired with our laptop/projector setup and the 360 degree sound was helpful for people who were a bit further from the screen/closer to the fire to see AND hear.music also sounds good coming through it (as much as music *can* sound good….) when it works.the issues:1. when my spouse pairs to the speaker with their iphone 13 pro max and spotify, the speaker volume - out of nowhere - goes so high it’s almost deafening and other times will absolutely disappear. it’s like you’re on a carousel and there’s one super loud speaker that you pass by over and over again. it’s terrible. we haven’t found a way to fix it.2. forget about pausing your music. the storm box refuses to have music paused for longer than 0.5 second. you can keep manually pausing the music on your phone and it’ll keep starting right back up. it does this with every use when paired with my phone, which is an iphone 13 mini.3. you apparently can’t do anything else on your phone that may make noise while paired to the speaker - even if your settings are to have games/social media/etc without audio, the speaker does not care. it’s playing that audio with or without permission. i’d imagine that information could come in handy if you find yourself in an american pie-esque situation.the title of the review basically says it - if you can, get a different speaker. there will be inconveniences/annoyances (that may potentially be triggering if you happen to be autistic. *cough*)","timestamp":"Reviewed in the United States April 20, 2023","profile_id":"AGJQMVAE2WCPXBQEK4DELNPJ5O4Q","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"RAWVA0FVKJ5AR","title":"5.0 out of 5 stars Good speaker, GREAT customer service!","author":"James C Peterson","rating":5,"content":"I bought this speaker about a year ago and it worked great. The sound was good, the battery held up... Zero complaints. But then, suddenly, it refused to charge up. In looking through the reviews, this appeared to be something that some other users were experiencing as well. I Googled some solutions to this problem but none of them resolved the issue and I was left with a speaker that wouldnt charge up barely a year after I purchased it. I saw they had an 18 month exchange policy so I contacted the vendor expecting to be put through a long and painful process in order to exchange my non-working device with a new one. I was pleasantly surprised when the company responded back very quickly and, after a short discussion, happily exchanged my speaker with a new one. Good customer service has become harder and harder to find. I appreciate organizations who still recognize the value in being decent to their customers.","timestamp":"Reviewed in the United States July 1, 2022","profile_id":"AEOIF4EV42UA55GE4B7T5FZO5NCA","is_verified":true,"product_attributes":""},{"id":"RX96YCRBK4SXO","title":"5.0 out of 5 stars Amazing Sound!","author":"DonkeyHut","rating":5,"content":"I had been using a waterproof/drop-proof Anker speaker for several years in my bathroom and shower, but just before Christmas it stopped charging, so I had to get a new speaker. Even though this one was more than I wanted to spend, even with the holiday sale price, I decided on it based on product reviews and features. A real subwoofer was a must-have for me as I was used to the subwoofer on my previous one, and I love bass. This speaker did not disappoint! I love listening to my music on it and having the bass shake my counter and tub! The handle makes it easy to carry, which is nice. The size is good, and it has no problems with the water in the shower, which occasionally was an issue with the previous one when soap/water got stuck in the speaker holes, distorting the sound until it dried. I'd definitely buy it again, and might one day for the pairing feature, but I don't currently need that.","timestamp":"Reviewed in the United States March 9, 2022","profile_id":"AHCLLIFQ7X3VP3WMTOE437OXS55Q","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R2E9OH2L4URRAN","title":"4.0 out of 5 stars Nice sound but lacks a little bottom end.","author":"A helpful reviewer","rating":4,"content":"Nice sounds but it lacks a little bottom end. But still, not bad.","timestamp":"Reviewed in the United States November 25, 2023","profile_id":"AEF3ZHSDK5EKB46BKNSGC26LOCYA","is_verified":true,"product_attributes":""},{"id":"R2TQ4TBUWI291J","title":"5.0 out of 5 stars Amazing","author":"Raul Almeida","rating":5,"content":"Excellent product with high quality sound, connectivity, easy to use.","timestamp":"Reviewed in the United States March 25, 2024","profile_id":"AG5HLTWEB2N6SSTEVD7452YRFHXA","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:16","page":6,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=6","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=7","asin":"B08MZZTH1N","page":7,"pages":105,"reviews":[{"id":"R3IUKOXPUOBWRH","title":"5.0 out of 5 stars Too good for the price","author":"Mario","rating":5,"content":"I recently got the Tribit stormbox pro and the micro2 version. What I have to say is that these two products are amazing for the price. About the sound quality I would not say that is the best when we compare it to for example Bose products, specially when you start pushing all the volume up. I would say it’s a “good” sound quality until it reaches 80-90% of its capacity. I am a musician and dj so I really appreciate good music quality but for the price again, I think it’s totally worth it 100% recommended","timestamp":"Reviewed in the United States September 8, 2023","profile_id":"AFFSYJTFTR4A2OWY6BWJHLR32PTA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R236H72TKAKYWY","title":"5.0 out of 5 stars Sound quality and battery capacity","author":"Thomas Roman","rating":5,"content":"It's heavy, but sounds and last a lot longer than the equivalent JBL, or UE. Highly satisfied with this Beasty. Only charges at 5v in so it doesn't exactly fast charge, and it has a 5k mah battery (I think it's actually like 7200 before the conversion) it's equalizer on the app is good, but you need to open that app to \"set\" the sound.Overall, for a small, no name company. It beats Bose, JBL, ue, bang & Olufsen.","timestamp":"Reviewed in the United States October 13, 2023","profile_id":"AGL6JVPCY6TNY3DL36WBOYXNJCMA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R2913RCX37E24L","title":"3.0 out of 5 stars Surprised at all the positive reviews","author":"D. B. K.","rating":3,"content":"This Bluetooth speaker is very well-made and portable, however, the sound quality / volume / bass (even with the boost turned on) can be purchased with another speaker on Amazon for $45-$50.","timestamp":"Reviewed in the United States March 4, 2024","profile_id":"AGBM4COFOAF3WKCXFN2QLJUCTAHQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RF39EVYDHE7K4","title":"4.0 out of 5 stars No power after charging for about 2 hours","author":"Michael Thoj","rating":4,"content":"I bought the speaker back in January 2023. I've had used it quite often but for some reason after I charged it for about 2 hrs. Now the power won't turn on. What should I do? Are any others having the same issue. I truly enjoy using this speaker thus far.","timestamp":"Reviewed in the United States July 3, 2023","profile_id":"AE2J4QIC4VX7M63F7KBKHBFEC6MQ","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R2X9YJMSDEI8GZ","title":"3.0 out of 5 stars Not good when you need lower volumes","author":"Primer","rating":3,"content":"I own 2 of these and both have the same issue. At low volumes there's not enough fine tuning adjustment. For instance, if the volume is on a scale of 1-10 with 1 being the lowest audible volume, the volume jumps from a 2 to a 5 with just 1 increase of your phone's volume adjustment. This happens with any phone or app and with both speakers. I emailed Tribit support and they said these are high volume speakers so the overall volume is loud. That doesn't make sense as my car and home audio are significantly louder but have the ability to fine tune lower volume levels.Why is this an issue? We camp and travel a lot and play music by the fire after the kid's go to sleep, and the low volume is barely audible, but then increase it 1 notch and the volume is too loud for quiet hours, there needs to be more steps of adjustment in-between. I think this could be easily fixed with a firmware update. Until that happens, I cannot recommend these as an everyday all around speaker, but rather they're more niche for when you want high volume, in which case these excel at that.","timestamp":"Reviewed in the United States July 18, 2022","profile_id":"AFX56PFKD6PZOSUXWTRQV3H3CFOA","is_verified":true,"helpful_count":3,"product_attributes":""},{"id":"R3KDM76MUV3UKV","title":"5.0 out of 5 stars For the money, unbeatable","author":"garoldovich","rating":5,"content":"It would be hard to find a better-sounding speaker for this money. To my ears it is as good or better than some twice the price. For my purposes it is handy that it can play while charging, but also seems to have really good battery life. The surround-sound feature? On all these speakers I find that to be over-hyped, so I didn’t expect much and wasn’t disappointed. I bought two for stereo, and they pair beautifully and remember that they are a couple. Have had no issues with Bluetooth pairing. In terms of price-to-sound and size-to-sound ratios, this may be the ideal trade-off.","timestamp":"Reviewed in the United States July 14, 2023","profile_id":"AEQPMLQWJFIA2JAO5UB6HZFP4ZBQ","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R3A8M8F0N2ZZ73","title":"5.0 out of 5 stars Wow!! (Updated)","author":"Ismael Negron","rating":5,"content":"I got this based on the reviews, and a 15% OFF deal.WOW! The sound is fricking amazing! I have a few bluetooth speakers (Bose Mini, Sony, Altec Lansing, and Creative) and this one is the best. Very clear highs and good bass, even before activating the loudness function, XBass! When you do turn XBass on get ready to party.I only have one (for now!), so I have not tested their \"Party Mode\" (linking more than one device for stereo play, or multiple areas).The long battery life will surely come in handy, as will the fact that it is waterproof (IP67).Anyway, I definitively recommend this!UPDATESo, I got a second one and, as expected, I was blown away! The \"party mode\" is good for setting more than one speakers around the house, all synced to the same device. \"Stereo mode\" is nice, and works as expected; but, I am not sure I am going to use it much... I mean, in the situations when I expect to use these speakers I'm not going to care much about stereo sound. Still, a nice feature to have.","timestamp":"Reviewed in the United States June 10, 2021","profile_id":"AED4VFHZR77VDBOMHOSZET4ITYFA","is_verified":true,"helpful_count":23,"product_attributes":""},{"id":"R18C7AKZ7TDHOM","title":"4.0 out of 5 stars Nice sounding speaker with good, no GREAT battery life","author":"Wade Spray","rating":4,"content":"Update: I have now been using this speaker on the job for 4 months and I like the speaker even more than my first review! Put it in the corner of the room and crank it up, sounds great (my son is always making me turn it down), For best bass put on flat surface (floor or stand) and 2 surround it on 2 sides. The battery is the best of all the BT speakers I have tried (about 20 in the last 2 years). You can have it at moderate volume for 3 working days before you have to charge it. Best value out there!Nice speaker, a bit big for sound output but battery is very good, I use it for job site. I actually has nice bass but you need to put it on a flat surface for bass response","timestamp":"Reviewed in the United States November 28, 2021","profile_id":"AGSGFNQPTJWL2FARAWMSAIFUXMHA","is_verified":true,"product_attributes":""},{"id":"RXHKIHRXJPI4J","title":"5.0 out of 5 stars A great overall performer!","author":"Freddie Dunn Jr","rating":5,"content":"I was shopping for a portable Bluetooth speaker to use at casual gatherings outside. I already knew about the more popular makers like JBL, Bose etc. I found a website comparing the Trinity Stormbox Pro to other top speakers. They liked it so I decided to try out. I'm glad I did. The Tribit plays louder with clarity than my JBL Flip 4 (which is also a great speaker, and is less expensive). The Tribit is IP67 water and dust resistant, has a handy strap for carrying or hanging, and radiates sound in all directions! It's perfect for small to midsized gatherings, or for music in the home where a larger stereo is too much. The battery life is good. We've played it at 2/3 volume for five hours and it was less than half discharged. It pairs easily and stays connected. We're really happy with this speaker.","timestamp":"Reviewed in the United States May 4, 2022","profile_id":"AG4UD2WKMI7VQ3WUQDK6RMYE4UBQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R1R56NNVF3GJ56","title":"5.0 out of 5 stars Unbeatable at this price point!","author":"Jazzyguy","rating":5,"content":"I have a huge collection of bluetooth speakers. Small ones, large ones, cheap, expensive, you name it. These particular speakers, of which I bought two, are probably the best bang for the buck in my whole collection. Individually, they won't blow you away with their sound quality, but the bass is balanced, the mids are nicely forward without being tinny, and the highs are plenty crisp and clean. Pair two of them together, though, and they really shine. Super cool as a TWS pair, and also quite effective in party mode, which makes the same sound come out of both speakers. Very cool to put one on the patio and one in the house when having company.At this price, you would be hard pressed to find anything better. I have tried, and I have not been successful.","timestamp":"Reviewed in the United States August 14, 2022","profile_id":"AEM3WTN3MOG6E4DDNDOSZ5DCKWPQ","is_verified":true,"helpful_count":4,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:17","page":7,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=7","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=8","asin":"B08MZZTH1N","page":8,"pages":105,"reviews":[{"id":"R2Z6LDEF83PTCJ","title":"5.0 out of 5 stars Best value for the price","author":"Mojo","rating":5,"content":"I bought two so I could have stereo sound and was not disappointed, very good mid and voice clarity, bass is clean but not booming. I enjoy my music at moderate levels. For there size the sound is remarkable. The carry strap is a nice feature, the speakers appear overall well made, controls so far work well, battery life seems to last forever. I also have a Bose Bluetooth speaker that may have a slightly better bass to my ear, but for the money it would have cost twice as much to get two Bose speakers for stereo sound, price difference was not worth it. These speaker are a good value, my opinion best sounding in there price range.Update: Sept.2021 - One of the speakers will not turn on, contacted Tribit went through troubleshooting per Tribit instructions, still did not work. (Has 18 month warranty). Tribit sent me a new replacement speaker, received in 2 days. Did not require sending the defective speaker back.","timestamp":"Reviewed in the United States August 24, 2021","profile_id":"AH4BTNWQQVCQ65BRGWHTIS4UGYMA","is_verified":true,"product_attributes":""},{"id":"R1GC425BOF2Z9I","title":"3.0 out of 5 stars Nice style, very portable, better than most things at this price, let down by sound quality.","author":"Richard S. Melton","rating":3,"content":"It sounds like it looks, small and boxy.It's really portable and nice quality, seems really durable, but the sound quality and levels are really only something I'd use for News radio or books on tape.Voices sound clear and clean but not very realistic.Compared to other BT speakers this is a great little unit, but not something I'd ever reach for if I just wanted to listen to some music.Yeah there's more bass than some other BT speakers and the audio isn't as grating, but compared to a SONOS move, this is not anything like a realistic sounding speaker.Ok, to be fair, JBL, BOSE, SONY and other name brands NT speakers at this price or even just this firm factor, are NOT better than this speaker. It's a good or better than anything else in its class.However...Headphones and earbuds at this price are 10x better, obviously. So really, for me, I just don't see a use for speakers like this other than talk radio.","timestamp":"Reviewed in the United States August 6, 2022","profile_id":"AFPUHZ3DKB35JP72TSQ3HADSWZ7Q","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R1LWGVCXB1J2G0","title":"5.0 out of 5 stars Immensely pleased!","author":"Jeff Percell","rating":5,"content":"I researched bluetooth speakers for a few weeks before making this purchase. I've had small inexpensive bluetooth speakers before but this was going to be the first one I bought expecting and hoping for great sound quality from. After my research I settled on the StormBox Pro as my choice. Maybe I'm a pessimist but I was prepared to receive the speaker and be happy with it but not overjoyed or have that \"wow\" moment. But...wow moment it was. From the first time I turned this thing on I'm thinking to myself how great this thing sounds. It's been a few weeks now and I am immensely happy with this thing. Battery life is outstanding, again - the sound quality is outstanding, it's solidly built but still portable, and I think it looks sharp. I would recommend this speaker to anyone looking for a high quality bluetooth speaker that won't break the bank.","timestamp":"Reviewed in the United States December 7, 2021","profile_id":"AE6OD7CUR3SGUGFPSAF3BNYFEVCQ","is_verified":true,"product_attributes":""},{"id":"R1FLRKOAXRMF7O","title":"3.0 out of 5 stars Not bad, not great","author":"garanda","rating":3,"content":"I purchased this speaker after owning the original Stormbox and Stormbox Mini II. Both of those speakers were amazing so I was very excited to get the next step up. The original stormbox is a small speaker (slightly larger than a Flip 6) that punches way above its weight class. I was expecting more of the same from this speaker. While the Stormbox Pro does get louder and has more bass, it does not feel as punchy as the original stormbox. It also has a much warmer sound so the highs and mids sound a bit muffled. To sum it up, this speaker has decent sound, but does not really follow the formula that made me love Tribit products.","timestamp":"Reviewed in the United States July 2, 2023","profile_id":"AFM4VDJKDBRZIOA6CFS4NI3VSPYA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RZT5S43VRVJFT","title":"5.0 out of 5 stars Excellent Speaker!!!","author":"William J. Rahming","rating":5,"content":"First of all this is one of the nicest looking speakers I have ever seen. I love the look.I have always been drawn to good quality sound. Never one to buy budget stereo stuff because the sound was usually awful. Tingy highs and muffled lows.I was scrolling through speakers on Amazon and came across this one. When I saw the specs, I knew I had to have it! When I got it I knew from the feel it wouldn’t disappoint and it certainly did not! The sound on this thing is outstanding! The highs, lows and clarity even at high volumes is unreal!I have a limited budget, but my taste in sound has always steered me towards a desire for more expensive speakers. However, this speaker I think holds its own to some of the best names in the business despite its modest price tag! I would highly recommend this speaker!","timestamp":"Reviewed in the United States October 7, 2021","profile_id":"AEXR62C5AHVNBHEFTVXAMVANINIA","is_verified":true,"product_attributes":""},{"id":"R90M0RW1UYPNR","title":"5.0 out of 5 stars Actually impressed.","author":"Miguel T","rating":5,"content":"I usually buy name brands after a horrible experience with a generic brand (Chinese) but decided to give this high rated speaker a try.Sounds it's decent not as clean as my $350 speaker but good enough and bass just perfect.Battery so far lasts me a few days(hours) not needing to charge for days sometimes.","timestamp":"Reviewed in the United States August 28, 2023","profile_id":"AE26EUNCZXT23QQS7KONVDPOBUQQ","is_verified":true,"product_attributes":""},{"id":"R2ZKX0ZPG1JUZQ","title":"3.0 out of 5 stars Battery issues.","author":"A. Adams","rating":3,"content":"Read and weep, after just under 22 months we have a battery failure. The speaker often acts like the bluetooth is connecting, just shut off with what shows like bluetooth connection at 3/4 charged, then connection sound and then nothing for the battery even though 10 seconds earlier with 3/4 charge.As for the speaker great sound for my old ears but the bluetooth was limited with less range than other devices, especially my old speaker which got drug out until a new one comes. Way sad about this one.Attached are two photos take 10 seconds apart or so with the first charged and the second power is gone.","timestamp":"Reviewed in the United States June 18, 2023","profile_id":"AGJXAV6IKTWF5ALTDKDX74EHBPFQ","is_verified":true,"product_attributes":""},{"id":"RIHJYIEBCR6R3","title":"5.0 out of 5 stars As Advertised!","author":"A Wandering Papist","rating":5,"content":"I love the fidelity, size and ease of operation.","timestamp":"Reviewed in the United States February 4, 2024","profile_id":"AHGAGTWGSIQUGGZHJEQ5FDV75RXQ","is_verified":true,"product_attributes":""},{"id":"R15TKQ3NV4I8X5","title":"4.0 out of 5 stars Loud, Clear, Good Bass","author":"Allan","rating":4,"content":"I'm by no means an audiophile. Before I bought this speaker, my primary go-to was the Doss Soundbox XL, which sounds excellent. The problem with the Doss is that it doesn't get loud enough for me. The Tribit solves that problem, has really nice bass and sounds pretty clear. If you run this against a YouTube speaker test, it will not hit all frequencies on the high or low end, but it still sounds good and is reasonably priced. I would recommend.","timestamp":"Reviewed in the United States July 10, 2022","profile_id":"AF6S4E5BTYC4LRA54JIXI6GJWVMA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R37CDBLRS4FH0E","title":"5.0 out of 5 stars Good volume for the size","author":"ConstantGardener","rating":5,"content":"This is a great portable speaker. I’m a dance teacher and it’s perfect for traveling to spaces that don’t have a sound system. The audio quality isn’t as nice as my Bose speakers but this one is much louder. It’s easy to use, stays connected once connected and is simple to operate. It works for outdoor use too. For the price it’s a great value. Not for the audiophile but excellent for a bbq or a dance class.","timestamp":"Reviewed in the United States June 19, 2023","profile_id":"AFJIM56HAXDLXELUSPZH5XB7JZHA","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:18","page":8,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=8","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=9","asin":"B08MZZTH1N","page":9,"pages":105,"reviews":[{"id":"RR12UNB2WL592","title":"5.0 out of 5 stars Updated review!","author":"Horangie78","rating":5,"content":"Update! Tribit finally reached out to me and gave me a full refund for the issues I had! What an awesome company! Didn’t think it was possible to have company’s who actually stand behind their products! Highly recommend based on they’re excellent customer support!Had this speaker for a little over a year. After 3 months, the Bass stopped working. Ok. I can live with that. But a few weeks ago, now the battery doesn’t hold charge. Tried to reach out to Tribit based on other peoples reviews. No response.","timestamp":"Reviewed in the United States February 13, 2023","profile_id":"AGWBKNHL3BWVRVTM564EZDAYLWNA","is_verified":true,"product_attributes":""},{"id":"R1HOTWYDSWCAKC","title":"5.0 out of 5 stars Great product , great customer support","author":"Amazon Customer","rating":5,"content":"Initial device stopped holding a charge after only 3 weeks. However customer service was great and sent out a replacement immediately. The sound quality is outstanding for the price and I’m incredibly satisfied, both with the product and customer service!","timestamp":"Reviewed in the United States October 9, 2023","profile_id":"AHDDXTZRYL4VKFF6FAWOQPZUWADA","is_verified":true,"product_attributes":""},{"id":"REMHAEP3OLSHY","title":"5.0 out of 5 stars Amazing speaker","author":"ohcankan","rating":5,"content":"I needed a portable speaker to bring with me to the Pickleball court for some music. It’s super easy to bring along with the handle. It sounds amazing ~ no one can believe the sound coming from the speaker. The battery life was insane. I use it 2 hours daily and finally broke down and recharged it even tho it still had 2 out of 5 lights left after almost 2 weeks. It is waterproof which came in handy today when it started to rain. At least 2 or 3 people were planning on buying one once they saw and heard this one. So happy with this purchase!","timestamp":"Reviewed in the United States August 15, 2022","profile_id":"AEBZHKYOTA3UEMWAOK3ZJY2AJ3JQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RRGDAZQE0QEF8","title":"5.0 out of 5 stars Affordable","author":"Mario Ferroni","rating":5,"content":"Cist","timestamp":"Reviewed in the United States February 22, 2024","profile_id":"AFEVHEAEMEJFUFALEHM3LERWNTZA","is_verified":true,"product_attributes":""},{"id":"RTAG7OVWQF7PW","title":"5.0 out of 5 stars TriBit Makes An Excellent Wireless Bluetooth Speaker","author":"GreatLakesGuy","rating":5,"content":"I bought this speaker to use for our Wednesday night open gym youth gatherings. This speaker truly fills the entire gym when the volume is turned up. The sound is not distorted, and the base sound for a speaker this size is surprising.The battery life has been great. I use it for a couple of hours with no problems and there is still plenty of charge left every time.The range of the bluetooth is quiet good as well. My phone is over 50 feet away, because I need to get a wireless signal from our building internet. There are no sound hiccups or delays.It is worth the price, and I have been very satisfied with my Tribit Stormbox Pro.","timestamp":"Reviewed in the United States February 17, 2022","profile_id":"AEQDDQ7KHSKHSVBAGTLZLDDD4PSA","is_verified":true,"product_attributes":""},{"id":"R27T92EYKS9ZHW","title":"4.0 out of 5 stars Tribit does it again","author":"Mingus","rating":4,"content":"Great sound, clear and the bass works well. It wont blow you away, but it will give you a good clear bump that is not weak or tiny at all!! The only problem i have with it is that they don't include a port jack in like on the original storm box, and there is no app to adjust the equalizer, which if you had a port in you could just do it from the music source. I mean, it's nice you can plug a usb in there to charge your phone, but... i'd rather a headphone jack. Other than that, it is a sweet machine. An improvment on the Storm Box. Thanks again Tribit!!! Cheers.","timestamp":"Reviewed in the United States April 24, 2021","profile_id":"AHCQTJVPRHPDXSDNFZ2KVKKDL4ZA","is_verified":true,"helpful_count":3,"product_attributes":""},{"id":"R37AW8SNYGELTZ","title":"5.0 out of 5 stars Best bang for the buck","author":"Marvin Cabrera","rating":5,"content":"Sounds clear and loud, Battery does last more than my JBL charge 4 .Only con for me is when that you hit max volume the music pauses for a quick sec .","timestamp":"Reviewed in the United States September 30, 2023","profile_id":"AE2PELZEIEZ4GDHXEGB4K3ZZDHXA","is_verified":true,"product_attributes":""},{"id":"R1XJVAU4L2OJDM","title":"5.0 out of 5 stars Great speaker with even better customer service","author":"Daniel J","rating":5,"content":"I bought this speaker for some backyard music and also to have the television play through the speaker. I had some trouble getting the music-streaming apps to play through the speaker so reached out to tribit. Rachel from tribit was a Rockstar. Her customer service is 5 stars. She got me up and running, and followed up with me to make sure all was well.The speaker sounds great when playing music and, when playing the TV through the speaker there is no noticeable lag between lips on tv and audio from speaker.Great portable speaker!","timestamp":"Reviewed in the United States September 19, 2022","profile_id":"AGH666ACFAPHHAJ7HBKFJ2MTTUKQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R1I0EDQHL48NUJ","title":"4.0 out of 5 stars Good speaker but failed to Impress compared to it's predecessor.","author":"T G","rating":4,"content":"I was hoping that the \"StormBox Pro\" was much improved over the previous Stormbox. The Pro was no doubt a nicer looking much louder speaker with audio output that was clear at high and low volume. The battery life is nothing short of outstanding. However, because I've owned the former Stormbox speaker/s for a couple years, I find that the bass reproduction even with bass boost activated on the Pro, low and high volume in my humble opinion was subpar in comparison. The overall sound reproduction was not as rich as the StormBox, originally MaxBoom. Nevertheless, you won't be disappointed in the \"bang\" for the buck that the \"Pro\" provides overall.","timestamp":"Reviewed in the United States June 7, 2021","profile_id":"AE65V73AQ73KTKNSW2ECGRPF62HA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"RZ49TPMAKA49L","title":"5.0 out of 5 stars Awesome sound.","author":"CRS 1950","rating":5,"content":"I like every thing about these speakers. Paired in seconds have a pair of them very well built look awesome.","timestamp":"Reviewed in the United States November 9, 2023","profile_id":"AGOZDEFKBWP7TGTD72LUQWX3N5LA","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:19","page":9,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=9","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=10","asin":"B08MZZTH1N","page":10,"pages":1,"reviews":[{"id":"R2VKHDS6FTTW5N","title":"5.0 out of 5 stars Sounds amazing for the price","author":"Chris","rating":5,"content":"My bose revolve+ finally crapped out, i guess i could have swapped batteries but i think that would have cost as much as this speaker! It sounds very comparable to the Bose with higher trebble notes. Totally satisfied with this speaker and i didn't spend 300 bucks for something similar. It locks onto phone bt with ease. I didnt time how long battery lasts but it plays for hours a day and i plug in when we shut it off. I like the cloth exterior better then the Bose also. Buy one, you will love it.","timestamp":"Reviewed in the United States October 2, 2022","profile_id":"AGYZD4J5HPDG2QSZWFNYHMSVZU5A","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R2KUQ1CPBHIUJU","title":"4.0 out of 5 stars Fair price for some nice features","author":"Josh E.","rating":4,"content":"I bought two and paired them. It took a little while to get the bluetooth recognized. Once it was setup, I am pleasantly surprised with the results. I put a speaker nexts to my wife's favorite spot and one next to mine. This allows us to have our own personalized listening experience. Coming from a Sony sound bar to these, I was more than impressed how well they compared. Shipping was fast and I would recommend checking them out for any listening purpose. These will come in very handy in our travels as well.","timestamp":"Reviewed in the United States October 16, 2021","profile_id":"AHBMVCCPH5CWSHJ57IPGAXKBLWCA","is_verified":true,"product_attributes":""},{"id":"R30T2B1X6H5P3Z","title":"4.0 out of 5 stars Good speakers","author":"n","rating":4,"content":"These speakers sound really good and, despite what some people say, are easy to connect and pair in stereo mode or party mode with a matching speaker. Just follow the directions and the speakers tell you they’re in the mode. Just unboxed them so I’m not sure about battery life yet. They are a good size for portability but they’re not tiny and have a little weight and stability so they won’t go flying if someone bumps the table.","timestamp":"Reviewed in the United States December 25, 2021","profile_id":"AEUJQPL7NHAIAN65BY3AEHXG7EXA","is_verified":true,"product_attributes":""},{"id":"RKV5R6KMZRKQ3","title":"5.0 out of 5 stars From tribit to Bose flex","author":"Toussaint","rating":5,"content":"I bought one for me and one for my buddy! A great sounding speaker but they both had issues in charging within a few months, one was replaced by Amazon the other Amazon’s warranty had expired but was still under warranty from the manufacturer but they would not respond to my emails/text! So I’ll never buy another Tribit!🤬","timestamp":"Reviewed in the United States March 30, 2023","profile_id":"AECFGNPRLYCCEOWJG53YYIU2ANCQ","is_verified":true,"helpful_count":6,"product_attributes":""},{"id":"R5FKDJBGM10HB","title":"2.0 out of 5 stars I expected it to last longer","author":"Sal","rating":2,"content":"Not two years old. I know we live in a disposable society but I expect a speaker that costs over a hundred dollars to last a bit longer. It just stopped charging and then it started making a horrible popping sound.I liked it a lot--the sound was decent. So buy it if you want a short-term solution.","timestamp":"Reviewed in the United States February 22, 2024","profile_id":"AHFK36SGZIYSFHCIIDNJTC637DMA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"RD8E1DDT5RQFZ","title":"5.0 out of 5 stars Pint sized but big performance will not dissapoint","author":"RustyRoads","rating":5,"content":"I own both Tribit Stormbox and Tribit Stormbox Pros. I enjoy the stereo with the Pros. Bass on pros is acceptable but not Banging bass. I did find a work around when Pairing to get audio from B side also. After pairing speakers and Fire tablet I power down B speaker and power up pressing Bluetooth. Voice says Stereo mode then it allows B side audio. It did take me some time to find this work around fix. Trial and error. We use them for our inside and outside Venues. They work well and pleased with the purchase.","timestamp":"Reviewed in the United States February 10, 2022","profile_id":"AE5CLZDQLVALI7S5L6C3H7EU3ZWQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RHNFLQKTYK7HA","title":"4.0 out of 5 stars Solid Portable Speaker","author":"Ken","rating":4,"content":"Sound quality is comparable to higher-priced brand name speakers. Loudness is impressive for the small form factor. So far (3 days of ownership) I love it.","timestamp":"Reviewed in the United States April 2, 2023","profile_id":"AFAHFRZD6EAOZBNKQOSVNLDPTZ7Q","is_verified":true,"product_attributes":""},{"id":"R22EX555XK8F4I","title":"5.0 out of 5 stars Is the best","author":"denner","rating":5,"content":"I have other speakers, but I was surprised by this great sound quality, great battery, good resistance to water and dust, and most importantly the best technical support I've ever seen, not even Bose, Sony and Samsung gave me the support I received from tribit","timestamp":"Reviewed in the United States June 22, 2023","profile_id":"AHMXCFKZXJJ7XYI6GQTNRSGP7M3Q","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R2LQ815YSCPETJ","title":"5.0 out of 5 stars Great upgrade from original","author":"Benjamin","rating":5,"content":"I have had the xsound go, 2 original storm boxes. These are a great upgrade. I also have 2 bugani m83s and just one of the originals sound way better then them. These new pros blow the bugani away in sound quality and are also half as big. A couple things to note. The color of the pro is a lighter , almost dark grey and not as black as the original. Also when you turn these on they aren't an annoyingly loud voice or sound the same with turning off. The bugani m83s have a loud sound. The new pros also take a usb-c plug. They also don't have a headphone jack. If you can get 2 so you can hear how they are supposed to sound. But even one was pretty good by its self.","timestamp":"Reviewed in the United States May 2, 2021","profile_id":"AF6OADBOPOF6U2D3WOBA6CJ2QQ7A","is_verified":true,"helpful_count":26,"product_attributes":""},{"id":"RCJ2IZE25M9RN","title":"5.0 out of 5 stars Best portable speaker for the $","author":"ibpito","rating":5,"content":"Sounds great for the size. Best in class I think. I have the Tribit Blast also. Blast is bigger and much louder. Both have great sound fidelity. Highly recommend both.","timestamp":"Reviewed in the United States August 5, 2023","profile_id":"AG2XJEBIG3JGTK2FH6P52WMZKNDQ","is_verified":true,"helpful_count":1,"product_attributes":""}],"page_type":"Question","asin_in_url":"B08MZZTH1N","product_name":"Tribit StormBox Pro Portable Bluetooth Speaker with 360 Sound, Bluetooth 5.3, IP67 Waterproof, 24H Playtime for Outdoors, Black","parse_status_code":12000},"created_at":"2024-09-08 14:31:07","updated_at":"2024-09-08 14:31:20","page":10,"url":"https://www.amazon.com/product-reviews/B08MZZTH1N?reviewerType=all_reviews&pageNumber=10","job_id":"7238554452976736257","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-08 14:31:07","domain":"com","geo_location":null,"id":"7238554452976736257","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B08MZZTH1N","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-08 14:31:20","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7238554452976736257","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7238554452976736257/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7238554452976736257/results/1/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/2/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/3/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/4/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/5/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/6/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/7/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/8/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/9/content","http://data.oxylabs.io/v1/queries/7238554452976736257/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7238554452976736257/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7238554452976736257/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7238554452976736257/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7238554452976736257/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7238554452976736257/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7238554452976736257/results/10/content?type=parsed"],"method":"GET"}]}}