{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=1","asin":"B07DD3VXRZ","page":1,"pages":207,"reviews":[{"id":"R1WVYU9DT4KDFU","title":"5.0 out of 5 stars Small but Mighty: Ultimate Ears BOOM 3 is an Audio Essential","author":"Kathleen","rating":5,"content":"The Ultimate Ears BOOM 3 Wireless Bluetooth Speaker is small but powerful. It's easy to pack and bring with you, making it an essential item during my recent move. The speaker easily connects to my iPhone and plays music and podcasts with ease. Its compact size is convenient but can make it easy to misplace when you're busy moving, so keep it nearby and charged so you can easily find it. Extremely satisfied with the battery life.","timestamp":"Reviewed in the United States July 26, 2024","profile_id":"AHP3MWGHFNQNNNAOQEZKYORO6CXA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RBPSRRB4CO7OW","title":"5.0 out of 5 stars great sound / greatest app / use multiple speakers at same time","author":"John","rating":5,"content":"this is a great mobile speaker – not too big not too small - best feature is the phone app allows multiple speakers at same time / water proof - great around the pool","timestamp":"Reviewed in the United States August 11, 2024","profile_id":"AH6WQR3CBXOXSLPQ2ALPCEMG5T2Q","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R2ZSP7ZGA8LW3D","title":"5.0 out of 5 stars Great sound!","author":"BJ A.","rating":5,"content":"I was curiously cautious about the sound this would provide because it is a small speaker, but it did not disappoint. When paired with my phone, it's easy to adjust the volume and sound. Definitely worth the money. Easy to pair, easy to use, great accessory to have around the house.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AE3FOFY7H357C6RMK3TANIOXYTEA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1OGZ820CCA09F","title":"5.0 out of 5 stars Sound great!","author":"Ken S.","rating":5,"content":"I have four of these. I have trouble syncing all four sometimes, but I eventually get them all synced. They have great sound and I use them around the pool, so it’s good to know I don’t have to worry about them getting wet.","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AENEAGOB6XQHK44BBOOB25HQEFEA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R2B9PBHYAQPSQZ","title":"4.0 out of 5 stars Ue boom 2 was way better","author":"Jeremiah gray","rating":4,"content":"Great speaker for price and size. Lacks the crisp sound and bass of the ue boom 2","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AHOCABIBSZLRGOUPGGWKNWY6M42Q","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1Z257L9MRQGJ8","title":"5.0 out of 5 stars Excellent sound","author":"Leah Payne","rating":5,"content":"I love this little speaker. It has such great sound. It easily connects to my Mac mini or my iPhone.","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AEOP4OT6CF27ETIZNGJINBGJ6ZAQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R28KFAR0FBMJER","title":"5.0 out of 5 stars Great sound","author":"Emigdio Hinojosa, Jr.","rating":5,"content":"These UE Boom 3 speakers sound great. They party up feature works flawlessly. Does not take much for them to be loud. Only thing that could be improved is the renaming of the Bluetooth device. When you rename in your Bluetooth settings, that name does not transfer over to the UE App or vice versa. So you have to rename the same device in two different places. Sight inconvenience, but for the sound and quality not worried about it. Would definitely purchase again.","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AHK76NGFACELYG54U222JYZ637XA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R3FXXMYB4LCBKF","title":"1.0 out of 5 stars The worst speaker every when used as two or more together","author":"Charles Magnuson","rating":1,"content":"The media could not be loaded. I have two opinions of the Ultimate Ears Boom speakers.When used as a single speaker, the Ultimate Ears Boom 3 speaker works well. The sound quality and loudness are good for a speaker of its size. The Bluetooth range is rather pathetic as I lose connection after moving about 20 feet away from the speaker's audio source, but I blame Bluetooth for being a lousy wireless standard more than the speaker for that fault. The speaker can be used every day in the shower with no negative repercussions. Overall, the Boom 3 speaker is a great speaker when used by itself.The situation completely changes when attempting to use two or more Boom speakers together. I'll go into details below, but I can confidently say that I've experienced few pieces of technology that are more unreliable and frustrating than the Boom 3 speakers when trying to get them paired together and playing the same audio.First, the Ultimate Ears Boom app is a huge frustration. Getting even a single speaker to show up in the app can require multiple disconnects, app force quits, and speaker restarts. Once a primary speaker shows up in the UE Boom app, getting other speakers to show up is near impossible. Each and every day I want to use the speakers together, I have to go through a 20-minute process of forgetting Bluetooth settings, repairing, and powering off and on speakers. It is such a frustrating process that I usually rage quit and forgo using the speakers together.Then, once the speakers are connected together they regularly start clicking and thumping as they stutter during audio playback. Even when I move the two speakers within a foot of each other and the audio source, they regularly and constantly stutter and lose bits of audio. Listening to an entire song without missing parts is impossible when using the Ultimate Ears Boom speakers together in Party Up or Two-Up mode.Simply put, THESE SPEAKERS DO NOT WORK WHEN PAIRED TOGETHER. The Boom speakers are completely worthless when used together as the audio they play is unlistenable.I really enjoyed the single Ultimate Ears Boom speaker I used on its own for about two years, but after experiencing the disaster which is Party Up mode and the Ultimate Ears Boom app, I will never again purchase another Ultimate Ears product. This experience has just been too frustrating and I've wasted $300 on two speakers I cannot use together.","timestamp":"Reviewed in the United States November 2, 2018","profile_id":"AFN57XUWIRHZ24FA7IVOW5HXLL2Q","is_verified":true,"helpful_count":284,"product_attributes":"Color: Sunset RedPattern: Speaker"},{"id":"R3E39REOEKMJHO","title":"2.0 out of 5 stars DO NOT BUY: Ruined my relationship with ULTIMATE EARS :(","author":"Hailey DeArruda","rating":2,"content":"💗Let me start by saying before buying this product I have been a HUGE, longtime fan of the Ultimate Ears brand.I purchased the original Wonderboom portable bluetooth speaker maybe 5 years ago or longer? I originally purchased it because I wanted something waterproof that I could use in the shower. It was GREAT for that purpose, and also proved to be an awesome all-around portable bluetooth speaker. Sound quality was great for the price range and size. Volume was SUPER as well. I loved the big loop on the back that you could hang on all sorts of things. I LOVE the concept of the Magic Button in the center to Play, Pause & Skip. The Skip Feature is ESPECIALLY hard to find on a speaker in this price range and I love it for use at work when I may not be able to easily access my phone. Bluetooth connection was great. Battery life originally lasted anywhere between 4-6hrs at least which was great. THIS SPEAKER LASTED ME AT LEAST 5 YEARS with little to no change in quality. I LOVED THIS SPEAKER! Unfortunately, I left it at work one week when I was on vacation and just left it there figuring my coworkers could use it and would respect it enough. Long story short, I came back and it wasn't working as well or holding a charge properly. It was a sad end to a good story.🔍Finally, I find myself in need of a new speaker. Because I LOVED my original WONDERBOOM so much, I decided to search within the Ultimate Ears line.((It also just so happens at my current job our department owns two WONDERBOOM2 speakers! I've noticed their battery life doesn't work as well, but they still worked pretty decent.))So I wanted one of the newest, nicest speakers in the Ultimate Family. The Hyperboom was too large to transport from home and work, and cost way more than I was looking to spend, so that was out of the question. So immediately I decided to research between the BOOM3 & the MEGABOOM3. In conclusion, through reviews I read I concluded that most consumers felt the bass was overpowering for the Megaboom3 with no real volume increase, and simply diminished the quality of the sound. SO, I DECIDED TO PURCHASE THE BOOM3!1️⃣🆕First impression out of the box, it looked nice enough. I preferred the more compact design of the Wonderboom, and DEFINITELY missed the larger, more practical loop. It still has the magic button which is a HUGE selling point to me and very accommodating.I charged it up to 100% and decided to unplug it and test it out for a while at home. It worked well, sounded almost exactly like the Wonderboom as far as sound QUALITY. I might be wrong but as far as VOLUME goes I feel it may have had the same volume limitations as the original Wonderboom, if anything maybe SLIGHTLY louder. However, I was happy it seemed to be fully functioning and worked just as well as my other one.I also liked that in addition to that, I was able to use the Ultimate Ears app in conjunction with the product to REMOTE START the speaker from my phone. Again, this is another HUGE selling point to me because I mainly use this product at work. It also has an EQUALIZER function which is definitely cool, although I don't feel like it's very accurate. It also has some sort of feature where you can set certain clicks on the Magic Button to play certain playlists automatically, which sounds cool although I never got to personally try it.All in all, it seemed like a good replacement at first.⚠️🪫THE NEXT DAY COMES & HERE IS WHERE THE PROBLEMS BEGIN. I come into work with my charger FULLY charged at 100%. I use Remote-Start on the app to turn on the speaker. The Remote-Start feature also displays the approximate battery percentage (by 10% increments) of the speaker. At this point, my speaker was at 100% charge.I used the speaker for between 1.5hrs<2hrs before it gave me the Low Battery warning for 10%. So, I put it on the charger and continued to let it play. It lasted maybe another 20minutes, before it died.Now this is VERY disappointing considering my ORIGINAL WONDERBOOM that came out 5+ years ago would last for 4-6hrs on FULL VOLUME without being on a charger. Not only that, but the ORIGINAL WONDERBOOM would ALSO last for a WHILE on the charger even when battery wasn't full.This was disappointing, but didn't seem like a crisis, just a bit sad.The next day, is when the BIGGER issue began. I admittedly forgot to charge my BOOM3 when I got home the night before, and then brought it to work. When I wake up, I charge it until I leave for 1.5HOURS!When I arrive at work, I charge it for an additional 1HOUR before, checking the battery percentage on the app which reads 60%. So, I decide to turn it on and use it while STILL LEAVING IT ON THE CHARGER. NOT EVEN 30 MINUTES GO BY UNTIL THE SPEAKER DIES!!!!!!!!! So, irritated I turn it off, opt for my AirPods and leave the speaker to charge for a few hours. I let this SPEAKER CHARGE FOR 4 MORE HOURS BEFORE USING IT. Finally, I check the battery on the app which only says 40%????? So I turn on the speaker and leave it plugged in, IT LASTS FOR LESS THAN ONE SONG BEFORE DYING!LET ME TELL YOU, THIS SPEAKER BROUGHT OUT PURE RAGE IN ME AT WORK. 🪫⚠️😡I feel so pissed, and cheated and ripped off. I was such a big fan and advocate for the Ultimate Ears brand, but how are you gonna sell me a NEWER, MORE EXPENSIVE speaker and MAKE IT SIGNIFICANTLY worse. Considering this is the BOOM3, I WOULD HOPE & ASSUME IT IS GOING TO BE BETTER THAN THE ORIGINAL WONDEBOOM FROM 5 YEARS AGO, BUT I GUESS NOT. Thanks, Logitech, just charge me more money for a FAR INFERIOR PRODUCT, with the illusion that is going to be somewhat improved. However; this speaker is simply, for my needs- UNUSABLE & FRUSTRATING!!! HUUUUUGE DOWNGRADE 👎😢Very, very disappointed in the Ultimate Ears brand for putting out this one. Like I sad it really is a shame because I was a HUGE supporter of their brand and unfortunately this product was so disappointing and frustrating that it has ruined my relationship with this company for good.I loved the convenience of the Magic Button with the Skip Feature, the portability, durability, great waterproof technology, super big, useful loop, the sound quality & volume, and the battery life of ORIGINAL WONDERBOOM, but this product has ruined all that unfortunately.⚠️DO YOURSELF A FAVOR AND SAVE YOUR MOMEY 💸 BECAUSEYOU WILL NEED TO RETURN IT & REPLACE IT WITH ANOTHER SPEAKER!!!!!!! THIS SPEAKER IS NOT FUNCTIONAL! ⚠️Sorry, Ultimate Ears, but do better.","timestamp":"Reviewed in the United States November 17, 2022","profile_id":"AFSWDPDFGUZCY4TIBMKU2QD3275A","is_verified":true,"helpful_count":148,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1I3Q77XS8GRO6","title":"4.0 out of 5 stars UE Boom makes a great speaker","author":"Neil Dejewski","rating":4,"content":"Sounds great! Waterproof and drop proof. Two things I do not like, they are not connected to Spotify which is the music app I use and you csan only turn it off with your phone. Otherwise this is the 3rd UE Boom speaker I have purchased.","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AFL3JJSIAFGNWEKZEAUYCTS6Z4SA","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:21","page":1,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=1","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=2","asin":"B07DD3VXRZ","page":2,"pages":207,"reviews":[{"id":"R2TQY3J10VWP24","title":"4.0 out of 5 stars It's A HIT.","author":"Marvin J. Williams","rating":4,"content":"Great product. Very convenient and portable. You do have to keep an eye on the battery usage.","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AFOFED7PNVORXSBQBYDVGF35T26Q","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R283L7EGNSBP8G","title":"5.0 out of 5 stars Price was the same my original UE which was 10 years old !!","author":"Dugald S. Armstrong","rating":5,"content":"It replaces a previously popular product that I owned, and is equally as popular !!","timestamp":"Reviewed in the United States August 28, 2024","profile_id":"AGWB5DRQYIUQDNBFYORPZZ7AX4HQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RDI9J49LMYLTH","title":"4.0 out of 5 stars Set up Is Odd","author":"Lisa B","rating":4,"content":"I like the speaker the set up was weird but not having any problems......","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AENNSSAXFNI2A66ETBMRN4ZCAZVQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R150M5KHKIMLSI","title":"5.0 out of 5 stars Sound quality","author":"jodi","rating":5,"content":"I absolutely love this thing! I want to get another one to use.","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AGEPOLG76B6RA55XD2P3UATHM5GQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R1XX4TUH1QR3UL","title":"4.0 out of 5 stars Buena calidad de sonido, pero...","author":"Jorge Sarmiento","rating":4,"content":"Llevo tres meses utilizando el BOOM 3 y me parece pertinente hablar de sus características. Empecemos por las cosas buenas:1. CALIDAD DE SONIDOEs necesario resaltar la calidad tan excelsa de sonido que tiene este parlante. Los entendidos sabemos que la conexión por Bluetooth acarrea pérdida considerable en la calidad del sonido. Sin embargo, he de decir que el BOOM 3 me sorprendió sobremanera: agudos y medios en su punto y los bajos, aunque poco notorios y exagerados, son cómodos y audibles.2. VOLUMEN Y POTENCIAEl BOOM 3 es ideal para aquellos que quieran utilizarlo en una habitación pequeña o en una reunión o fiesta. Esto es así porque puede llegar a ser discreto y a la vez muy potente sin llegar a afectar demasiado la calidad de sonido.3. WATERPROOFNo he testeado el parlante sumergiéndolo de lleno en agua, pero se ha llegado a mojar levemente y hasta el momento no ha presentado problemas.Llegó la hora de hablar de lo malo:1. CARGA Y BATERÍASi bien es cierto que la duración de la batería no es el fuerte de este aparato, uno esperaría más por algo que cuesta más de cien dólares. Hay aparatos muchísimo más económicos que tienen una carga más duradera independientemente del uso. Si usas el BOOM 3 discretamente, la batería puede durar más de 10 horas non-stop. Pero si usas el BOOM 3 con el volumen máximo, la carga solo te va a durar cuatro o cinco horas (a menos que lo uses mientras esté conectado a la energía). Se entiende que se hayan decantado por un uso más discreto y se hayan enfocado en un parlante que provea una calidad de sonido óptima, pero repito: este parlante cuesta más de cien dólares y me parece que la batería quedó a deber.2. BUGS Y FUNCIONALIDADES INÚTILESEl botón Magic está muy bien pero tiene muchos defectos. Por ejemplo, no reconoce si laa playlists que añadas están en aleatorio y las termina reproduciendo por default. El conectar dos parlantes con la app me parece genial pero dudo mucho que alguien lo vaya a usar del todo. Con la app de Ultimate Ears no siempre puedes conectarte al aparato y en esos casos debes encenderlo manualmente. Hubo una vez que el aparato no respondía a la conexión y, debido a que la caja no incluye un manual de instrucciones, tuve que buscar en internet para ver cómo lo reseteaba por defecto.Resumiendo:Buena calidad de sonido, buena potencia y buena resistencia al agua. Mala distribución de la carga y mal sistema de conexión.¿Vale la pena comprarlo? Depende de cómo lo quieras usar. Si pretendes usar un parlante para un uso más doméstico y disfrutar de la música en una calidad de sonido decente, este es tu producto. Pero si quieres algo más profesional o externo, puedes conseguir algo mejor.","timestamp":"Reviewed in the United States June 24, 2023","profile_id":"AE55TVZYQ4SFDSGABXMU7JPEDKFA","is_verified":true,"helpful_count":14,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RBXUT26TZZ5TB","title":"4.0 out of 5 stars Very portable fits my cup holder.","author":"Barbara Q.","rating":4,"content":"Sound is good.will link to my other one.","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEWTICVTM6TSFLFVXGO7RSYJOM6Q","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R17ZXCX6X6WENH","title":"5.0 out of 5 stars Excelente producto. Más pequeño y mejoradodo a las versiones anteriores","author":"Alberto Escudero","rating":5,"content":"Llego bien embalado en perfectas condiciones y funcionamiento. Me gusta 👍","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AGIOCFR7LKRSGZOKBHHL4S3GUDIQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R1HTUUFD7HGBUT","title":"5.0 out of 5 stars Sound ✔️","author":"Diane Gilmore","rating":5,"content":"The sound quality is excellent! Loud and Clear!!!","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AFQN3KW7G64JQF5XVT3WCA6WI37Q","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"RVDDZUWM2SM2C","title":"5.0 out of 5 stars AWESOME!","author":"L. Lemieux","rating":5,"content":"This is a great item! Great sound and easy to use and setup.","timestamp":"Reviewed in the United States July 25, 2024","profile_id":"AHBN6SJLFU25HP2HTJFWNDDYQMOA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RBLC1A2B1EUEZ","title":"5.0 out of 5 stars Love the sound quality","author":"DivaJe","rating":5,"content":"Love the sound quality. I've added this speaker to my sound system of other Ultimate Ears speakers and I am not disappointed. Thinking about purchasing one more.","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AE7YS2FLN3DAJKW3CWVCBBVRIKZQ","is_verified":true,"product_attributes":"Color: Sunset RedPattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:23","page":2,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=2","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=3","asin":"B07DD3VXRZ","page":3,"pages":207,"reviews":[{"id":"R1LPF66JZO37LR","title":"5.0 out of 5 stars Sounds great and very easy to setup","author":"Chuck La Scola","rating":5,"content":"Great sounding blue tooth speaker and very easy to pair","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AHS56WHSROIJHPZP4O4IY7YIICAQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R242UWFPTXQZHR","title":"5.0 out of 5 stars great","author":"Harvey","rating":5,"content":"great sound and size, very portable","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AEW2RMUJXFFAEUQIZ2NDIIB65ONQ","is_verified":true,"product_attributes":"Color: Sunset RedPattern: Speaker"},{"id":"R3FKVHP0O0RVMR","title":"5.0 out of 5 stars GREAT !!!!!","author":"BT","rating":5,"content":"THIS WORKS GREAT AND SOUNDS AMAZING!!!!","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AFURRSV4FTIK4NFURPI5V2S6QQRA","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R3FNCFERUIZBWT","title":"3.0 out of 5 stars Bad Battery Life","author":"Tato","rating":3,"content":"Battery last 1-2 hours when using it at full blast. Not as loud as expected, better going off going with the JBL 5","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AENOL3CNO2JYARNOK2FCA7ELJXZQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R1OR0SUHSM1M0I","title":"5.0 out of 5 stars I love this speaker","author":"Tori S.","rating":5,"content":"Love the purple and sounds good","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AHO2RXHVTZ243RWOMXVFA76JRFYQ","is_verified":true,"product_attributes":"Color: Ultraviolet PurplePattern: Speaker"},{"id":"RFKPDA12YU42C","title":"5.0 out of 5 stars Great sound.","author":"SAM","rating":5,"content":"I am a dumy when it comes to tech. First attempt to connect with phone - not successful. Second attempt - YES! I listen all the time now and can walk around the house and do outside some outside chores without wearing my phone everywhere. Holds a charge for a pretty long time. Glad I got this. Rec from a friend.","timestamp":"Reviewed in the United States June 6, 2024","profile_id":"AHFCQTKWVM6NPGL4M7NEWMZDVDUA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RRQRCUHGBU1LC","title":"5.0 out of 5 stars Great sound","author":"Paul Rella","rating":5,"content":"What a great speaker. The sound is amazing/ Had a little issue hooking to blutooth the first time. Now its hooks up instantly/ I recommend this speaker. My son has had one for five years and has had no issues.","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AG4S3OALD26U6CCZUBBXF24FMDSQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R7J35TON0SOCV","title":"3.0 out of 5 stars Work well by itself","author":"TS","rating":3,"content":"It's good by itself but pairing with a 2nd boom was glitch. Qe returned the 2nd one","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AFXTFZEUB5G5PQXHCZZ4CJQM4EPA","is_verified":true,"product_attributes":"Color: Sunset RedPattern: Speaker"},{"id":"R2A7R80788GYH1","title":"5.0 out of 5 stars Syncs well with hyperboom.","author":"J.Merc","rating":5,"content":"Compact with great sound.","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AH2LRTZAEAH47URVKMMBGEBPSTDQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R1BEHS41KBUATD","title":"5.0 out of 5 stars great speaker","author":"Michael Golian","rating":5,"content":"I love this speaker, very good sound quality, very loud, keep battery for long time. Water proof alway plus!","timestamp":"Reviewed in the United States June 28, 2024","profile_id":"AEXGKZ7C7FPUZB23QTV3XDKXGIAA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Lagoon BluePattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:25","page":3,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=3","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=4","asin":"B07DD3VXRZ","page":4,"pages":207,"reviews":[{"id":"ROZJ3USSJG6R7","title":"5.0 out of 5 stars Great sound/ Connects easily","author":"C. G.","rating":5,"content":"Improved my living quality. Sound quality is great. Connects easily to Bluetooth with the right connection assessory.","timestamp":"Reviewed in the United States June 28, 2024","profile_id":"AHO53TDYBZL3J26FO5NFOE5WF4ZQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R34CTL556759U7","title":"4.0 out of 5 stars Overall a good speaker","author":"Adrian","rating":4,"content":"I have been using this speaker now for a year in my car. My car is so old that I can't connect it to my phone, so I thought I should get myself a speaker. A friend recommend me the Boom 3 and then I got it.Sound quality:It is quite decent. It is not sensational but still very good. Therefore, 4 stars.Bluetooth connectivity:It has its issues every now and then, but it can be fixed with a few clicks here and there.Battery life:The only downside is the battery life. It doesn't last that long. I can use it for 6 hours but will then have to recharge.I would still recommend this product though. It is easy to use!","timestamp":"Reviewed in the United States December 1, 2023","profile_id":"AFMG6BM2VFCMMCRNZCI23MSVAUBA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R22IW81PBP0X7P","title":"4.0 out of 5 stars Odd choice","author":"Amazon Customer","rating":4,"content":"Out of the box it sounds OK. A little E.Q. goes a long way . I work in a machine shop and this Speaker gets plenty loud. It feels quite rugged so no problems there. The odd choice is micro usb ? The lack of usb-c is egregious . this must be to push towards their \"convenient \" charger .If sound quality over volume is your thing look elsewhere.Again for a workshop environment its pretty good.","timestamp":"Reviewed in the United States February 14, 2024","profile_id":"AEKSMN3JD64HP23WCKEONTXKIJRA","is_verified":true,"helpful_count":8,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R2UFA952QO83H","title":"3.0 out of 5 stars Disappointing","author":"Lauren","rating":3,"content":"Bought this for boat and jet ski use. The sound is great, lightweight and no issue with the waterproof. But at 100% battery life, only held charge less than 5-6 hours.","timestamp":"Reviewed in the United States July 27, 2024","profile_id":"AE3HSEOZSEG6CYDJE3LNKHLWOTTQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R10AD2QSAZA36K","title":"4.0 out of 5 stars Preferred this over Bose and JBL speakers","author":"Tyler Cash","rating":4,"content":"I went to a Best Buy to look at portable bluetooth speakers. I was able to compare bluetooth speakers from Bose, JBL, and Ultimate Ears. Of all the speakers I listened to at this size and price point, this had the best sound. Best Buy didn't have any BOOM 3 speakers in stock, so I ordered from Amazon. Its been a definite upgrade from my previous similarly sized portable bluetooth speaker, with stronger bass hits and bigger sound overall. The bigger (and more expensive) speakers I listened to sounded better for sure, but the BOOM 3 does great for a more affordable speaker of its size.Its no audiophile speaker. It's tuned for popular music, with particular emphasis on bass and percussive hits. Which is fine, since that's what I was looking for and expecting from a speaker of this size and price. It does a decent job with today's top-40 style music. I don't listen to much rap or R&B, but I think it would do great with those genres as well. Music like Olivia Rodriguez's \"Good 4 U\" was pretty satisfying to listen to. Ultimate ears even provides an app where you can EQ the sound to something that you personally like even better.Music like \"Tightrope\" from the Greatest Showman soundtrack or \"Zanarkand\" from Final Fantasy Distant Worlds was a different story. They sounded muddy and lacked detail in a very unsatisfying way. I don't thing the EQ app can do anything to help that out. You'll want a different speaker if you're looking for a speaker for vocal, orchestral, jazz, etc.","timestamp":"Reviewed in the United States November 27, 2022","profile_id":"AFHDPQ3WBQQMUQNB46TWQCOSHXPQ","is_verified":true,"helpful_count":21,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RLB7S8LT1L3BJ","title":"3.0 out of 5 stars Small for portability, not big sound","author":"Amazon Customer","rating":3,"content":"I thought I ordered the MegaBoom3 to replace my stolen one . Sigh, it is a smaller version . Is a fine speaker, but not with the Bass and presence of the Big Brother .Also what was advertised to be purple, was pink . My least liked color .I will likely order againand be sure it is the one I am wanting this time !","timestamp":"Reviewed in the United States June 28, 2024","profile_id":"AGL7RLNCMAPGRB7KDWWQKSSRXE4Q","is_verified":true,"product_attributes":"Color: Ultraviolet PurplePattern: Speaker"},{"id":"R28NAK5UV9M9II","title":"5.0 out of 5 stars So fast on shipping out another one when 1 of 2 didn’t work","author":"Robin Senneville","rating":5,"content":"I found wonderboom at target on clearance and I should have bought them all. When it wouldn’t take a charge anymore I looked to upgrade. My bf wanted one too because he was so impressed with my old one.So we upgraded to the boom 3, got 2. One was perfect the other didn’t charge. Such easy replacement from Amazon, got it the next day. This one is perfect. You can pair them together to get stereo sound. The sound is phenomenal, pairing is so simple. One of the best speakers out there. I have chosen it over Bose everyday, and I am a Bose girl.If you want immense sound and need it to be easy get any of the wonderboom products.The app is new to me and I need to work with it but I use my Amazon music on it and just party like it’s 1999 in my bathroom getting ready for work.Get the warranty, which I didn’t but should have because when it decides to not charge you will be sad and anxious for a new one. I have had my 1st one for 5 years, I dropped it, regularly and no problems. I use it in the bathroom next to the sink because it is waterproof.The charging dock I haven’t seen it really charge yet, but I could be doing it wrong. But the cord is easy peasy.I love my boom 3 and will stick with Ultimate ears for years to come. You can pair I think up to 20 with the boom 3. I can’t imagine how awesome that will sound.Hope this helps. You will love it.","timestamp":"Reviewed in the United States January 15, 2023","profile_id":"AETQC4NBSGQF5S3HVLNXIJZASK5Q","is_verified":true,"helpful_count":12,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R36JVSEGRT6Z6F","title":"5.0 out of 5 stars Better than expected","author":"Steven L.","rating":5,"content":"I expected the speaker, given the dimensions, to not put out as much quality sound as it does. I can say that I was pleasantly surprised that the music for my daughter's pool party was perfect, and the battery lasted for the entire party.","timestamp":"Reviewed in the United States June 3, 2024","profile_id":"AE4HGH2SVFDOHJTGCW7ZILZ523QA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R2R5IYAXMBHF10","title":"3.0 out of 5 stars Sounds with interference.","author":"LUCIA PONCE","rating":3,"content":"Interference near the microwawe or other electrric devices. Sounds terrible with the interference. Sometimes it is hard to connect three of them especially if one is outside de house. I tried to returned but I could after one month","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AFNCMUAAD2AJLFJWIHHJ63IPEVRA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3LV3B592XDS4L","title":"5.0 out of 5 stars While not used daily, initial battery charge lasted 7 months.","author":"JR","rating":5,"content":"We bought this to provide better sound than can be provided from a phone and it’s delivered. We’re basic when it comes to tech, we just wanted something to listen to outside in the yard while enjoying drinks or dinner in city life and this does just that. Highs and midranges are fine, as could be expected, but bass is surprisingly good for its small size.Admittedly we don’t use it every day and when we do it’s maybe an hour or two. I would guess we use it 2-3 times a week tops and I am blown away that at that rate its initial charge lasted us 7 months. At this rate I’d buy again in a heartbeat.","timestamp":"Reviewed in the United States February 29, 2024","profile_id":"AFWHHAJONI2RRM54XGVDXZRYQAHA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Sunset RedPattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:28","page":4,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=4","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=5","asin":"B07DD3VXRZ","page":5,"pages":207,"reviews":[{"id":"R3BK3Y1BIVTSAI","title":"5.0 out of 5 stars UE Wins again!","author":"Brad Parker","rating":5,"content":"I just broke my last UE boom that I had for 9 years, It only broke because of me. This one arrived today(boom3) and it’s better than the last one in every way. It arrived brand new in an undamaged box, all the plastic was in place. It sounds terrific, it’s absolutely beautiful and the update to the buttons and charging port location are exactly what it needed. Time will tell if the quality stands up to their high standards from 9 years ago but I’ll update my review if needed.","timestamp":"Reviewed in the United States April 16, 2024","profile_id":"AEFE32SFX5DD3REAISCXNVGUIS3Q","is_verified":true,"helpful_count":4,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1RQHCQEACY6Q3","title":"3.0 out of 5 stars Audio Hiccups, inconsistent product quality.","author":"Vincent Chen","rating":3,"content":"TL;DR - had one for 3 years until it started cutting in and out, so I got a new one and it started cutting in and out after only 3 weeks of use. The inconsistent quality is frustrating and I will be looking for a different speaker now.I originally bought one in 2020 and it lasted me 3 years of almost daily use until it started cutting in and out. It would play music and then briefly cut out and back in (like a hiccup) every few minutes. I found it pretty annoying so I ordered a new one. This one was even worse as it started cutting in and out like the last one, but after only 3 weeks of use. I initiated a return, and hopefully I can get it because I threw the box away after I opened it. After 2 of the same speaker, I would say I don't really recommend this one because while my first one did last me 3 years and was great, it seems that the quality of them is inconsistent, so I will be looking for a different one soon.","timestamp":"Reviewed in the United States February 1, 2024","profile_id":"AE2V2FGKUSXIKL3U3IWWW4L42IKA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"RC98DL930KHXB","title":"4.0 out of 5 stars Control from Phone for most music apps","author":"Chris","rating":4,"content":"I just got this yesterday and so far I like it alot. The sound quality seems very good. Charging via USB seems a bit slow but I will receive the charging dock tomorrow and assume that will be much better.I thought the description said it works with many music apps. It seems to work only with Amazon Music and iTunes, neither of which I use any more. I use Spotify and it does not sync to that, but not a problem for me-- I simply control it from my phone.I like the look of this speaker and its small size makes it easy to place in a room or outdoors. Overall, I think it's excellent!","timestamp":"Reviewed in the United States November 1, 2023","profile_id":"AFZVTRDBLZDJYSMRFL5VODALTOQQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R294YZXPW32GTJ","title":"4.0 out of 5 stars Decent sound quality","author":"Ronald Cormier","rating":4,"content":"Good little speaker but somewhat lacking in bass response- perhaps the model that has enhanced bass would have been more to my liking but i'm still happy with this one.","timestamp":"Reviewed in the United States March 8, 2024","profile_id":"AGNDOPVHALTRDBMY445OI65JF3AA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R3XLQMJKF9XW6","title":"5.0 out of 5 stars Great speaker","author":"urib_rafa","rating":5,"content":"Indestructible","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AFYABLD5FS4KVSYFD2I4KK235RFQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3V794SYYJT395","title":"5.0 out of 5 stars Great Sound","author":"Herb Chang","rating":5,"content":"I was surprised of the full tonal range produced by this small object. Rivals my traditional amplifier and standup speaker system. Using it in my living room only.","timestamp":"Reviewed in the United States June 4, 2024","profile_id":"AGTCNJSWVKH7YRIFHXCVNWPNRTTQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3EYE7RQY3A6NT","title":"5.0 out of 5 stars Bad experience for my birthday.","author":"beth80","rating":5,"content":"The media could not be loaded. I bought this speaker cause i heard good thing about it , i get the Boom 3 , my friend told me to get the megaboom, but i get the small one , i was so excited ,i get it one day before my birthday and next day we was going to the beach to celebrate, i put the speaker to charge but i didn't check if really was charging (new product) why to check?.. well next day 2 hours later when the party begins , the speaker died 😢😢 i was really upset all day on my birthday , i had a portable charger and wasn't working, came home put it to charge and nothing , i try other cable , other plug and nothing... I contact Amazon customer service and they replaced for a new one... Today 05/26 put the new speaker to charge and is charging so far , sound beautiful ❤️ but is too early to give them 5 Star ⭐⭐ i will change the start when i am confident that is a really good product ... Updat.. today 03/21/2024 almost two year I get this speaker... I will give them 5 stars cause this radio speaker still perfect, still sound nice and battery life is great.. I bought other one cause u can connect other speaker through the Boom app in the same channel and play music together. 💓💓 It said is waterproof.. well yes it is .. I am really bad and put the speaker inside of my pool 🫣 ofcourse will sound horrible but I took it out and the speaker still good and sounding beautiful 💓💓💓","timestamp":"Reviewed in the United States May 26, 2022","profile_id":"AEGDCAG5SPZMEU7QNNDAXY52P6EQ","is_verified":true,"helpful_count":7,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"RL5PU0IJCCEPD","title":"5.0 out of 5 stars Bluetooth Speaker Exceeds Expectation","author":"Morris","rating":5,"content":"The Bluetooth speaker sound was crystal clear, and the volume control made it easy to determine the level of sound needed to make the listening enjoyable.","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AHVGPRFFMUG5RYTNZQMZUA7VU5AA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R2L6X91G8AKD1D","title":"5.0 out of 5 stars Nice, booming bluetooth speaker!","author":"MD","rating":5,"content":"Really like this speaker. We went on a trip and forgot to bring our old speaker, and this one was on sale. It really kicks! Great 360 sound, and you can pair them with other UE speakers.One thing - I wish the speaker would tell you when the battery is like 1/4 full. It will tell you when it's almost empty, but that's not helpful if you're in the middle of a movie.","timestamp":"Reviewed in the United States April 10, 2024","profile_id":"AELBG2S6SOF37X3ZQXP4IL5RIE6A","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RPIUEGHLG92OL","title":"5.0 out of 5 stars great product","author":"ZL Wise","rating":5,"content":"bought for personal parties, great item, arrived as described.","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AG6PXESSEUF2PARZGQM4CHKWKXUA","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:30","page":5,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=5","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=6","asin":"B07DD3VXRZ","page":6,"pages":207,"reviews":[{"id":"R1MG47VDLCYIU1","title":"5.0 out of 5 stars Excellent design.","author":"SRT","rating":5,"content":"Not super durable in the sun at the beach, ours blew the speakers when hot, but we love it so much, this is our third one. Great product with respect to battery, waterproofing, and tech.Would buy again and again.","timestamp":"Reviewed in the United States May 11, 2024","profile_id":"AHGSEKLPGKGMQGWOMN37OLUWJVUA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RGLR4THOPALXS","title":"5.0 out of 5 stars Yes!!","author":"N2of2","rating":5,"content":"This Bluetooth speaker does what it says it will do. Very happy, and I'm excited to know that you can pair more than one together.","timestamp":"Reviewed in the United States May 25, 2024","profile_id":"AEWL2Z4MLGHJPJLQY5IHCNXVGPQA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1XGQZDCFDZ31G","title":"3.0 out of 5 stars Fingers crossed that this one lasts longer","author":"Henry E. Harris III","rating":3,"content":"This is the second Boom 3 I have purchased since the first of the year and I hope the speaker drivers don’t fail after 2 months like the first one. Additionally, the Bluetooth can be tricky to set up with your media devices if you have previously paired another Boom 3.","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AEUIH5ELWYWQQJAV2IBP4PDFUFTA","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R2ZKGNRMK2Q8QV","title":"5.0 out of 5 stars Perfect Portable Speaker","author":"Bob","rating":5,"content":"Likes:SmallPortableYou can push the plus and minus keys and it tells you how much charge is leftEasy connectivity to blue toothExcellent SoundYou can turn it on and off from the app on your phone.Dislikes:Hmm, Sometimes I forget where I took the thing so I have to go hunting.","timestamp":"Reviewed in the United States April 19, 2024","profile_id":"AF5XQVVR7EYDZHNU4JXNLLVWUIOQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3LK25SSVGTFK3","title":"5.0 out of 5 stars Very nice","author":"LoganBoy","rating":5,"content":"Replaced my old JBL Charge. To my untrained ear, this is a great replacement. Size is perfect, very protable, volume and quality is perfect.","timestamp":"Reviewed in the United States May 30, 2024","profile_id":"AGWSFU7QLDEDVVYQN2JSLDBC5CEA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R1EBI50DVCCZ86","title":"5.0 out of 5 stars Great","author":"steve","rating":5,"content":"Sounds great. Better than I expected","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AFVKEFBTDZZG2XK37MLJ6ZM347IQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1XG6KT5TI4KAI","title":"5.0 out of 5 stars Best portal speaker for at home or on the go","author":"Amazon Customer","rating":5,"content":"We had the original speaker for years and just started to have some issues. We love our new upgrade speaker.","timestamp":"Reviewed in the United States June 1, 2024","profile_id":"AG2V7FH2HCGH3PARKL23IJOZX7FQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"RWTBPUPLV691C","title":"5.0 out of 5 stars They sound GREAT!!","author":"Mark Pompe","rating":5,"content":"I have several boom 3 speakers in the house. They sound great and I plan on adding more.","timestamp":"Reviewed in the United States May 30, 2024","profile_id":"AHINC3RZ75MIUIRH3DOTV54PT7LQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3IBCRRSGMO5ZG","title":"5.0 out of 5 stars Upgade from the first Boom","author":"Armelle LE GUELTE","rating":5,"content":"I have the first Boom that is still working after 10 years! I recently upgraded to a new phone and, the Bluetooth connection wasn't great. I decided to get a newer version. As with my previous model, the sound quality and the waterproofing are great. This model is a bit bigger. The battery life is good however I wish they would include the plug and not just the cable USB (I'm using the plug from my older model). The main reason why I bought another Boom is because I liked my first model.","timestamp":"Reviewed in the United States February 21, 2024","profile_id":"AFFP6CDQ2G4S7STVRHEGS3YJ36SQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R200IE3MUNI9EU","title":"5.0 out of 5 stars good size + sound quality","author":"Omar Siddique","rating":5,"content":"Nice clear mids & decent bass, in an attractive device, make this an all-around winner.On the negative side: there's a mostly unnecessary app, oversized volume buttons, and a I'd prefer it had a USB-C power connector instead of the old \"micro\" connector.Over all, this is a great speaker. It also looks really nice, and feels solid in-hand. The UE is small/light enough that I use it as my travel speaker, although I prefer the boom-ier bass on my (heavier) JBL for workout and party music at home.This speaker sounds good, but not obtrusive-- natural for various genres. The default tuning is \"fine\". Unusual for a Bluetooth speaker, there is an EQ feature on the app, but it doesn't let you turn one band up without decreasing the others. Good for tuning the sound quality for eg, spoken podcasts, but you can't turn up the bass or the treble like you might on a usual sound system.The app also allows using the speaker's top \"smart\" button to automatically launch playlists without otherwise interacting with a device. A clever idea, but since I usually use an AI (like Google Assistant) I find it unnnecessary, and better to not have too many random apps installed. The speaker works beautifully without the app-- totally optional.I used to buy Logitech PC speakers long ago, and they still make good \"gaming\" speakers. It's interesting Logi acquired Ultimate Ears, a brand I hadn't heard of before. A good move on their part, as this is one of the two best speakers I tested recently in my search for the perfect hardware.Highly Recommended.","timestamp":"Reviewed in the United States September 3, 2020","profile_id":"AGMITI35DNIHMTUWA6JSEYH43FGQ","is_verified":true,"helpful_count":9,"product_attributes":"Color: Sunset RedPattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:31","page":6,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=6","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=7","asin":"B07DD3VXRZ","page":7,"pages":207,"reviews":[{"id":"R2DNQ36MKGLQ8","title":"5.0 out of 5 stars This speaker can withstand anything.","author":"DayTime","rating":5,"content":"I bought this speaker back in 2021, and this speaker has never doubted me. Decent battery life, water resistant, but I took it to the extremes last night. I accidentally knocked my speaker into my laundry load on a heavy cycle, with pre-soak, and once my laundry was done.. Pulled out my linens and I saw the speaker. I was absolutely stunned. Turned it on, AND IT STILL WORKS! This is your sign to buy this speaker! I will only be buying speakers from this brand for now on. I still cannot believe it works, plus it smells good now too 😂","timestamp":"Reviewed in the United States January 31, 2024","profile_id":"AHJZKDGHCQ22H4VXOXJPTHRUASRQ","is_verified":true,"helpful_count":7,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R9RE250NEL7XW","title":"5.0 out of 5 stars Durable loud","author":"Mel","rating":5,"content":"I like how you can pair with other boom speakers very easy to use with the app","timestamp":"Reviewed in the United States May 23, 2024","profile_id":"AHTPM4N3UXK4MQTRKE2FJR7XPUZQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Ultraviolet PurplePattern: Speaker"},{"id":"R3PYX1AJX3P3X3","title":"5.0 out of 5 stars Battery died and will not recharge after 1 year.","author":"vegas","rating":5,"content":"After a little over a year of use, the rechargeable battery died on Boom 3. I have cheaper rechargeable speakers that have lasted years compared to Boom 3. Severely disappointed.Kudo's to Logitech support. Amazon provided a contact number and Logitech promised to send a replacement. I've changed the rating to reflect their attentive customer service.","timestamp":"Reviewed in the United States March 20, 2024","profile_id":"AF5MHKL5AV7G2YI3CNOMLEOC7BNA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R2F3M5B4OMXVWI","title":"3.0 out of 5 stars UE Boom 3","author":"Nick","rating":3,"content":"Advertised As fifteen hours battery life.I'm lucky if this even last four hours.","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AE5MWVPVHFZKXOUZ7WPOGOVHECRQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Sunset RedPattern: Speaker"},{"id":"R34ZGQLPQYJG7W","title":"4.0 out of 5 stars Good sound and Great battery life!","author":"rhonda","rating":4,"content":"Connecting two or more speakers can be tricky at first but once you figure it out works Great! Excellent speakers. Would recommend!","timestamp":"Reviewed in the United States January 11, 2024","profile_id":"AE34ZC4QMMEKM7XSKYRRLIE2WHMA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RK0XZEYV53B4A","title":"5.0 out of 5 stars these are my favorite","author":"KSirven","rating":5,"content":"I have three of these and create my own surround sound with them. They are easy to travel with and the sound quality, whether you have one or three, is superb. I am very happy with these.","timestamp":"Reviewed in the United States April 7, 2024","profile_id":"AFC55ACC32JUE4MF7CBLODIYO72A","is_verified":true,"helpful_count":4,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1QN65RW2985N","title":"5.0 out of 5 stars Good sound","author":"John T Janowski","rating":5,"content":"Battery life better than expected","timestamp":"Reviewed in the United States May 28, 2024","profile_id":"AEQYIMA446DZQ6ZQ7BUX4XPPKOTQ","is_verified":true,"product_attributes":"Color: Sunset RedPattern: Speaker"},{"id":"R2P9KESRJE25O0","title":"5.0 out of 5 stars Seems like a good choice","author":"Christopher Gould","rating":5,"content":"I like my new speaker. Sound quality is good and it looks like it can last a good while. Didn't know you had the ability to replace batteries if they go bad ( I like that one is able to do that )","timestamp":"Reviewed in the United States March 31, 2024","profile_id":"AFXXDNAZVXQSOD7V5EALHMPM6GDA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1KELUR90PO5A3","title":"5.0 out of 5 stars Great little speaker","author":"Labcoated","rating":5,"content":"I've been putting this speaker through its paces for the last few hours and I'm really impressed. Sound quality, water resistance, and build quality is all there. The app is well designed, pairing is quick and easy, and bluetooth range covers my entire apartment.It's important to understand that you're not gonna get crazy sub bass on this thing, but that's not what they're trying to do here. One thing I really have to hand it to UE for on this speaker is instead of trying to reproduce frequencies in those bottom sub ranges, they have obviously set a hard shelf on the EQ that totally eliminates those frequencies from the mix rather than try to make the small speakers in this unit try for it anyway. A lot of other bluetooth speakers I've heard fail pretty hard at that and you end up with distortion and a lot of muddiness in the low range because of it. The tradeoff is that especially low end music (namely drum and bass, dubstep, 808 heavy hip hop and trap, etc) isn't going to exactly shine on this speaker.What does sound great, though, is just about everything else that doesn't rely on sub bass. Rock, jazz, metal, most hip hop, most electronic, funk, r&b, podcasts, etc all sound really clear and have great dynamics. This speaker is also capable of going extremely loud. I couldn't get it past around 70% volume in my apartment without it being excessive, yet the music sounded totally clear and free of distortion even when I cranked it.Also, I brought it in the shower to test and it got wet without issue and dried off quickly.I just got the speaker so time will tell how reliable it is, but count me as impressed. I'm looking forward to taking this on river floats next summer. Really happy that well made, waterproof electronics are readily available now. That was by far one of the biggest selling points to me after the sound quality.They should have used USB C, that's maybe my biggest gripe, I've never cared for micro USB.","timestamp":"Reviewed in the United States December 15, 2018","profile_id":"AGVINZPVX6XN7HFBN4XKCKCLOOCA","is_verified":true,"helpful_count":49,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3A8KOLSCR94PK","title":"3.0 out of 5 stars Where is the charger?","author":"Joyce porter","rating":3,"content":"I dislike it ,did not come with the charger how do I charge it?","timestamp":"Reviewed in the United States May 30, 2024","profile_id":"AFVHHLJLFA756ZK4PCPRHQC7KIGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:34","page":7,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=7","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=8","asin":"B07DD3VXRZ","page":8,"pages":207,"reviews":[{"id":"R32DHSETP1W648","title":"3.0 out of 5 stars much smaller than the megaboom, returned it without using it.","author":"Chris","rating":3,"content":"The pictures make it look like it is much bigger than it is. I returned it and bought the megaboom model.","timestamp":"Reviewed in the United States May 21, 2024","profile_id":"AFJEU36YKX5FOCIJDXGYFMZ2NXEQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R31VRRJ7HJ4BVB","title":"5.0 out of 5 stars Muy bueno","author":"Jacobo","rating":5,"content":"Es pequeño no te confundas, pero me gusta.","timestamp":"Reviewed in the United States May 4, 2024","profile_id":"AHLZYH5BNZA35IOWMNFA4PB22ZRA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3TQ643CQ1BMBY","title":"5.0 out of 5 stars Great Bluetooth speaker","author":"psylph","rating":5,"content":"When I lost my old Boom 2 I decided to upgrade to this Boom 3.It was really simple to connect as I already had the app installed. It's got really great full bodied sound for such a little speaker! (just like the Boom 2 did) The fact that it's waterproof really made using it out by the pool, or at the lake, a stress free experience.Two thumbs up!The only thing that makes no sense sense to me is why it still uses the old mini USB instead of the new USB C. Maybe it's a voltage thing? I don't know, but I really think they should have updated that.That being said, it's got great battery life so far.","timestamp":"Reviewed in the United States September 1, 2023","profile_id":"AEP2F5REWQMD4CY24STJE4C4INFA","is_verified":true,"helpful_count":10,"product_attributes":"Color: Ultraviolet PurplePattern: Speaker"},{"id":"R36Y3PFQ1BU639","title":"5.0 out of 5 stars Amazing sound quality","author":"Justin Jensen","rating":5,"content":"I have owned a different UE speaker before, so I knew they were good, but I absolutely love the sound quality of this model. I've only used it indoors so far but I will be using it outdoors when the weather gets better.","timestamp":"Reviewed in the United States February 27, 2024","profile_id":"AHLDT5ISA4FUF6CR66LEXJ2H6BKA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3MU9M2RN2NMWT","title":"3.0 out of 5 stars Good speaker until the manufacturer defects annoy the hell out of you","author":"Bryan V Palmer","rating":3,"content":"This speaker worked great for about 6 months. The sound was good and so was the Bluetooth range and the battery life is really good. It has notification sounds that play really loud but you can turn them off so that's not a big deal until you can't turn them off, or the speaker.6 months in the \"magic\" button got stuck. It was always a little touchy but it worked and I never paid it any mind but once it got stuck, none of the other buttons worked anymore. The volume and power buttons no longer responded because the magic button was constantly being pressed. There is an app and I could turn the power off that way but minutes later the power was back on because the magic button was depressed. It took days for the battery to run down and at certain intervals it would announce that some feature was not available and to check the aps internet connection, really loudly. When the battery finally ran down it started screaming that the battery was low every 30 seconds. i had to stash it out in the garage.I contacted support and they got back to me saying the warranty doesn't cover the stuck magic button because it was damaged, the kicker is I never said the speaker was damaged, only that the button was stuck.Since it was no longer covered I found a tutorial on how to take it apart and found that the screws that hold the switch in place were so tight that the switch didn't have room to release. I loosened the screws and the speaker is back to working like it should except it's no longer waterproof. That sounds like a manufacturing defect to me. I let Logitech support know what I found and we'll see what they have to say.I would have given the speaker 5 stars but the business with support knocks it down a couple notches in my opinion.","timestamp":"Reviewed in the United States August 7, 2020","profile_id":"AHRLZLHRJOA3UFOB2ZV5EEI2EO2A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R29FMXWVQ06YLD","title":"5.0 out of 5 stars My second one","author":"Amazon Customer","rating":5,"content":"Good all around speaker. Can take it everywhere. This is my second one because I use it in the garage, hot tub and classic beetle. Tried of going to find it so I bought this one.","timestamp":"Reviewed in the United States March 8, 2024","profile_id":"AEMDKWRTXGMJEPDQAHVHJMB3DTQA","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3EPX9DXXS7ZZM","title":"5.0 out of 5 stars Outstanding Customer Service! And a great speaker !","author":"brian otoole","rating":5,"content":"I had the speaker for 9 months and it had a power/charging issue on a Saturday and shut down. I contacted the company on Monday, and spoke to Zaniah. I told her it would not charge and I tried all the steps: changing the power cord and adapter, switched outlets, etc. Within 10 minutes she emailed me the claim instructions. I had the information back to her in an hour and received the new speaker Friday morning. Zaniah emailed me daily with updates on the status. Absolutely excellent response from the company! Totally recommend the Boom-3 speaker as not only does it sound great, but the company stands 100% behind their product.","timestamp":"Reviewed in the United States August 19, 2023","profile_id":"AHPNGBOXKRW53HXFYKJW7JCTITIQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RV5CF7PASAVMZ","title":"5.0 out of 5 stars Good Stuff","author":"Peter J.","rating":5,"content":"Works great","timestamp":"Reviewed in the United States May 17, 2024","profile_id":"AE4PPVI5JGB7AMVWEZTDKQHLLAXQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R2EY32FDBE7MIJ","title":"5.0 out of 5 stars What a difference in sound!!","author":"yogamax","rating":5,"content":"I used to listen to podcasts on my iPhone, sometimes sticking it in a glass for better sound. The BOOM 3 was easy to connect to Bluetooth, has long battery life and the sound quality is great. Now I listen to music, audiobooks, sleep sounds, etc. on my Ultimate Ears Boom 3 and love it. It's easy to turn on/off and adjust the volume with my phone, keeping the push buttons on the unit from being overused.","timestamp":"Reviewed in the United States December 7, 2023","profile_id":"AE65RAXKNT6VXAULVWFZGIVBNPMQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"RGRVQ2EA7AV4A","title":"2.0 out of 5 stars Quit Pairing After 2 Weeks","author":"Beamer","rating":2,"content":"I own a UE Mega Blast and a Mega Boom 3 which both work great. Purchased a Boom 3 and worked well for 2 weeks. Paired it in party up mode with Mega Boom and a day later went to use the Boom 3 wouldn't pair in Bluetooth and UE Boom app wouldn't connect. Talked with Amazon tech support with no luck in getting to pair. Was in return window so returned speaker. Had zero problems with my other UE speakers that I've had for 2 years. Going to purchase another Boom 3 to see if I have better luck. UE makes great sounding speakers with good battery life.","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AEE4BN6PYBZC3LDGLKPAXOO2273Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Sunset RedPattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:36","page":8,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=8","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=9","asin":"B07DD3VXRZ","page":9,"pages":207,"reviews":[{"id":"R3DQI7I96VMDSX","title":"5.0 out of 5 stars Awesome sound","author":"Spy69","rating":5,"content":"The clear and powerful sound and its easy setup make this BT speaker a must have for all those who want to have a high level music speaker. I definitely would buy it again and again.","timestamp":"Reviewed in the United States February 22, 2024","profile_id":"AGKNBFK64NYKHVTNH3XD42TYPD3Q","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1110HOQNNSOB1","title":"5.0 out of 5 stars love it!","author":"Robert M.","rating":5,"content":"Quick connectivity to my cell phone. I take it everywhere. A bit heavy to carry around, though. It would be nice to have some kind of hip holder so I dont have to carry it around in my hand. Bought one for my pastor and he loves it. Great gift for any occaision.","timestamp":"Reviewed in the United States January 29, 2024","profile_id":"AFWM3MV6R4XLQJ7B5FGQZMWDDL4Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R4UO3ZNVN8XQH","title":"2.0 out of 5 stars Disappointed","author":"Toby R Smith","rating":2,"content":"This is our second UE boom speaker. We liked the first one so much we figured we'd buy a second one to link them together and have music everywhere at our house. Well the new speaker gets very crackly and the speaker can't be further than 20' away from each other or they don't work... I can hear the first speaker perfectly fine at 20'. Kind of defeats the purpose of they must be so close to each other","timestamp":"Reviewed in the United States July 3, 2024","profile_id":"AFQUZIYYW25XONVF5V6GE32MESCA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R3J4QOLCB7IAEK","title":"5.0 out of 5 stars Love it!","author":"OneEyedGupy","rating":5,"content":"For my purposes, this is perfect!This stays in my car for kayaking, sometimes biking when in a group, party's, golfing, working in the garage......you get it.Things I love: the size, the battery (usb C would have been greatly appreciated!), the controls, yes, it really floats (but the speaker is under water while it does, not really usable in a pool or spa) and it seems to be built VERY solid.The sound is a little better than average, and that's comparing it to my best sounding Sony and a very nice Bose that both stay in or close to the house. I'm not a snob when it comes to portable speakers, great sound is achieved under controlled circumstances with much better equipment, this is good for what it is!The app is nice, but doesn't add a lot for me, I can get most of the functions it provides elsewhere, except for the battery level, nice to check before heading out for a day or weekend.The only small flaw I've found to date is the lack of being able to answer a phone call with it. I'm torn on how important of a feature that really is, but it feels like they could have added it and still kept their minimal, clean, very simple controls in tact.I'm very happy with this speaker and it's sort of become my go-to, it's beating out a number of very nice options!","timestamp":"Reviewed in the United States July 17, 2019","profile_id":"AEFX2A4BHG3TUNVA5QUDPFTZB77Q","is_verified":true,"helpful_count":8,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R1404CU3E7342F","title":"5.0 out of 5 stars Fabulous","author":"Andy Hunter","rating":5,"content":"I lost my previous one and was so lost without it, within in 2 days of losing the other one I bought this one and bought it because it would overnighted. I love this little monster!!","timestamp":"Reviewed in the United States February 8, 2024","profile_id":"AFYJUCLY3YAGH6R7J7KYYMNDFDFQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Sunset RedPattern: Speaker"},{"id":"RDTJ4OJICTP06","title":"2.0 out of 5 stars Stopped charging after a month, good sound, bad bluetooth, awkward charge cord","author":"Ammon","rating":2,"content":"The sound was good while it lasted. Issues that may concern potential buyers: 1. My Boom3 stopped charging after about a month. It doesn't come with a power adapter. Their instructions and FAQ say to charge using any USB power adapter. I charged it using a surge protector with built-in USB ports. The tiny white charging indicator light has stopped lighting up. The device can recognize that it's plugged into an outlet, but it won't charge. I can't use the speaker anymore, and when I try to turn it on the voice just says, \"Charging, please wait.\" I've tried other plugs and cords, but no luck. I'm just outside the Amazon return window (sucks because I want a refund) so I'll have to check if the company will exchange or credit it under warranty. 2. Was hoping to use it with my PC, but audio keeps cutting out even though speaker is right next to the case. I tried the troubleshooting tips in their FAQ multiple times, followed other user threads and tips, but never got it working well. All other bluetooth products I have (including noise cancelling headphones and testing it with my spouse's JBL speaker) worked fine. I even unpaired and \"forgot\" everything, then reconnected only the the Boom3... still cutting out at regular intervals. This is a pre-built gaming PC and only a few years old, so I really don't think it's the PC's fault. I found numerous people online with similar issues. 3. The cord that comes with this for charging is disappointing. It is micro USB, which means it is awkward to insert. Why not use USB-C on a newer product like this? The cord is solid white, so it looks garish plugged into my black Boom 3. Also, the plug housing is a big square, but the Boom3 charge slot is inside an oval recess - it's very snug and awkward to plug in. Finally, the cord is a flat/ribbon style - it does not want to go where you want it to go.","timestamp":"Reviewed in the United States April 12, 2022","profile_id":"AF2JAXPNOHN4CQ523YQQWVNAZ5VA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R3GXR617W5CHU8","title":"4.0 out of 5 stars Pairs easily, magic button is handy","author":"David S.","rating":4,"content":"At first, the Boom 3 didn't turn on for more than five seconds. I was just about to return until a Amazon video suggested resetting the device. I believe it was \"push the volume minus button and the power button at the same time.\" That did the trick. I installed the phone app and chose the \"more bass\" selection on one of the automatic equalizer selections. The equalizer produced much improved sound quality in my opinion. I got this to pair with my TV, and all I have to do to pair it up after the initial pairing is to push the magic button and it responds instantly. Good product, weather resistant.","timestamp":"Reviewed in the United States October 8, 2022","profile_id":"AHA3EXTPUSK2UMNONPCSYCLWVAZQ","is_verified":true,"helpful_count":9,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R2OTG14DARBWN7","title":"4.0 out of 5 stars Great portable party speaker","author":"vp","rating":4,"content":"The good:+Amazing battery life. Seems to run forever even at max volume.+Decent sound - you can't expect too much from such a small unit but the volume is pretty loud and bass is decent for the size+Portable - perfect for traveling+No issues with bluetooth connectivityThe bad:+Uses micro USB charging - seriously?Overall: I would recommend this as a portable speaker to use while traveling.","timestamp":"Reviewed in the United States May 22, 2023","profile_id":"AF6JYYCE2RMNGHEF7KZIHEYEFQDQ","is_verified":true,"helpful_count":5,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R6MN6ILIOBKWN","title":"2.0 out of 5 stars Cheaper for a reason","author":"Calvin Skinner","rating":2,"content":"I bought one from best buy before this one and there is a noticeable difference in sound quality. The difference in price was only $20, not much. When the volume is more than half there is noticeable distortion, not present on the other one.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AFFW7H6A6OPMCPVVXWDJ6WD2T4FQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"RIM63S708LP9L","title":"3.0 out of 5 stars Not what they used to be","author":"Ivan T","rating":3,"content":"What happened to UE? They used to have great bluetooth speakers. I just read that they were bought by Altec Lansing which explains the drop in sound quality. I owned a UE Boom 1st model and 2nd model and they were amazing. So of course I would buy this model the 3rd gen. Well I was disappointed. First it is not LOUD like the previous models. Bass is sub par but then again UE wasnt really know for heavy bass. So first, I tried the volume at Max outside to see how it was. It was decent but not loud like the other gens. 2nd issue is u will need to download their app to get the most of the speaker but even the app provides minimal improvements. Battery life is better I will say but aound just isnt what it used to be. I would send it back but I gave away my other 2 gens to friends when I ordered this. Do yourself a favor. Buy a bose link instead because this doesnt do it. And the 360 immersive sound that it claims is definitely missing. Disappointed in this speaker to say the least.","timestamp":"Reviewed in the United States September 25, 2022","profile_id":"AHDRTT26OA2NWGHZIQ4XNIKAJDRA","is_verified":true,"helpful_count":6,"product_attributes":"Color: Night BlackPattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:38","page":9,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=9","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=10","asin":"B07DD3VXRZ","page":10,"pages":1,"reviews":[{"id":"R1Q15WFC1AX6LX","title":"5.0 out of 5 stars ¿Como es el producto?","author":"Jose calipa","rating":5,"content":"The media could not be loaded. La verdad me gusto mucho, exelente calidad de sonido, por el temaño no esperaba una potencia de audio mayor por el tamaño que tiene, los sonidos son muy limpios, demasiada potencia de graves y bajos fuertes. Realmete lo recomiendo, ademas el peso es lo mas chido, pesa, lo cual demuestra su calidad al tacto.","timestamp":"Reviewed in the United States November 21, 2023","profile_id":"AE7RXBRO5KRHYUFCL6P2QTJITEBA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R35NBQEDPO572","title":"2.0 out of 5 stars Bluetooth connection continues to randomly cut out.","author":"RSTILL","rating":2,"content":"Bluetooth connection to my Boom 3 speakers is sub-par and unacceptable for something in this price range. I own two identical speakers which were bought at separate times and have the issue with both.The problem is that the Bluetooth connection randomly cuts in & out, similar to a popping. Happening in different environments, with different transmitting devices and also in daisy chain connections which is so bad that I can not use multiple speakers together. The problem is not consistent, I have checked the firmware level in the Boom app and it shows it is up to date. My two speakers experience the issue at all distances from the phone which range from sitting on the device, next to the device and then any distance range until it's to far to maintain connection.The issue comes and goes and has been happening more lately which is driving my dissatisfaction and this review. I really wanted this to be a good purchase so have given multiple chances for them to work at an acceptable level.I do not recommend the Boom 3 to anyone unless you get a serious discount and do not expect consistent sound. I'll definitely try another brand when I get so fed up with these that I just donate them away.Side note, it seems like BT can be spiritic on other speakers too so perhaps it's worth it to just get a speaker that offers a hard connection to avoid the frustrating situations when you want consistent sound over portability.","timestamp":"Reviewed in the United States March 6, 2023","profile_id":"AHDQACXK3VYQ6HYHHKFU3PNQSJBQ","is_verified":true,"product_attributes":"Color: Ultraviolet PurplePattern: Speaker"},{"id":"R2743WGOYTFFJR","title":"3.0 out of 5 stars Good until not!","author":"Fred Frazier","rating":3,"content":"Wanted to give high mark 5stars, but unit stop charging after only 3mo. I'm currently going through warranty process with UE now. Went to Amazon with my problem, & they handed me over to UE. After several attempts to do what UE wanted me to do ie Troubleshooting. Now had to take pictures of unit, pdf format order from Amazon. 14 emails back & forth with UE, hopefully they will get back to me with good news. More to come, all in all the UE speakers have great sound.Update, UE finally shipped out a replacement speaker. 1st person from UE dropped the ball, with all the emails back and forth.2nd person from UE handled the situation more swiftly. Got my replacement speaker in less than 4 days after speaking with 2nd rep from UE.All good no problems with replacement speaker.However, I think that some items should be brought from the manufacturer & not here.. I have another UE speaker from Amazon & the battery dies so fast. The speaker isn't even a year old.So moving forward, I will buy with more caution..","timestamp":"Reviewed in the United States October 27, 2022","profile_id":"AEGIBVJ2KHWUMBO7MQHWL6AJBNJA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R22K4X3W1RKGM1","title":"3.0 out of 5 stars Not worth the price","author":"Zrain","rating":3,"content":"I haven’t noticed any thing special about the soundI prefer the JBL to this","timestamp":"Reviewed in the United States March 31, 2024","profile_id":"AEXKPL4QLNPSYVBBAO3I3DK7D6SA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Ultraviolet PurplePattern: Speaker"},{"id":"R2GI0V9SVJPRQ3","title":"2.0 out of 5 stars Sounds is muddy, micro-USB","author":"Walter W","rating":2,"content":"The micro-usb port caught me off guard. I tried jamming the USB-C cable for about 1 minute. Sorry, but to ship a micro-usb product is just lazy at this point.Also, I do not like the sound. It's muddy in the middle to highs.Update: Replaced it with a Flip 6. I like the sound much better. Much clearer, but not quite as good as my Soundlink Mini 2, though.","timestamp":"Reviewed in the United States May 25, 2024","profile_id":"AHA4BS73C3MSQ3Y5NAFUCKMD4SGQ","is_verified":true,"product_attributes":"Color: Lagoon BluePattern: Speaker"},{"id":"R2MLWKC3JFNFDX","title":"5.0 out of 5 stars Good soeaker","author":"Ana","rating":5,"content":"My husband loves it! It is portable and very good sound. Charges fast","timestamp":"Reviewed in the United States February 28, 2024","profile_id":"AGS455DZKBQHYHYTH2NPU5YUXHAQ","is_verified":true,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"RJEXLAFIRWWRD","title":"5.0 out of 5 stars Idiot proof and a great sound","author":"Cindy","rating":5,"content":"1. Great sounds.2. Designed for fools (like me). Just plug it in and download the app. Nice lady on the speaker leads you through it. Then connect through settings on Bluetooth. That's it!! Love this thing!","timestamp":"Reviewed in the United States November 25, 2023","profile_id":"AHHDFD2FOO7PYT6THV26ARUOB3GA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Ultraviolet PurplePattern: Speaker"},{"id":"R40NGCH3W5BSQ","title":"3.0 out of 5 stars Nice little speaker, but micro USB? Really?","author":"Noah Libby-Haines","rating":3,"content":"This is a great travel speaker with one big flaw. The damn thing charges via micro USB. This is inexcusable and requires me to carry around an extra charging cable specifically for this device.","timestamp":"Reviewed in the United States January 4, 2024","profile_id":"AGQNTSI7GAPRHSXT6OA6WGWV2IRA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R215G1OC4IVNBL","title":"5.0 out of 5 stars Love these, added a small one to my collection","author":"Nigel","rating":5,"content":"I have always loved the UE boom and rec it to all my friends. Its great when everyone brings there's to the beach or a party and we can sync them up. I have the megaboom and finally caught the boom on sale. Great to link up. Highly recommend.","timestamp":"Reviewed in the United States October 22, 2023","profile_id":"AHPX4BSRV7LKSFC6EVI333VVJQGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Night BlackPattern: Speaker"},{"id":"R1RAFBVKRJ21G7","title":"5.0 out of 5 stars All good in a small package","author":"Stretched","rating":5,"content":"I listen mostly to jazz in the background while I’m reading or on the web, usually at low volume - sometimes rock at louder volumes. I’ve bought any number of blue tooth speakers, as a hobby I suppose, always in search of that nirvana sound. They’ve ranged from really small Fugoo units (with unbelievably good sound) to paired floor standing auditorium behemoths that will blow your contacts out. IMO, the UE Boom 3’s are not only a good value, they are superlative in sound from low to high ranges at easy and medium volume. Great for voice, too, e.g. podcasts. I have 2 paired and will likely buy another pair (stereo is nice) for another room.I recently tried the UE Megablast and they don’t hold a candle to to crispness and range of the Boom 3’s. They’re loud and have some nice control features but for sound, IMO the 3’s are the best by far, and uncannily the least expensive of over 10 other brands, up to $300. Unless you’re filling a large room with loud music I’d say the Boom is the best speaker in it’s portable class. Enjoy, and don’t worry about missing any sound - you’ll pleasantly hear it all!","timestamp":"Reviewed in the United States December 28, 2019","profile_id":"AEKGEHD6XSWX34ICGNG3YY3TBUKA","is_verified":true,"helpful_count":12,"product_attributes":"Color: Sunset RedPattern: Speaker"}],"page_type":"Question","asin_in_url":"B07DD3VXRZ","product_name":"Ultimate Ears Boom 3 Wireless Bluetooth Speaker, Bold Sound + Deep Bass, Bluetooth, Magic Button, Waterproof, 15 Hours Battery, Range of 150 ft, Night Black","parse_status_code":12000},"created_at":"2024-09-08 14:33:18","updated_at":"2024-09-08 14:33:40","page":10,"url":"https://www.amazon.com/product-reviews/B07DD3VXRZ?reviewerType=all_reviews&pageNumber=10","job_id":"7238555003172952065","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-08 14:33:18","domain":"com","geo_location":null,"id":"7238555003172952065","limit":10,"locale":null,"pages":10,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B07DD3VXRZ","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-08 14:33:40","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7238555003172952065","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7238555003172952065/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7238555003172952065/results/1/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/2/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/3/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/4/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/5/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/6/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/7/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/8/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/9/content","http://data.oxylabs.io/v1/queries/7238555003172952065/results/10/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7238555003172952065/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7238555003172952065/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7238555003172952065/results/10/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7238555003172952065/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7238555003172952065/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7238555003172952065/results/10/content?type=parsed"],"method":"GET"}]}}